{"title":"[Goa-Psytrance] Enichkin - In Memory Of Love - 2009","uid":5901608,"size":89469710,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:008eef70c97351f0b1289c3ef4ab82e743d5060d&amp;dn=%5BGoa-Psytrance%5D+Enichkin+-+In+Memory+Of+Love+-+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jabildebil","files":-1,"time":1287694880,"description":"Official mp3 release from eMusic.\n\n\n  1. Spring Interpretation\n\n \n  2. Life Extension\n\n \n  3. Elementary Particles\n\n \n  4. Free Now\n\n \n  5. Mescalito Dance\n\n \n  6. Twilight Zone\n\n \n  7. Beyond the shadow of doubt\n\n \n  8. In memory of love\n\n \n  9. Memories\n\n \n  10. Transient\n\nIn Memory Of Love' is an interesting and promising new album from EniChkin.\n\nSergey Nazarenko demonstraits the term IDM (Intelligent Dance Music) in a full scale with this second album. Having been fascinated by the 60's psychedelic era, his music is influenced by its musicians and movement. This is just another reason why Goa Gil has chosen to produce this new album.\n\nThis music is unlike anything else we heard before The album manages here to walk the tight rope between the experimental and the accessible, creating a new vocabulary. This is no upscale club circuit guided by the constitutionally construct, but at the same time sounding seamlessly and substantive, sequenced and fully orchestrated.\n\nIt seems that EniChkin and Goa Gil (who actually was the one who discovered EniChkin) manage with Imol to deliver an acceleration, without reprising the previous album. If it's ecstatically happy kitschy pleasure you're looking for, you will not find it here. Nonetheless, you will come face to face with shimmering fast and multi-layered album that will lead you to gasp in pleasure.\n\nThe album mainly deals with the unlimited field of Duality. Not only by finding a well balanced and updated merge between the golden 60's and nowadays. It manages to recruit a handful of ideas that link to the basic principals which lead to the concept of EniChkin's.\n\nPerhaps it will be received as a breakthrough attempt by some, however EniChkin is definitely a trailblazer in the genre and can be easily spotted as one of the interesting musicians arround. There is no telling where he will find himself next and it is just a question of time till others follow his style","torrent":{"xt":"urn:btih:008eef70c97351f0b1289c3ef4ab82e743d5060d","amp;dn":"%5BGoa-Psytrance%5D+Enichkin+-+In+Memory+Of+Love+-+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"008eef70c97351f0b1289c3ef4ab82e743d5060d","infoHashBuffer":{"type":"Buffer","data":[0,142,239,112,201,115,81,240,177,40,156,62,244,171,130,231,67,213,6,13]},"announce":[],"urlList":[]}}