{"title":"Voyage of the Rock Aliens (1983/85) DVD5 &amp; Soundtrack","uid":5704321,"size":4581093585,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:012209e7d6aa1fc767ec7f6ab55a13ca7c82a148&amp;dn=Voyage+of+the+Rock+Aliens+%281983%2F85%29+DVD5+%26+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spain00","files":98,"time":1279639305,"description":"They've come from outer space ... to play 80s New Wave \nmusic! A wonderfully bizarre treat for fans of bad movies. \nMovies don't get much more 80s than this.\n\nWatch in delight as Devo wannabes from outer space (Rhema) \ndo battle with rockabilly greaser Stray Cats wannabes \n(Jimmy and the Mustangs), all for the love of the awful \nPia Zadora. And Jermaine Jackson shows up wanting to be \nMichael Jackson.\n\nPeter Cullen (Optimus Prime from Transformers) plays a \nrobot who becomes a fire hydrant. Ruth Gordon (Harold and \nMaude) plays the violent, rather insane sheriff.\n\nMichael Berryman (The Hills Have Eyes) plays the chainsaw \nkiller who escapes from an asylum, straight into the heart \nof bobby-socks-wearing mechanic Allison LaPlaca!\n\nAlso there's a sea monster.\n\nWhile Pia falls for a spaceman and generally annoys us \nall, her abusive asshole boyfriend (Craig Sheffer) climbs \naround on rocks, posing and pretending to be a cougar-man. \nPia eventually goes back to him, even though he's an \nasshole, making this the most true-to-life ending of any \nHollywood film ever. Women love attractive jerks. That's\nthe way it is.\n\nDirected by James Fargo (&quot;Any Which Way But Loose&quot;) with \ncinematography by Gil Taylor (&quot;Star Wars,&quot; &quot;Flash Gordon&quot;).\n\nFilmed in November and December 1983, the movie was \nintended for release in 1984, but sadly no one appreciated \nits genius at the time.\n\nGerman DVD from Cinemageddon.\n\nSoundtrack compiled by Vinnie Rattolle.\n\nMore info at Vinnie Rattolle's Blogspot.\n\n\n&quot;James Fargo the Director of Every Which Way But Loose \nbrings you a fun filled spoof of everything from music \nvideos to science fiction of the fifties.\n\nSpectacular special effects combine with great dance music \nand outrageous humour to form a hilarious out of this \nworld science fiction rock and roll adventure. Craif \nSheffer plays Frankie, the leader of Speelburghs local \nHigh School rock and roll band called the Pack and meets \nand falls in love with Dee Dee a young singer. The couple \nare in for an exciting time when a guitar-shaped space \nship streaks through the skies and lands in their town! \nWhat emerges from the weird craft? Rock Aliens of course! \nBut these aliens haven't come to rock and roll. They've \ncome to destroy!\n\nWill Dee Dee and Frankie save the world from death and \ndestruction? Will Frankie have some close encounters? Will \nthe guitar ship leave the world alone? We won't tell you! \nYou'll just have to take our word that this is THE fun \nflick to see!&quot;","torrent":{"xt":"urn:btih:012209e7d6aa1fc767ec7f6ab55a13ca7c82a148","amp;dn":"Voyage+of+the+Rock+Aliens+%281983%2F85%29+DVD5+%26+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"012209e7d6aa1fc767ec7f6ab55a13ca7c82a148","infoHashBuffer":{"type":"Buffer","data":[1,34,9,231,214,170,31,199,103,236,127,106,181,90,19,202,124,130,161,72]},"announce":[],"urlList":[]}}