{"title":"Autosport Magazine UK 07/10/2010","uid":5872706,"size":91067875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01425cfa6c64f130b368fe1a7f9fadee5914eb0c&amp;dn=Autosport+Magazine+UK+07%2F10%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1286513947,"description":"NEWS\n10 Lotus's Red Bull tie-up. Emergent team gets Red Bull gearbox and rear aero\n12 Porsche: own team for F1. Germans could go it alone in F1, for first time since 1962\n14 Pirelli goes conservative. F1's new tyre maker puts reliability above everything\n17 David Coulthard column\n18 Japanese GP preview\n24 DeltaWing lives on. Is there alternative to Indy?\n26 Rahal's Ganassi link. Young American has funding, seeks top 2011 IndyCar ride\n29 Plato's Theory of Form. BTCC points leader gets set for four-way title showdown\n31 Volvo green-lights WTCC. Dahlgren to pilot C30 as make looks to greater things\n32 New World Rally gallery. Ford Fiesta RS and Citroen DS3 to challenge new Mini\n\nREPORTS\n40 Rally France. Loeb claims his seventh world title on the roads he grew up driving around on\n44 IndyCar Homestead. Franchitti does enough for title as Dixon wins race\n46 World of Sport. NASCAR; Auto GP; Swedish Touring Car Championship; Indy Lights\n52 Petit Le Mans. Peugeot wins 1000-mile marathon as bizarre headwear incident strikes\nAudi ace Capello\n56 Superleague Ordos. Bamber's week as an Earl lords it in China\n\nFEATURES\n34 2010: year of errors. How slip-ups have shaped F1 title-fight thriller\n58 Dean Stoneman. Uncomplicated racer becomes F2 poster boy\n60 Formula 2 review. Is the low-cost concept working for new-era F2?\n\nSPORTS EXTRA\n75 Britcar's new identity. Clubbie paradise gets British Endurance Championship status from MSA\n76 Six for scholarship. Porsche Carrera Cup chiefs name their likely lads\n80 Reports. Britcar 24 Hours; Silverstone supports; Snetterton MGCC; Castle Combe Carnival;\nMallory Park BARC; Donington Park VSCC SeeRed; Oulton Park 750MC\n\nREGULARS\n93 Photo finish. Martin Brundle, IROC, Talladega 1990\n94 Race of my life. Damon Hill, 1994 Japanese Grand Prix\n\nOCRd by PDF Converter Professional 7. Cover has links to main stories.","torrent":{"xt":"urn:btih:01425cfa6c64f130b368fe1a7f9fadee5914eb0c","amp;dn":"Autosport+Magazine+UK+07%2F10%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01425cfa6c64f130b368fe1a7f9fadee5914eb0c","infoHashBuffer":{"type":"Buffer","data":[1,66,92,250,108,100,241,48,179,104,254,26,127,159,173,238,89,20,235,12]},"announce":[],"urlList":[]}}