{"title":"Democracy Now - 22 sep 2010","uid":5845848,"size":448087492,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:015398cf87dd016feff048070868b9ad48ee1860&amp;dn=Democracy+Now+-+22+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1285172657,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 22, 2010\n\n- Senate GOP Blocks Vote on Repealing Military Gay Ban\n- Summers to Resign as Top Economic Adviser\n- Book: Top U.S. Officials Doubt Afghan War Strategy\n- NATO Arrests 2 Al Jazeera Journalists in Afghanistan\n- U.S. Drone Strikes Kill 28 in Pakistan\n- 10 Killed in Iran Bombing\n- Palestinian Killed, 5 Wounded in Jerusalem Clashes\n- Toronto G20 Protest Leader Arrested for Panel Appearance\n- ACLU Sues Pittsburgh Police over 2009 G20 Arrests\n- Scientists: Record Heat Endangers World's Coral Reefs\n\n\nSpecial reports\n\n- &quot;A Departure to Be Welcomed&quot;: Robert Scheer on Resignation of White House Economic Advisor and De-Regulation Proponent Lawrence Summers\n\nThe makeup of President Obama's economic team is being shaken up some more as Lawrence Summers has announced he is resigning as director of the National \n\nEconomic Council later this year to return to Harvard University. According to Bloomberg news, the White House is considering naming a &quot;prominent corporate executive&quot; to \n\nreplace Summers in order to counter Wall Street criticism that the administration is &quot;anti-business.&quot; We speak to veteran journalist Robert Scheer, author of &quot;The Great \n\nAmerican Stickup: How Reagan Republicans and Clinton Democrats Enriched Wall Street While Mugging Main Street.&quot;\n\n\n- Chilean Economist Manfred Max-Neef: U.S. is Becoming an &quot;Underdeveloping Nation&quot;\n\nWhile President Obama is reporting looking into tapping a former corporate executive to become his next top economic adviser, many economists question the path the \n\nUnited States is on. We speak to the acclaimed Chilean economist Manfred Max-Neef. He won the Right Livelihood Award in 1983, two years after the publication of his \n\nbook &quot;Outside Looking In: Experiences in Barefoot Economics.&quot;\n\n\n- As Competing Films Offer Differing Views on Faulkner Killing, Mumia Supporters Claim New Evidence Undermines Key Witness Testimony\n\nIn the early morning hours of December 9 1981, Daniel Faulkner, a white police officer, was fatally shot in the streets of Philadelphia. Journalist Mumia Abu Jamal was \n\narrested and charged with his murder. The following summer a predominantly white jury sentenced him to death. Twenty-eight years later, the debate is still raging over \n\nwhether justice was served. The debate spilled onto the silver screen in Philadelphia Tuesday night, with two new films premiering at the same time, each with competing \n\nexplanations of what happened the night Faulkner was killed and during Mumia Abu Jamal's trial for his murder.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:015398cf87dd016feff048070868b9ad48ee1860","amp;dn":"Democracy+Now+-+22+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"015398cf87dd016feff048070868b9ad48ee1860","infoHashBuffer":{"type":"Buffer","data":[1,83,152,207,135,221,1,111,239,240,72,7,8,104,185,173,72,238,24,96]},"announce":[],"urlList":[]}}