{"title":"POtHS 2 - Conspiracy Facts - Part 08 - Secret Societies - Illumi","uid":5866747,"size":1379758675,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01665cc57d523133376c2f869dcea47e35897833&amp;dn=POtHS+2+-+Conspiracy+Facts+-+Part+08+-+Secret+Societies+-+Illumi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"awaken888","files":141,"time":1286235783,"description":"POtHS\nPouring Out the Holy Spirit \n\n\nPOtHS -- Picking Out The Hellish Scumbags -- POtHS -- Pointing Out The Hovering Sausers -- POtHS -- Pouring Out True Helping Scriptures -- POtHS -- Pouring Out The Holy Spirit -- POtHS -- Pointing Out The Hopeless Socialists -- POtHS -- Pour Out The Holy Spirit -- Upload POtHS Everywhere -- POtHS -- Pointing Out The Hellish Scumbags -- POtHS -- Partaking Of The Holy Scriptures -- POtHS -- Prosecute Only The Highest Scoundrels -- POtHS -- Pouring Out The Holy Spirit -- POtHS -- Prosecute Obama The House &amp; Senate -- POtHS -- Plant Only The Heritage Seeds -- POtHS -- Plant Our Treasured Heritage Seeds -- POtHS -- Plant Our Treasured Hemp Seeds -- POtHS -- Passing Over The Harmful Sins -- POtHS -- Prevailing Over The Hypocritical Scoundrels -- POtHS -- Prosecute Our Treasonous Homeland Security -- POtHS -- Prevailing Over The Hypacritical Scoundrels -- POtHS -- Pondering On The Heavenly Skies -- POtHS\n\n\nEphesians 5:11\n\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\nThank you for the POtHS suggestions. Type POtHS in your search window and see what POPS UP.\n\nMore Torrents in this series at\n\nI originally released these files in early 2010. POtHS 2 is the second publishing of Conspiracy Facts\n\nPOtHS 2 - Conspiracy Facts - Part 08 - Secret Societies - Illuminati - 05\n\nThese Elite Ill uminati Bastards are the Most Sinister, Ruthless Scumbags that have walked the Face of The Earth. They serve their god well. They serve Lucifer. Like Christians worship Jesus these Elite scumbags Worship their god LUCIFER.\n\nThis Fact proves they are evil. If the 200 richest families on Earth would donate just 4% of their WEALTH.  Would you give 4% of everything you owned to House, Cloth and Feed the entire population of the World??? Just 4% of their wealth to end suffering and feed the starving children. Of course you would.  They laugh at USa, they call us Cannon Fodder and Cattle, inject us with poison vaccines and put poison in our water and food supplies.\n\nLook around everything is 180 degrees turned around backwards. Obama and the Nobel Peace Prize!!!! He is the biggest war president the World has ever seen.\n\nXXXXXXX  NEWS FLASH  XXXXXXX Petition Filed in Supreme Court claiming Obama is not only not eligible to be president but he is also an Illegal Alien.  See this video http://www.youtube.com/watch?v=Q3djvS0kdZQ&amp;feature=uploademail   NO WONDER HE DOESN'T WANT TO CLOSE OUR BORDERS WITH MEXICO. HE WON'T HAVE A WAY TO GET Back IN THE USA IF HE DOES!!! liar liar liar AN ILL UMINATTI LYING BASTARD SCUMBAG HE IS!!! No man needs MORE PRAYERS THAN obama. \n\nNow some Moron is going to call me racist cause I called a liar a liar, where is the truth? Time is short my friends.\n\nThe days are short my friends. Life as we have been used to is over. This is as good as it is going to get. THE SECRET SOCIETIES CAN NOT STOP THEIR TAKE OVER OF THE PLANET EARTH. They have lied, cheated and stolen everything that the World has worked for. They are in our Government and they Worship Satan more than most Christians Worship Jesus. They are devoted to their God, The Prince of The Air, The Son of Perdition, The God of The earth dwellers, &quot;Ole Scratch,&quot; it is SATAN himself.\n\nAny way these are the gasholes that run America and they want to run the World. Jesus is coming to kick the &quot;MONEY CHANGERS&quot; out of POWER. He will squish the &quot;All Seeing Eye&quot; between his fingers for ALL to see.\n\nThese POTHS - Conspiracy FACTS - Secret Societies Collection has 81 parts to date. There will be more as WE are in the Middle of an INFOWAR. The information we receive on TV are all lies, it is a controlled media source that has nothing GOOD for you in it's programming. We have been scientifically &quot;brain washed&quot;. Every advertising campaign you see is designed to deceive you.\n\nTake this challenge. Turn off your TV for ONE week and watch your MENTAL media programming dissipate. Watch only these downloads in this series. I PROMISE, YOU WILL BE A WHOLE NEW PERSON! THEY TRUTH WILL SET YOU FREE.\n\n&quot;THERE ARE NO SECRET SOCIETIES&quot; HA HA HA.  THEY ARE EVERYWHERE!!! THIS IS A MULTI PART SERIES. PASS THIS AROUND TO EVERYONE. TIME IS SHORT MY FRIENDS. SAVE AS MANY AS YOU CAN. WAKE THEM UP FROM THE NWO BRAINWASHING US AMERICANS AND THE REST OF THE WORLD ARE ENDURING. THROW YOUR PRESCRIPTIONS AWAY AND GET OFF PROZAC. STOP KILLING YOURSELVES AND CHILDREN WITH PROCESSED FAST FOOD. BREAK OUT OF THE SYSTEM THAT IS KILLING US AND AMERICA\n\nThe Truth Will set you free, however It may cause you to get real pissed off and kick the couch or the dog.\n\n\n\n\nRapture\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed..\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,\n\nThen we who are alive and remain will be caught up together with them in the clouds to meet the Lord in the air, and so we shall always be with the Lord.\n\n\nMany thanks to all the Film Makers that brought these facts to life.\n\nThe World Governments that are run by The Banksters, that are empowered by Lucifer, are The True Terrorists, only The Final Showdown between Lucifer and Jesus will save Mankind. We know who wins the Battle, The Creator of The Universe, of course!!!\n\nThe More You share the More shares you will receive, may Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.   \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.    \n\nGet info on the Take Over by The New World Order Below \n &lt;a href=&quot;\nhttp://www.projectcamelot.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.projectcamelot.org&lt;/a&gt; &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt; \nListen to Alex Jones  &lt;a href=&quot;\nhttp://bibledatabase.com/html_bibles.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bibledatabase.com/html_bibles.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://hickoryhammockbaptist.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hickoryhammockbaptist.org&lt;/a&gt;\n \nSeed long and Prosper with Blessings from our Father.  \n\nEphesians 5:11[/size]\n\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n\n\n                                   ","torrent":{"xt":"urn:btih:01665cc57d523133376c2f869dcea47e35897833","amp;dn":"POtHS+2+-+Conspiracy+Facts+-+Part+08+-+Secret+Societies+-+Illumi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01665cc57d523133376c2f869dcea47e35897833","infoHashBuffer":{"type":"Buffer","data":[1,102,92,197,125,82,49,51,55,108,47,134,157,206,164,126,53,137,120,51]},"announce":[],"urlList":[]}}