{"title":"Democracy Now - 17 sep 2010","uid":5836602,"size":453176255,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:020bd4f248d93e8f24ec4fda4abf0714ece5cd2c&amp;dn=Democracy+Now+-+17+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1284740683,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 17, 2010\n\n- Record Number of Americans Below Poverty Line, Uninsured\n- Supporters Launch International Days of Action for Bradley Manning\n- Clinton: Israeli Settlement Freeze &quot;Would Be Helpful&quot;\n- Israel Carries Out Attacks in Occupied Territories\n- Palestinians, Lebanese Mark Anniversary of Sabra and Shatila Massacre\n- Militants Abduct Election Workers Ahead of Afghan Vote\n- Exiled Pakistani Leader Slain in London\n- Senate Foreign Relations Committee Approves START\n- Study: Microbes Consumed Natural Gas, Not Oil, After Spill\n- Group Sues for Gov't Records on Spill Size\n\n\nSpecial reports\n\n- Percy Schmeiser vs Monsanto: The Story of a Canadian Farmer's Fight to Defend the Rights of Farmers and the Future of Seeds\n\nGathered here in Bonn this week are some eighty Right Livelihood Award laureates, including the Canadian farmer Percy Schmeiser, who has battled the biotech giant Monsanto for years. When Monsanto seeds blew into Schmeiser's property, Monsanto accused him of illegally planting their crops and took him to court. Ultimately his case landed in the Canadian Supreme Court. He was awarded the Right Livelihood Award in 1997 for fighting to defend the rights of farmers and the future of seeds.\n\n\n- Solar Power in Bangladesh Used to Empower People in Poor, Rural Areas\n\nIn Bonn, Germany this week are representatives of the Bangladeshi organization Grameen Shakti, which makes loans and offers technical assistance to allow poor, rural people to install solar power in their homes, often granting access to electricity for the first time in their family's history. They have helped install more than 110,000 systems, often with a woman hired to maintain the system, creating jobs, empowering women, and raising the standard of living.\n\n\n- Large anti-Government Protests in Thailand Scheduled on Fourth Anniversary of Coup\n\nLarge anti-government protests are scheduled to take place across Thailand Sunday on the fourth anniversary of a military coup that ousted Prime Minister Thaksin Shinawatra. The protests are being organized by the so-called Red Shirts, who have called for new elections and for the Thai parliament to be dissolved. We speak with a prominent dissident from Bangkok named Sulak Sivaraksa. He won the Right Livelihood Award in 1995 for his vision, activism and spiritual commitment in the quest for a development process that is rooted in democracy, justice and cultural integrity.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:020bd4f248d93e8f24ec4fda4abf0714ece5cd2c","amp;dn":"Democracy+Now+-+17+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"020bd4f248d93e8f24ec4fda4abf0714ece5cd2c","infoHashBuffer":{"type":"Buffer","data":[2,11,212,242,72,217,62,143,36,236,79,218,74,191,7,20,236,229,205,44]},"announce":[],"urlList":[]}}