{"title":"Skid Row - Wasted Time (2nafish)","uid":5914788,"size":215373828,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0316725402f2bd3591076624a777747d9370b712&amp;dn=Skid+Row+-+Wasted+Time+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1288174243,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Wasted Time&quot; is a song by Skid Row. It was a single from their second album, Slave to the Grind. The song was released in 1991 and written by bandmates Sebastian Bach, Rachel Bolan and Dave &quot;the Snake&quot; Sabo. It was also the band's last real hit on the U.S. charts. Lead singer Sebastian Bach said the song was written about Steven Adler, the original drummer of hard rock band Guns N' Roses.\n\nThe song reached #88 on the Billboard Hot 100, #30 on the Mainstream Rock Tracks and #20 on the UK Singles chart.\n\nSlave to the Grind is Skid Row's second album, released on June 11, 1991. Slave to the Grind is notable for being the first heavy metal album to debut at #1 on the Billboard 200 during the SoundScan era, and many other metal albums followed, such as The Black Album by Metallica, Use Your Illusion II by Guns N' Roses and Far Beyond Driven by Pantera. Although it hit first in the SoundScan era, it only sold just over 4 million albums worldwide as of the end of 1996.\n\nTwo different versions were released: the original version, and the &quot;clean&quot; (censored) version. The clean version replaced the song &quot;Get the Fuck Out&quot; with the less-offensive &quot;Beggar's Day&quot;.\n\nSlave to the Grind marked the band's shift towards a heavier sound. The lyrics were more complex, criticizing modern ways of life, authority, politics, drugs, and organized religion, among other topics.\n\nSebastian Bach's father painted the cover art, which is actually a long mural, continued inside the album's booklet. It is set in the medieval era, yet features people using technological gadgets of the present day.\n\nSkid Row is an American heavy metal band, formed in 1986 in Toms River, New Jersey. They are named after Phil Lynott and Brush Shiels' first band. They were most successful in the late 1980s and early 1990s when their first three albums with lead singer Sebastian Bach and drummer Rob Affuso were multi-platinum successes. As of 2010 their current line-up consists of Johnny Solinger (vocals), Dave &quot;The Snake&quot; Sabo (guitar), Scotti Hill (guitar), Rachel Bolan (bass) and Rob Hammersmith (drums). As of the end of 1996 the band has sold 20 million albums worldwide.\n\nTo date, Skid Row has released five full-length albums, an EP, a compilation album, and a live album. For album and single sales information, see the Skid Row discography page. They became popular with their first two albums, Skid Row and Slave to the Grind, which are often considered their best-known works to date. Their 1995 follow-up, Subhuman Race was also critically-acclaimed but not as successful as the first two albums. Skid Row's latest albums, Thickskin and Revolutions per Minute, came out in 2003 and 2006.\n\nThey are often associated with glam metal, partly due to their image on their debut album, Skid Row, which spawned the hits &quot;18 and Life&quot;, &quot;Youth Gone Wild&quot;, and &quot;I Remember You&quot; for the band. They would eventually go on to foster an image base geared toward more traditional heavy metal and hard rock audiences.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:0316725402f2bd3591076624a777747d9370b712","amp;dn":"Skid+Row+-+Wasted+Time+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0316725402f2bd3591076624a777747d9370b712","infoHashBuffer":{"type":"Buffer","data":[3,22,114,84,2,242,189,53,145,7,102,36,167,119,116,125,147,112,183,18]},"announce":[],"urlList":[]}}