{"title":"Worms 3 3-D (Pc-Eng) Working","uid":5846424,"size":66318785,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0337f5a53bf4c5bf82e0a872e0e301cec1a1c6cb&amp;dn=Worms+3+3-D+%28Pc-Eng%29+Working&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"npto","files":-1,"time":1285201642,"description":"Worms 3D \nGenre: Action Tactical Strategy Game \nSize: 180mb\nPlatform: PC \n\nThe highly addictive strategy game Worms returns again with Worms 3. Worms 3 continues with another wacky adventure through it's turn-based combat system. Featuring a wide variety of bizarre and crazy weapons to destroy your enemy in hundreds of different ways. Fully destructable environments adds to the already endless exciting gameplay. \n\n \n* Worms 3D continues the history of turn based strategy featuring a bizarre and outlandish array of deliciously explosive weaponry, mad animals, crazy speech and laugh-out-loud instances in a full 3-dimensional, fully destructible environment. \n* In conjunction with a revolutionary, fully deformable 3D landscape technology, it expands the strategic options offered in the previous games into fascinating new directions. \n* That means caves, cliffs, holes, multiple levels, buildings, ropes, tunnels - all in gorgeous 3D! \n* Worms 3D also features stunning 3D animation of the Worms themselves, which surpasses anything seen in Worms titles to date, including the FMV sequences seen in previous games! \n* Worms 3D uses a proprietary, all-new deformable polygon/voxel landscape engine that allows the player to destroy any part or ALL of the landscape, from any direction. \n* Shoot through the floor, make a hole and shoot at the player below you on a plateau! \n* Tunnel your way through the hillside! Blast your way through! Watch as the landscape crumbles, sinks and deforms as you use progressively more powerful weapons! \n* Unlike other engines, the technology allows you to explode any part of the land, create holes, tunnels, cliffs, caves and emulates the way the game played in 2D. We're pretty pleased with it. \n\nGame Features: \n* Turn-based action like you've never seen. \n* All new missions, play modes, 'Wormpot' modes, training, and challenge modes. All new challenges and all new game structure. \n* A more immersive single player experience based on unlocking challenges, secret missions, sound sets and landscapes. \n* A choice of camera modes :: 1st person to look around, and blimp view for a strategic overview of the situation. \n* Environmental conditions such as rain, snow, night and day add to the strategic decisions facing the players. \n* Randomly-generated, and fully deformable landscape, all in true 3D. \n* The inclusion of the 'Wormopedia' and the gallery allow the player to peruse their achievements and view the story behind some of the 'Worms' legends. \n* All new artificial intelligence, sound effects, music, interface, and much, much more. \n\nMin System Requirements: \nMicrosoft Windows 98, Me, 2000 or XP (95 / NT are unsupported) \n800 MHz Intel Pentium III or AMD Athlon processor \n256 MB System RAM \n8 x CD-ROM / DVD-ROM drive \n32 MB hardware accelerated video card with 100% OpenGL 1.4 compatibility \nSound card \n\n","torrent":{"xt":"urn:btih:0337f5a53bf4c5bf82e0a872e0e301cec1a1c6cb","amp;dn":"Worms+3+3-D+%28Pc-Eng%29+Working","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0337f5a53bf4c5bf82e0a872e0e301cec1a1c6cb","infoHashBuffer":{"type":"Buffer","data":[3,55,245,165,59,244,197,191,130,224,168,114,224,227,1,206,193,161,198,203]},"announce":[],"urlList":[]}}