{"title":"American.Streetballers[DVDRip][Sub.]","uid":5898630,"size":1468673786,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:035ba35857c32b142f104df5d77fc65b88cd426a&amp;dn=American.Streetballers%5BDVDRip%5D%5BSub.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sonyds","files":1,"time":1287597030,"description":"TÃƒÂ­tulo original: American Streetballers \nAÃƒÂ±o: 2010\nGÃƒÂ©nero: Drama\nDuraciÃƒÂ³n: 119 minutos\nCalidad de video:  DVD RIP\nPeso: 1370 mb\nIdioma del audio: InglÃƒÂ©s SubtÃƒÂ­tulada EspaÃƒÂ±ol \n\nStreetballers es para el baloncesto, lo Campo de SueÃƒÂ±os fue para el bÃƒÂ©isbol. DefiniciÃƒÂ³n de baloncesto callejero como pasatiempo favorito de AmÃƒÂ©rica nueva, es una historia impulsada por la pasiÃƒÂ³n, la fe, y la consecuciÃƒÂ³n de metas. Una historia de capturar la naturaleza poÃƒÂ©tica debaloncesto de la calle, poniendo de relieve las luchas sufrido dentro y fuera de la corte por el mÃƒÂ¡s puro de los atletas. Constantemente en busca de la cordura en medio del alcoholismo, el racismo y las drogas, John Hogan y Jacob Whitmore, dos jugadores de baloncesto Junior College, encontrar la liberaciÃƒÂ³n y la terapia mientras competÃƒÂ­a en uno de los tribunales de la calle mÃƒÂ¡s competitiva y poÃƒÂ©tica en los EE.UU. Los dos hombres deben pasar todo el verano ayudando a otros a superar sus adversidades. Su dedicaciÃƒÂ³n y amor por el juego debaloncesto mÃƒÂ¡s allÃƒÂ¡ de los tribunales de campo en cada uno de sus hogares disfuncionales donde los dos niÃƒÂ±os juegan el papel constante de la figura paterna. Golpeando a travÃƒÂ©s de la vida un dÃƒÂ­a a la vez, Jacob no tiene otra opciÃƒÂ³n que jugar en una liga de metro, en constante lucha para mantener su primo Damon de la deuda, y posible muerte. Abrumador sentimiento de culpa de Juan y trauma familiar estallan en un estado de confusiÃƒÂ³n y de la belleza espiritual de cada intervenciÃƒÂ³n de Terry Gibson, un niÃƒÂ±o de barrio asesinado por el hermano mayor de Juan Miguel en un accidente por conducir ebrio. Juntos, los dos muchachos pintan un retrato triste y encantador con su inocencia, preocupaciones, y la fe en lo desconocido.\n\nNos vemos por TorrentSpain\n\n","torrent":{"xt":"urn:btih:035ba35857c32b142f104df5d77fc65b88cd426a","amp;dn":"American.Streetballers%5BDVDRip%5D%5BSub.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"035ba35857c32b142f104df5d77fc65b88cd426a","infoHashBuffer":{"type":"Buffer","data":[3,91,163,88,87,195,43,20,47,16,77,245,215,127,198,91,136,205,66,106]},"announce":[],"urlList":[]}}