{"title":"Small Faces - Itchycoo Park (Beat Club) (2nafish)","uid":5856766,"size":93542404,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:03c5be26596c9302dda36381d1c5623eef4b48b1&amp;dn=Small+Faces+-+Itchycoo+Park+%28Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1285650879,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Itchycoo Park&quot; is a psychedelic pop song written by Steve Marriott and Ronnie Lane of the group Small Faces. The song reached number three in the UK Singles Chart, 1967.\n\n&quot;Itchycoo Park&quot; was released by mod band The Small Faces in August, 1967. Together with &quot;Lazy Sunday&quot;, &quot;Tin Soldier&quot; and &quot;All or Nothing&quot;, the song is one of the band's biggest hits and has become a classic of its time.\n\nThe song reached number 16 in the American Billboard Hot 100 chart in 1968.\n\nLong running British music magazine NME cites readers poll voting &quot;Itchycoo Park&quot; number 62 out of the top 100 singles of all time.\n\n&quot;Itchycoo Park&quot; climbed to the top of the charts again when it was re-released on 13 December 1975.\n\nIt is one of a number of songs from the late sixties to feature flanging (the audio effect).\n\nThe song was first thought of by Ronnie Lane, who had been reading a leaflet on the virtues of Oxford which mentioned its dreaming spires.\n\nA number of sources claim the song's name is derived from the nickname of Little Ilford Park, on Church Road in the London suburb of Manor Park, where Small Faces' singer and song-writer Steve Marriott grew up. The &quot;itchycoo&quot; nickname is, in turn, attributed to the stinging nettles which grew there. Other sources cite nearby Wanstead Flats (Manor Park end) as the inspiration for the song.\n\nMarriott and Small Faces manager Tony Calder came up with the well-known story when Marriott was told the BBC had banned the song for its overt drug references, Calder confirms:\n\n    &quot;We scammed the story together, we told the BBC that Itchycoo Park was a piece of waste ground in the East End that the band had played on as kids - we put the story out at ten and by lunchtime we were told the ban was off.&quot; - Tony Calder (Manager)\n\nRonnie Lane on the true location of Itchycoo Park:\n\n    &quot;It's a place we used to go to in Ilford years ago. Some bloke we know suggested it to us because it's full of nettles and you keep scratching&quot;. - Ronnie Lane\n\nThe Small Faces were an English rock and roll band from east London, heavily influenced by American rhythm and blues. The group was founded in 1965 by members Steve Marriott, Ronnie Lane, Kenney Jones, and Jimmy Winston, although by 1966 Winston was replaced by Ian McLagan as the band's keyboardist.\n\nThe band is remembered as one of the most acclaimed and influential mod groups of the 1960s, With memorable hit songs such as &quot;Itchycoo Park&quot;, &quot;Lazy Sunday&quot;, &quot;All or Nothing&quot;, &quot;Tin Soldier&quot;, and their concept album Ogdens' Nut Gone Flake, they later evolved into one of the UK's most successful psychedelic acts before disbanding in 1969. After the Small Faces disbanded, three of the members were joined by Ronnie Wood as guitarist, and Rod Stewart as their lead vocalist, both from The Jeff Beck Group, and the new line-up was renamed the Faces.\n\nThey are also acknowledged as being one of the biggest original influences on the Britpop movement of the 1990s.\n\nDespite the fact they were together just four years in their original incarnation, the Small Faces' music output from the mid to late sixties remains among the most acclaimed British mod and psychedelic music of that era. (A revived version of the band also existed from 1975 to 1978.)\n\nIn 1996, the Small Faces were belatedly awarded the Ivor Novello Outstanding Contribution to British Music &quot;Lifetime Achievement&quot; award.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:03c5be26596c9302dda36381d1c5623eef4b48b1","amp;dn":"Small+Faces+-+Itchycoo+Park+%28Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03c5be26596c9302dda36381d1c5623eef4b48b1","infoHashBuffer":{"type":"Buffer","data":[3,197,190,38,89,108,147,2,221,163,99,129,209,197,98,62,239,75,72,177]},"announce":[],"urlList":[]}}