{"title":"Afghan War Diary, 2004-2010","uid":5720536,"size":1,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0455f35d10e2302e4855697a60e82023a859d804&amp;dn=Afghan+War+Diary%2C+2004-2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mainers","files":1,"time":1280275136,"description":"Complete dump of the website, HTML format\n\n25th July 2010 5:00 PM EST WikiLeaks has released a document set called the Afghan War Diary, an extraordinary compendium of over 91,000 reports covering the war in Afghanistan from 2004 to 2010.\n\nThe reports, while written by soldiers and intelligence officers, and mainly describing lethal military actions involving the United States military, also include intelligence information, reports of meetings with political figures, and related details.\n\nThe document collection is available on a dedicated webpage.\n\nThe reports cover most units from the US Army with the exception of most US Special Forces' activities. The reports do not generally cover top secret operations or European and other ISAF Forces operations.\n\nWe have delayed the release of some 15,000 reports from the total archive as part of a harm minimization process demanded by our source. After further review, these reports will be released, with occasional redactions, and eventually in full, as the security situation in Afghanistan permits.","torrent":{"xt":"urn:btih:0455f35d10e2302e4855697a60e82023a859d804","amp;dn":"Afghan+War+Diary%2C+2004-2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0455f35d10e2302e4855697a60e82023a859d804","infoHashBuffer":{"type":"Buffer","data":[4,85,243,93,16,226,48,46,72,85,105,122,96,232,32,35,168,89,216,4]},"announce":[],"urlList":[]}}