{"title":"The Training of O--------10857 AdriannaNicole","uid":5922963,"size":888555306,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:04de36444620f1ede31f99a8588df4e9a82e4506&amp;dn=The+Training+of+O--------10857+AdriannaNicole&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":282,"time":1288491509,"description":"From Kink.com     (The Training of O) + Pics\n\n\n\nThe training of beautiful submissive sluts benefits from variety. As you are aware from watching these movies, kinky mindfucks and psychological domination need experimentation and fresh insights to stay hot and interesting. To these ends TTOO is experimenting with expanding its format to get more hot bitches in here to fuck with (and to fuck). Case in point: Testing Chloe. \n\nThe little slut is getting lots of attention lately and we thought it was time to see what is under the hood. Chloe is interviewed and handed the Bucket of Pain, an innocuous tin pail. Harmless, really. But intent counts for so much, and this little tramp is soon reduced to tears without our hardly lifting a finger. \n\nAny doubts about our commitment to the cause still lingering in Chloe's pretty head vanish when she is mounted on a post with her cunt peeled open and her creamy white thighs made available to our talents. She is terrorized with the cattle prod, and eventually gets her slutty pussy stuffed, slapped and reamed, reducing her faculties to uncontrollable repeated orgasmic spasms. \n\nSeven takes her pleasure smothering the would-be slave girl's face with her fine round ass. The more voltage we send to Chloe's twitching wet cunt, the further she shoves her slutty tongue up Seven's asshole. Chloe is completely trashed by the end of her trials. We thought orgasms would be a good reward for the little slut, but I guess it is possible to have too much of a good thing. \n\n\n\nScreens  &lt;a href=&quot; http://www.thetrainingofo.com/site/shoot.jsp?shootId=10857&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.thetrainingofo.com/site/shoot.jsp?shootId=10857&lt;/a&gt;\n\n\nCheers  :-)  ","torrent":{"xt":"urn:btih:04de36444620f1ede31f99a8588df4e9a82e4506","amp;dn":"The+Training+of+O--------10857+AdriannaNicole","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04de36444620f1ede31f99a8588df4e9a82e4506","infoHashBuffer":{"type":"Buffer","data":[4,222,54,68,70,32,241,237,227,31,153,168,88,141,244,233,168,46,69,6]},"announce":[],"urlList":[]}}