{"title":"Coast to Coast AM - 07-23-10 - Gulf Oil Spill &amp; Climate Change","uid":5715486,"size":56909134,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0825fe62b012f691dd262b18b624c2d73722b131&amp;dn=Coast+to+Coast+AM+-+07-23-10+-+Gulf+Oil+Spill+%26+Climate+Change&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KungFuKane","files":5,"time":1280075964,"description":"Date:\n 07-23-10\n \nHost:\n Art Bell\n \nGuests:\n Peter Ward \n \n\n\nFilling in for George, Art Bell was joined by Professor Peter Ward for a 4-hour discussion on how the Gulf oil catastrophe ties in with climate change. Ward believes BP significantly underestimated the amount of oil that was released from their deep sea well, and worries about the environmental impact of not only the spill but the cleanup efforts also. Chemical dispersants, which have helped break apart the surface oil, are potentially destructive to the cell walls of microorganisms at the base of the marine food chain, he explained. The heavier part of the oil spreading across the sea floor will eventually break down into poisonous hydrogen sulfide gas, Ward continued. Massive quantities of methane, also a byproduct of the leaked oil, will ultimately end up in the atmosphere where it will contribute to increased temperatures across the planet, he added. \n\nWard said he considers the global warming debate settled -- greenhouse gases are making Earth hotter. Evidence in the geological record indicates that during epochs of high carbon dioxide levels (1000 ppm), temperatures were high enough to completely melt the continental ice sheets. As the planet's current average CO2 level approaches 400ppm, Ward theorized what would happen if all of the ice on Greenland melted. According to this disaster scenario, the sea levels would rise 24 feet and cause an unimaginable worldwide calamity. A sea level increase of only 3 feet, which Ward thinks could happen within 40 years, would be enough to destroy considerable portions of the planet's agricultural land, cause nations to seek arable land in other countries, and lead to wars and potentially nuclear exchanges, he noted. \n\nWard spent several weeks in Antarctica, where he discovered that, despite its name, the permafrost is melting. He described another, perhaps more frightening, climate disaster scenario involving the collapse of the West Antarctic Ice Sheet. According to Ward, this ice sheet could break off within a decade and cause 20 feet of sea level rise -- enough to kill a billion people. Should some of his worst fears come to fruition, Ward expects Russia and Canada to emerge as the flooded world's new Wheat Belt. Ward also spoke about the Sun's inconsequential contribution to global warming, as well as possible solutions to the problem, including painting rooftops white, burying charcoal in the soil, putting iron in the Pacific to cause phytoplankton to bloom, and most importantly, reducing the population of the planet. \n\n\nBook(s):\n-The Flooded Earth\n-The Medea Hypothesis\n-Under a Green Sky: Global Warming, the Mass Extinctions of the Past, and What They Can Tell Us About Our Future","torrent":{"xt":"urn:btih:0825fe62b012f691dd262b18b624c2d73722b131","amp;dn":"Coast+to+Coast+AM+-+07-23-10+-+Gulf+Oil+Spill+%26+Climate+Change","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0825fe62b012f691dd262b18b624c2d73722b131","infoHashBuffer":{"type":"Buffer","data":[8,37,254,98,176,18,246,145,221,38,43,24,182,36,194,215,55,34,177,49]},"announce":[],"urlList":[]}}