{"title":"Democracy Now - 29 oct 2010","uid":5922456,"size":456867177,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:08578666428b86298b136772530a7cae947d4b8f&amp;dn=Democracy+Now+-+29+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1288476202,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 29, 2010\n\n- Panel: BP, Halliburton Ignored Cement Flaws\n- US Intelligence Spending Tops $80.1B\n- Audit: US Can't Account for $17.7B in Afghan Spending\n- Inquiry: Pentagon Official Misled on Spy Program\n- Tsunami Death Toll Tops 400 in Indonesia\n- Argentines, Foreign Leaders Mourn Kirchner at Wake\n- Mexican Youths Protest Drug Killings\n- North Korea, South Korea Exchange Fire on Border\n- Report: Prison Industry Helped Draft Arizona Anti-Immigrant Law\n- Poll: Latinos See Widespread Discrimination\n- US Life Expectancy Falls to 49th\n- Clinton Pressures Meek to Drop Senate Bid\n\n\nSpecial reports\n\n- Killing Reconciliation: Military Raids, Backing of Corrupt Government Undermining Stated US Goals in Afghanistan\n\nThe Obama administration says it is backing a strategy of reconciliation with the Taliban. But just back from Afghanistan, unembedded investigative journalists Jeremy Scahill and Rick Rowley say night raids by US Special Operations are killing the reconciliation the administration claims to support.\n\n\n- From Murder to Congress? Unrepentant Tea Party-Backed GOP Candidate Ilario Pantano Killed 2 Unarmed Iraqis\n\nA former US Marine who killed two unarmed Iraqis is running for a congressional seat in North Carolina and has received backing from the Tea Party. Ilario Pantano has said he has no regrets about fatally shooting the two at point-blank range after detaining them near Fallujah in April 2004. Despite his admission, the military cleared Pantano of wrongdoing in 2005. He is now in a tight race with incumbent Democrat Rep. Mike McIntyre in North Carolina's 7th Congressional District. For more on this story, we talk to Salon.com reporter Justin Elliott, who has been following this race closely.\n\n\n- Puerto Rico Marks 60th Anniversary of Jayuya Uprising\n\nOctober 30 is the sixtieth anniversary of the 1950 Independence Revolt in Puerto Rico by the island's Nationalist Party. It marked the most significant attempt at armed revolution in Puerto Rico since the late nineteenth century. Democracy Now! co-host Juan Gonzalez, who's written extensively on the uprising, discusses its significance.\n\n\n- FBI Documents on Senator Paul Wellstone Raise Questions about His Death 8 Years Ago\n\nMinnesota Public Radio has obtained the FBI record of the late Senator Paul Wellstone of Minnesota, who died in a plane crash eight years ago this week. The records show the FBI first tracked Wellstone in 1970 after he was arrested at an anti-Vietnam War protest. The records might also raise new questions about the plane crash that killed Wellstone, his wife, his daughter and three staffers. The National Transportation Safety Board determined the crash was caused by pilot error, but the FBI documents reveal for the first time that specific criminal leads were pursued by investigators.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:08578666428b86298b136772530a7cae947d4b8f","amp;dn":"Democracy+Now+-+29+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08578666428b86298b136772530a7cae947d4b8f","infoHashBuffer":{"type":"Buffer","data":[8,87,134,102,66,139,134,41,139,19,103,114,83,10,124,174,148,125,75,143]},"announce":[],"urlList":[]}}