{"title":"The Ghost Writer (2010) [DVDr5][PAL][DUAL][","uid":5888183,"size":4680828928,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:087f2e54c817f1bb5c884277d67aab7815ad8598&amp;dn=The+Ghost+Writer+%282010%29+%5BDVDr5%5D%5BPAL%5D%5BDUAL%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":-1,"time":1287135995,"description":"The Ghost Writer (2010) [DVDr5][PAL][DUAL][Eng-Spa][Subt.Eng-Spa]\n &lt;a href=&quot;\nhttp://www.elescritorlapelicula.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elescritorlapelicula.es/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1139328/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1139328/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.elseptimoarte.net/peliculas/the-ghost-1104.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elseptimoarte.net/peliculas/the-ghost-1104.html&lt;/a&gt;\n\nTitle: Writer\nOriginal title: The Ghost Writer\nCountry: USA / Germany / France / UK\nUSA release: 19/02/2010\nReleased in Spain: 26/03/2010\nBlu-ray release: 06/10/2010\nCompany: RP Films / Summit International\nDirector: Roman Polanski\nScreenplay: Robert Harris (on his own novel)\nStarring: Ewan McGregor, Pierce Brosnan, Kim Cattrall, Olivia Williams, Timothy Hutton, James Belushi, Tom Wilkinson, Eli Wallach, Robert Pugh\nRating: Not recommended for children under 12 years\n\n\nSynopsis:\nWhen a writer agrees to finish the memoirs of former Prime Minister Adam Lang, his agent assures him that this is the opportunity of a lifetime. But the project seems doomed from the outset, starting with the fact that his predecessor in the same, who had many years as Lang's assistant, died in an unfortunate accident.\n\nThe writer takes a flight to work on the project, in winter, in a house by the sea on an island off the east coast of the United States. However, the day after arriving, a former British cabinet minister accuses Lang to authorize the illegal capture of suspected terrorists and handed over to the CIA for torture, acts which are considered war crimes. The controversy brings journalists and protesters swarming the island mansion where Lang is staying with his wife, Ruth, and his personal assistant (and lover), AMELIA. To get the writer to work on the book, begins to uncover clues that suggest that his predecessor may have stumbled upon a dark secret linking Lang with the CIA, and such information is somehow hidden in the manuscript he left behind his death . Was Lang in the service of American intelligence agency while he was prime minister? What's predecessor was murdered by the writer who discovered the terrible truth?\n\nThis evocative political thriller full of suspense and filled with topical features a story of deceit and betrayal at all levels, sexual, political and literary. In a world in which nothing and nobody, is what it seems, the writer quickly discovers that the past can be fatal and that history is decided by whoever survives to write.\n\nProduction notes:\nBased on the novel by Robert Harris.\n\n((((((((((((((((((((((((&lt;&lt;&gt;&gt;)))))))))))))))))))))))))\n\n\nTÃƒÂ­tulo: El escritor\nTÃƒÂ­tulo original: The Ghost Writer\nPaÃƒÂ­s: USA / Alemania / Francia / UK \nEstreno en USA: 19/02/2010 \nEstreno en EspaÃƒÂ±a: 26/03/2010 \nEstreno en Blu-ray: 06/10/2010 \nProductora: RP Films / Summit International \nDirector: Roman Polanski \nGuiÃƒÂ³n: Robert Harris (sobre su propia novela) \nReparto: Ewan McGregor, Pierce Brosnan, Kim Cattrall, Olivia Williams, Timothy Hutton, James Belushi, Tom Wilkinson, Eli Wallach, Robert Pugh\nCalificaciÃƒÂ³n: No recomendada para menores de 12 aÃƒÂ±os\n\n\nSinopsis:\nCuando un escritor acepta terminar las memorias del antiguo primer ministro ADAM LANG, su agente le asegura que se trata de la oportunidad de su vida. Pero el proyecto parece condenado desde un primer momento, empezando por el hecho de que su predecesor en el mismo, que llevaba muchos aÃƒÂ±os como ayudante de Lang, muriera en un desgraciado accidente. \n\nEl Escritor toma un vuelo para trabajar en el proyecto, en pleno invierno, en una casa junto al mar de una isla en la costa este de Estados Unidos. Sin embargo, al dÃƒÂ­a siguiente de llegar, un antiguo ministro britÃƒÂ¡nico del gabinete de Lang acusa a ÃƒÂ©ste de autorizar la captura ilegal de sospechosos de terrorismo y su posterior entrega a la CIA para que los torture, hechos que estÃƒÂ¡n considerados como crÃƒÂ­menes de guerra. La controversia atrae a periodistas y manifestantes en masa a la mansiÃƒÂ³n de la isla donde se aloja Lang con su mujer, RUTH, y su ayudante personal (y amante), AMELIA. Al ponerse El Escritor a trabajar en el libro, empieza a descubrir pistas que sugieren que su predecesor podrÃƒÂ­a haber tropezado con un oscuro secreto que vincula a Lang con la CIA, y dicha informaciÃƒÂ³n estÃƒÂ¡ oculta de algÃƒÂºn modo en el manuscrito que dejÃƒÂ³ tras su muerte. Ã‚Â¿Estaba Lang al servicio de la agencia americana de inteligencia mientras fue primer ministro? Ã‚Â¿Y fue asesinado el predecesor de El Escritor por la terrible verdad que descubriÃƒÂ³? \n\nEste evocador thriller polÃƒÂ­tico rebosante de suspense y cargado de temas de actualidad ofrece una historia de engaÃƒÂ±o y traiciÃƒÂ³n a todos los niveles, sexual, polÃƒÂ­tico y literario. En un mundo en el que nada, ni nadie, es lo que parece, El Escritor descubre rÃƒÂ¡pidamente que el pasado puede resultar mortal y que la historia la decide quienquiera que sobreviva para escribirla.\n\nNotas de producciÃƒÂ³n:\nBasada en la novela de Robert Harris. \n","torrent":{"xt":"urn:btih:087f2e54c817f1bb5c884277d67aab7815ad8598","amp;dn":"The+Ghost+Writer+%282010%29+%5BDVDr5%5D%5BPAL%5D%5BDUAL%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087f2e54c817f1bb5c884277d67aab7815ad8598","infoHashBuffer":{"type":"Buffer","data":[8,127,46,84,200,23,241,187,92,136,66,119,214,122,171,120,21,173,133,152]},"announce":[],"urlList":[]}}