{"title":"STARGATE.SG-1.S10E16-18.SWESUB. -Lindoff.ISO","uid":5913035,"size":4448159744,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0924eb59a01dfa307ffe41fcebc84b6ed4594e88&amp;dn=STARGATE.SG-1.S10E16-18.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1288120978,"description":"Season 10, Episode 16: Bad Guys\n\nWhen SG-1, minus Carter, investigates a previously unexplored planet expecting to find themselves in a pyramid, they are astounded to find themselves in a museum. Finding a party occurring in the lobby, they decide to leave and make first contact later, but they find that the DHD is a replica and thus incapable of getting them home. They are discovered and believed to be rebels and are forced to take hostages to buy time for their escape. \n\n\n--------------------------------------------------------------------------------\n Season 10, Episode 17: Talion\n\nTeal'c and Bra'tac are among the numerous victims -though only wounded- of several bomb attacks killing 32 men at a summit in the Jaffa settlement Dar Eshkalon. As soon as physically able, he swears to avenge them personally, suspecting the honor-less, ambitious warrior Arkad; General Landry refuses to sanction a killing mission without solid proof, but cannot stop Teal'c going it alone. Bra'tac explains to Daniel Arkad's sinister past, probably even murdering Teal'c mother. Information from resistance on another planet indicates Arkad is in league with the Ori and a plan to attack Earth. Arkad comes meet General Landry, offering to help defend Earth against the Ori, denying any part in the bombings, while defending Origin, incriminating a Jaffa sect. SG-1 is now ordered to find and stop at all cost Teal'c, who is using torture. But Teal'c, committed to killing Arkad, reaches his place, but is wounded, captured, and made to duel Arkad after it is confirmed he had killed Teal'c's parents. \n\n\n--------------------------------------------------------------------------------\n Season 10, Episode 18: Family Ties\n\nStargate's HQ gets a video message from Vala's most unreliable father Jacek on the planet Robak- he claims to know about the late Arkad's plans to attack and blow up Earth, even about the several cloaked, naquadah-laden cargo ships in orbit, and offers details in exchange for sanctuary. General Landry asks Dr. Lam to help him resume contact with her mother Kim, his ex. Even after the cargoes are found and blown up, Vala abhors her dad's entry. The general asks her to go easy on him, realizing that he, too, neglected his daughter because of his career, even if Jacek's neglect was just criminal. When Cam and Daniel go tell Jacek he shouldn't scam people, he tricks them into talking to Vala for him. Vala goes over just for catharsis, telling him she's through picking up the pieces of his tricks, and he certainly keeps scamming- as Daniel also finds even with Terak, a Jaffa from an escaped cargo ship, who hopes to sell the naquadah. When they are apprehended, Jacek promises to help track it and override the rigging of the cargo ship. The Jaffa wait for Jacek and Vala, intending to eliminate them now that Terak is gone, but SG-1 saves them. Since there never was an override, he cheerfully flies away alone in the cargo ship, ignoring that his treachery was anticipated, it's a decoy... \n\n\n--------------------------------------------------------------------------------\n ","torrent":{"xt":"urn:btih:0924eb59a01dfa307ffe41fcebc84b6ed4594e88","amp;dn":"STARGATE.SG-1.S10E16-18.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0924eb59a01dfa307ffe41fcebc84b6ed4594e88","infoHashBuffer":{"type":"Buffer","data":[9,36,235,89,160,29,250,48,127,254,65,252,235,200,75,110,212,89,78,136]},"announce":[],"urlList":[]}}