{"title":"Everclear - Rock Star (2nafish)","uid":5923383,"size":137752580,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:09b8b8331de5f4aa482632ad2a8f2ea003cdbb9e&amp;dn=Everclear+-+Rock+Star+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1288510948,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nSongs from an American Movie, Vol. 2: Good Time for a Bad Attitude is an album by Everclear, released on November 21, 2000. They recorded Vol. 1 and Vol. 2 in the same year and released them only a few months apart. Both albums are loose concept albums based around Art Alexakis' second divorce. The first one is more pop-based and melodic, the second angrier with a more punk/hard rock sound. It also focuses more on the destruction of relationships in its lyrical content. The album comes with a parental advisory sticker, the only other album by the band to feature one is 2006's &quot;Welcome To The Drama Club&quot;.\n\n&quot;Good Time For a Bad Attitude&quot; was seen as a disappointment compared to predecessor. The album debuted at a disappointing 66 on the Billboard charts. No singles received any significant air play on radio or MTV and the album quickly fell out of memory. To date the album has only sold about 100,000 copies in the U.S. The album was certified Gold in Canada in February 2001.\n\n&quot;When It All Goes Wrong Again&quot;, &quot;Out of My Depth&quot; and &quot;Rock Star&quot; were the three songs released as singles from this album.\n\n&quot;When It All Goes Wrong Again&quot; was also featured on the soundtrack for the 2001 film Antitrust starring Ryan Phillipe while &quot;Rock Star&quot; was featured for the film of the same name starring Mark Wahlberg and Jennifer Aniston.\n\nEverclear is a rock band formed in Portland, Oregon in 1992 most well known for their radio hits spanning more than a decade. For most of its existence, Everclear has consisted of Art Alexakis (vocals &amp; guitar), Craig Montoya (bass guitar &amp; vocals), and Greg Eklund (drums, percussion &amp; vocals). Eklund replaced original drummer Scott Cuthbert in 1994. Montoya and Eklund departed the band in 2003, but Alexakis continued the band with Dave &quot;Davey&quot; French (guitar), Josh Crawley (keyboards), Sam Hudson (bass guitar), and Tommy Stewart (drums, percussion). However all members except for Alexakis left the band in July 2009 to be replaced with a 3rd lineup of Everclear.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:09b8b8331de5f4aa482632ad2a8f2ea003cdbb9e","amp;dn":"Everclear+-+Rock+Star+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09b8b8331de5f4aa482632ad2a8f2ea003cdbb9e","infoHashBuffer":{"type":"Buffer","data":[9,184,184,51,29,229,244,170,72,38,50,173,42,143,46,160,3,205,187,158]},"announce":[],"urlList":[]}}