{"title":"Gormiti The Lords of Nature [NTSC][Wii][English][www.consolasato","uid":5844194,"size":4699980130,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:09bba39b20e903aaea90efa4dcdaec35fd711076&amp;dn=Gormiti+The+Lords+of+Nature+%5BNTSC%5D%5BWii%5D%5BEnglish%5D%5Bwww.consolasato&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":3,"time":1285092732,"description":"Plataforma: WII\nGÃƒÂ©nero: AcciÃƒÂ³n\nDesarrollo: Climax Group\nFormato: DVD Full\nVideo: NTSC\nMandos Necesarios: Wiimote &amp; nunchak\nIdiomas: English\nModificaciones: Ninguna\nJuego Online: No\nComprobaciÃƒÂ³n: Wiiflow cios rev 20\n\nResumen:\nGormiti: Los seÃƒÂ±ores de la Naturaleza incluye personajes y escenarios de la popular serie de televisiÃƒÂ³n coproducida por Marathon Media y Giochi Preziosi.\nLa acciÃƒÂ³n empieza cuando un personaje llamado Razzle estÃƒÂ¡ limpiando la biblioteca y tira accidentalmente unos libros a un portal. Los libros caen en la Isla de Gorm asolada por una batalla eterna entre grandes ejÃƒÂ©rcitos inspirados por las fuerzas elementales de la naturaleza. El juego recrea la hermosa isla ilustrada de Gorm, donde los seÃƒÂ±ores de la Tierra, del Mar, del Aire y del Bosque deben impedir que el malvado Magmion siembre el caos.\n\nCaracterÃƒÂ­sticas:\nÃ‚Â· La historia avanza gracias a una combinaciÃƒÂ³n de rompecabezas, combates y vÃƒÂ­deos. Resuelve rompecabezas, usa las habilidades ÃƒÂºnicas de tus Gormiti para vencer a tus enemigos y desbloquea escenas de animaciÃƒÂ³n con las voces de la serie original.\nÃ‚Â· Un gran modo Historia para descubrir: Atraviesa cinco extensos dominios con entornos de la seria de televisiÃƒÂ³n para desbaratar el malvado plan de teje rosoft Magmion de someter a su tirÃƒÂ¡nico gobierno la Tierra y la dimensiÃƒÂ³n paralela de Gorm.\nÃ‚Â· Aniquila a tus enemigos. Controla a los tres seÃƒÂ±ores de la Naturaleza de un grupo y usa las habilidades propias de cada uno para luchar contra los secuaces de Magmion utilizando ataques cuerpo a cuerpo, puntotorrent.com superataques o potentes ataques a distancia cambiando de personaje y de habilidad.\nÃ‚Â· El modo Torneo te permite demostrar tu valor: Desbloquea estadios de combate para ponerte a prueba frente a hordas de enemigos en un combate cronometrado.","torrent":{"xt":"urn:btih:09bba39b20e903aaea90efa4dcdaec35fd711076","amp;dn":"Gormiti+The+Lords+of+Nature+%5BNTSC%5D%5BWii%5D%5BEnglish%5D%5Bwww.consolasato","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09bba39b20e903aaea90efa4dcdaec35fd711076","infoHashBuffer":{"type":"Buffer","data":[9,187,163,155,32,233,3,170,234,144,239,164,220,218,236,53,253,113,16,118]},"announce":[],"urlList":[]}}