{"title":"Cannonball Adderley - Jazz At The Philharmonic (1960) [Jazz][mp3","uid":5748374,"size":136645378,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0cc194cee8ed0988d4d9718903e4fe56697c4e9c&amp;dn=Cannonball+Adderley+-+Jazz+At+The+Philharmonic+%281960%29+%5BJazz%5D%5Bmp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"schon55","files":12,"time":1281307658,"description":"Cannonball Adderley - Jazz At The Philharmonic \nOrig Year:  1960 \nRelease Date : Jun 24, 1997 \nLabel:  Pablo \nQuality: mp3 320 kbps CBR\n\nRecorded live at Salle Pleyel, Paris, France on November 25, 1960.  Includes liner notes by Chris Sheridan.\n\nCapturing the entirety of one of Norman Granz's legendary Jazz at The Philharmonic sets, complete with an effusive introduction by Granz himself, PARIS 1960 is one of the best of the many live recordings of Julian &quot;Cannonball&quot; Adderley. The 55-minute set finds the alto saxophonist at a pivotal point in his career, as he was moving away from hard bop into the funkier, more groove-oriented, but no less technically masterful soul-jazz style that made him a star in the '60s.\n\nThe opening &quot;Jeannine&quot; is a hard-bop standard, but the Adderley quintet, featuring (as always) his brother Nat on cornet, stretches it out, sounding relaxed yet still intense. &quot;The Chant,&quot; which Adderley had just recorded with his sideline group (the Pollwinners, featuring Wes Montgomery), sounds completely different--but no less outstanding--in its guitar-less arrangement. PARIS 1960 is essential for Adderley fans. ~ CD Universe\n\n&quot;The Cannonball Adderley Quintet Paris 1960&quot; is another one of my Fantasy/OJC warehouse clearance sale finds on the Oldies/Collectables website. This previously unreleased concert performance was made for Norman Granz's Jazz at the Philharmonic roadshow on November 25th at Salle Pleyel. The band is the same as on At the Lighthouse -- brother Nat, Victor Feldman, Sam Jones and Louis Hayes -- and they are exceptional, if not as famous as the group with Zawinul and Lateef. The extended modern compositions stretch out magically, yet there are still a few of his signature funky numbers, like &quot;Dis Here&quot; and &quot;The Chant,&quot; to groove on. The sound quailty is very good -- if anything it's a little too bright overall, and in certain spots, especially when the playing reaches a fever pitch, the horns get a bit shrill. For someone like myself who basically has the entire Cannonball discography from 1955-65, it's nice to now have this trip to Paris, particularly at a budget travel price. ~ Michael B. Richman\n\nPersonnel:\nCannonball Adderley (alto saxophone)\nNat Adderley (cornet)\nVictor Feldman (piano)\nSam Jones (bass)\nLouis Hayes (drums)\n\nCannonball Adderley - Jazz At The Philharmonic Tracks:\n01  Introduction\n02  Jeannine\n03  Dis Here\n04  Blue Daniel\n05  The Chant\n06  Bohemia After Dark\n07  Work Song","torrent":{"xt":"urn:btih:0cc194cee8ed0988d4d9718903e4fe56697c4e9c","amp;dn":"Cannonball+Adderley+-+Jazz+At+The+Philharmonic+%281960%29+%5BJazz%5D%5Bmp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cc194cee8ed0988d4d9718903e4fe56697c4e9c","infoHashBuffer":{"type":"Buffer","data":[12,193,148,206,232,237,9,136,212,217,113,137,3,228,254,86,105,124,78,156]},"announce":[],"urlList":[]}}