{"title":"City of Life and Death (Nanking Nanking) (2010) [DVDR5][DUAL][En","uid":5839852,"size":4651550720,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0e2f84b5644b29008a44ca9a6b0f59ca6c9463d3&amp;dn=City+of+Life+and+Death+%28Nanking+Nanking%29+%282010%29+%5BDVDR5%5D%5BDUAL%5D%5BEn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":-1,"time":1284856657,"description":"Ciudad De Vida Y Muerte (2010) [DVDR5][DUAL][Eng-Spa][+Sub]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1124052/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1124052/&lt;/a&gt; &lt;a href=&quot;\nhttp://alpacine.com/pelicula/22925/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://alpacine.com/pelicula/22925/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.elseptimoarte.net/peliculas/ciudad-de-vida-y-muerte-4231.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elseptimoarte.net/peliculas/ciudad-de-vida-y-muerte-4231.html&lt;/a&gt;\n\n\nTitle: City of Life and Death\nOriginal title: City of Life and Death (Nanking Nanking)\nCountry: China\nUSA release: 31/03/2010\nRelease in Spain: 09/04/2010\nCompany: China Film Group\nDirector: Lu Chuan\nScreenwriter: Lu Chuan\nCast: Liu Ye, Gao Yuanyuan, Hideo Nakaizumi, Wei Fan, Jiang Yiyan, Ryu Kohat, Bin Liu, John Paisley, Beverly Peckous, Lan Qin, Sam Vout, Di Yao, Zhao Yisui\n\nSynopsis:\nChina, in December 1937. The country is at war with Japan. Beijing and Shanghai have already fallen. Japanese troops arrive at the gates of Nanking, the capital. After weeks of bombing local and foreign officials have fled the city in ruins.\n\nLu, a charismatic Chinese general, firmly intends to throw the enemy and leads his men in the defense of the capital. They left little ammunition and tanks are coming Japanese. But they refuse to leave the city.\n\nMr. Tang is cautiously optimistic. He and his family are taken to the International Security Zone, where a growing number of Chinese found refuge. Under the command of a small group of foreigners who have stayed in the city, the area has become a real refugee camp. Ms Jiang, a young Chinese teacher with a strong sense of support, coordinates the life in this place full of people trying to protect as many people as possible.\n\nThe Japanese are taking over the city and installing its troops. Start the occupation of Nanking.\n\nKadokawa, a Japanese soldier quiet and romantic, look at the brutality of war, unable to prevent their actions.\n\nNanking is becoming a hell. All struggle to survive in a city where death is easier than life.\n\nProduction notes:\nThe slaughter of Nanking refers to &quot;the atrocities committed by the Japanese Imperial Army in the vicinity of the Chinese city after the fall of the capital on December 13, 1937.&quot;\n\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\n\n\nTÃƒÂ­tulo: Ciudad de vida y muerte\nTÃƒÂ­tulo original: City of Life and Death (Nanking Nanking)\nPaÃƒÂ­s: China\nEstreno en USA: 31/03/2010\nEstreno en EspaÃƒÂ±a: 09/04/2010\nProductora: China Film Group\nDirector: Lu Chuan\nGuiÃƒÂ³n: Lu Chuan\nReparto: Ye Liu, Yuanyuan Gao, Hideo Nakaizumi, Wei Fan, Yiyan Jiang, Ryu Kohata, Bin Liu, John Paisley, Beverly Peckous, Lan Qin, Sam Voutas, Di Yao, Yisui Zhao\n\nSinopsis:\nChina, Diciembre de 1937. El paÃƒÂ­s estÃƒÂ¡ en guerra con JapÃƒÂ³n. Beijing y Shanghai ya han caÃƒÂ­do. Las tropas japonesas llegan a las puertas de Nanking, la capital. DespuÃƒÂ©s de semanas de bombardeos los oficiales locales y extranjeros han huido de la ciudad en ruinas.\n\nLu, un carismÃƒÂ¡tico general chino, se propone firmemente echar al enemigo y lidera a sus hombres en la defensa de la capital. Les queda poca municiÃƒÂ³n y estÃƒÂ¡n llegando los tanques japoneses. Pero ellos, se niegan a abandonar la ciudad.\n\nEl Sr. Tang es cautelosamente optimista. El y su familia son conducidos a la zona de Seguridad Internacional, donde un creciente nÃƒÂºmero de chinos encuentran refugio. Bajo el mando de un pequeÃƒÂ±o grupo de extranjeros que se han quedado en la ciudad, la zona se ha convertido en un autÃƒÂ©ntico campo de refugiados. La Sra, Jiang, una joven profesora china con un fuerte sentido de la ayuda, coordina la vida en este lugar lleno de gente, tratando de proteger a tantas personas como pueda.\n\nLos japoneses se estÃƒÂ¡n apropiando de la ciudad e instalando sus tropas. Comienza la ocupaciÃƒÂ³n de Nanking.\n\nKadokawa, un silencioso y romÃƒÂ¡ntico soldado japonÃƒÂ©s, observa la brutalidad de la guerra, incapaz de impedir sus acciones.\n\nNanking se estÃƒÂ¡ convirtiendo en un infierno. Todos se esfuerzan en sobrevivir en una ciudad donde la muerte es mÃƒÂ¡s fÃƒÂ¡cil que la vida.\n\nNotas de producciÃƒÂ³n:\nLa masacre de Nanking refiere a &quot;las atrocidades cometidas por el EjÃƒÂ©rcito Imperial JaponÃƒÂ©s en los alrededores de la ciudad china tras la caÃƒÂ­da de la capital el 13 de diciembre de 1937&quot;. \n","torrent":{"xt":"urn:btih:0e2f84b5644b29008a44ca9a6b0f59ca6c9463d3","amp;dn":"City+of+Life+and+Death+%28Nanking+Nanking%29+%282010%29+%5BDVDR5%5D%5BDUAL%5D%5BEn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e2f84b5644b29008a44ca9a6b0f59ca6c9463d3","infoHashBuffer":{"type":"Buffer","data":[14,47,132,181,100,75,41,0,138,68,202,154,107,15,89,202,108,148,99,211]},"announce":[],"urlList":[]}}