{"title":"Autosport Magazine UK 14/10/2010","uid":5889215,"size":89884379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e55e6ef02c471efa2c49b3a77d4dd00a1f6e017&amp;dn=Autosport+Magazine+UK+14%2F10%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1287170274,"description":"NEWS\n10 Newey: Japan win vital. Suzuka success key to title bid, says team tech boss\n12 Hulkenberg on the rocks. Williams rookie may find his seat in doubt for 2011\n14 Two-day F1 resurfaces. Sat-Sun GP plan mooted after Japanese weather woes\n17 Peter Warr. Remembering the man who rescued Team Lotus\n20 Plato eyes Le Mans. BTCC champ keen on 24-hour chance with RML squad\n22 Bernard to boost IndyCar. US single-seater series boss pledges: work starts now\n24 Meeke v Wilks: the finale. Brits to fight it out for the final time in Scotland\n27 Kimi loses Red Bull deal. Raikkonen's Citroen future bleak after backing fizzles out\n\nREPORTS\n28 Japanese GP. Vettel leads Red Bull team-mate Webber to dominant Suzuka one-two\n42 BTCC Brands Hatch. Two wins for Jason Plato give the Chevy ace a share of the all-time wins record and a second drivers' title\n46 BTCC Supports. FRenault, Porsche Carrera Cup, Ginettas, Renault Clios\n53 Superleague Beijing. Earl Bamber pockets big pay-out in Chinese nonchampionship event\n55 FRenault 3.5 Barcelona. Mikhail Aleshin becomes first Russian title winner\n56 Bathurst 1000. Lowndes/Skaife lead Triple 8 Holden one-two\n59 World of Sport. NASCAR; Danish touring cars\n\nFEATURE\n40 Heidfeld's final hurrah? Sauber F1 returnee Nick Heidfeld reckons he's still got plenty to offer\n60 British F3 review. Looking back on French ace Jean-Eric Vergne's dominant season for Carlin squad\n\nSPORTS EXTRA\n77 Clio Cup budget cuts. Renault reduces costs in a bid to boost series interest\n78 Ginetta launches G55. GT3-style racer planned for 2011 introduction\n80 Bintcliffe back with Audi. Ex-BTCC racer commits to Brit GT with German marque\n82 Reports. Croft BARC; Pembrey British Rallycross; Silverstone HSCC; Donington Park AMOC; Mondello Park CCC/MIRC \n\nREGULARS\n93 Photo finish. Martin Brundle, IROC, Cleveland 1990\n94 Race of my life. Peter Warr, Japanese GP 1963\n\nOCRd by PDF Converter Professional 7. Cover has links to main stories.","torrent":{"xt":"urn:btih:0e55e6ef02c471efa2c49b3a77d4dd00a1f6e017","amp;dn":"Autosport+Magazine+UK+14%2F10%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e55e6ef02c471efa2c49b3a77d4dd00a1f6e017","infoHashBuffer":{"type":"Buffer","data":[14,85,230,239,2,196,113,239,162,196,155,58,119,212,221,0,161,246,224,23]},"announce":[],"urlList":[]}}