{"title":"Asses Of Face Destruction 9 (2010) ","uid":5755622,"size":1467082752,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0f26a5f9ee7e156b61d2f5d03d77bfb16385e50e&amp;dn=Asses+Of+Face+Destruction+9+%282010%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":2,"time":1281553390,"description":"Asses Of Face Destruction 9 (2010) \n &lt;a href=&quot;\nhttp://e.orgazmik.com/film/detail/4520615.htm?RID=ADT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://e.orgazmik.com/film/detail/4520615.htm?RID=ADT&lt;/a&gt; &lt;a href=&quot;\nhttp://www.tlavideo.com/raw-asses-of-face-destruction-9/p-311295-4?sn=1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tlavideo.com/raw-asses-of-face-destruction-9/p-311295-4?sn=1&lt;/a&gt;\n\nStudio \tEvil Angel\nRelease Date Aug 06, 2010\nCategory Fetish, Big Butts, FemDom, Smothering\nStarring Sophie Dee, Kelly Divine, Evie Delatosso, Jamie Elle, Monica Santhiago, James, Bubba, Derrick Paul, Deviant Kade\n\n\nFans who get off on watching bitchy, big-butted beauties humiliate submissive guys with verbal abuse and fierce face-sitting, come to attention ... you know who you are. And Roman Video has your dream DVD. Asses Of Face Destruction 9 presents five nasty scenarios starring dominant divas who know how to wield their caustic vocabularies and plump, curvy cheeks to subjugate meek mooks. Each scene starts with POV-style footage: A butt-blessed babe makes direct eye contact with the camera to nastily tell you off, then turns her rump to the lens for your genuflection. Following each POV segment, you become a voyeur as these unattainable prima donnas demonstrate their superiority with ass worship sessions for hapless, servile wimps. Kelly Divine was evidently born to sit face. Naked but for gloves, high heels and a black latex skirt stretched to cover her gigantic glutes, she looks spectacular. With words like, &quot;Take a look at my beautiful ass, your new home,&quot; she shows that her shit-talking talent matches her stunning back acres. She idly reads a book while seated on the head of slave Bubba, then ups the authoritative ante. This scene becomes an epic marathon of rim jobs, butt worship and breath control enforced by Kelly's crop and her deeply cleaved buttocks. Mega-buxom Sophie Dee is a proper British bitch offering up her rosebud for sniffing. She harasses slave Kade verbally and physically, slapping the worm and smothering him with her cheeky rump and her foot, and pleasing her pussy and asshole on his mouth. Brazilian beauty Monica Santhiago's round bunda looks dramatic set off by her tiny waist, muscular thighs and the tan lines left by a microscopic thong. Speaking Portuguese, she yanks slave Derrick Paul's head up her ass by a leash. When he's tied spread and naked on a bed she can pry his nose up her firm crack and jiggle her junk hypnotically. She tickles him, squeezes his nipples and balls, slaps his pecker hard and smothers his face in her tensing cheeks as she masturbates to a gasping orgasm. A naturally curvy bod and delightfully nasty mouth make young, fair-skinned Italian-American Evie Delatosso a face sitting prodigy. In simpering voice she tells &quot;pathetic loser&quot; James he's &quot;no better than a waste receptacle,&quot; then exercises breath control, grinding her pussy and round rear on his tongue and mouth. &quot;A little girl half your fucking size controlling every fucking move you make and every breath you take,&quot; she taunts, and Sting will wish he'd written it that way. The saucy vixen spews another lyric not found on a Police album: &quot;How's the smell of my ass on your face?&quot; Dirty blonde Jamie Elle takes a job from James, who cares only to ogle her behind as she bends over a filing cabinet. She turns the tables and blackmails him into a big raise, health benefits, bonuses and paid vacation all by the power of ass. ","torrent":{"xt":"urn:btih:0f26a5f9ee7e156b61d2f5d03d77bfb16385e50e","amp;dn":"Asses+Of+Face+Destruction+9+%282010%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f26a5f9ee7e156b61d2f5d03d77bfb16385e50e","infoHashBuffer":{"type":"Buffer","data":[15,38,165,249,238,126,21,107,97,210,245,208,61,119,191,177,99,133,229,14]},"announce":[],"urlList":[]}}