{"title":"Manil Night (1980) DVDRip XViD Hard EngSub-sribats75","uid":5888786,"size":1258504239,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f3759ae2ca60c377a784458659290e000fea708&amp;dn=Manil+Night+%281980%29+DVDRip+XViD+Hard+EngSub-sribats75&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1287153278,"description":"Manila By Night, City After Dark (1980)\n\nCategory: Drama\nLabel Others\n\nManila By Night is director Ishmael Bernal's and possibly Philippine Cinema's best work. Recognized locally and abroad, it probes the city's depravity and exposes its strangeness through a string of characters played by the most competent actors of its time. \n\nLorna Tolentino, Alma Moreno, Gina Alajar, Rio Locsin, Cherie Gil, Mitch Valdez, Charito Solis, Orestes Ojeda, William Martinez and Bernardo Bernardo play an esemble of desperate characters trapped between the city's lure of a better life and its dark and ghastly ways of providing for its residents. The impoverished women pin their hopes on the city and the men lure them into prostitution, drugs and crime.\n\nIronically, while they seem to ruin one another's lives, they also become each other's best chances for hope and survival. The drug-pushing lesbian played by Cherie Gil finds solace in the blind sauna bath employee played by Rio Locsin who in turn is led across the dismal streets of Manila by the gay couturier played by Bernardo Bernardo.\n\nManila by Night is a keen look into the social problems affecting Manila's underworld. With its controversial bold visual imagery, it is a brilliant reflection of the reality that the Filipino has yet to confront. \n","torrent":{"xt":"urn:btih:0f3759ae2ca60c377a784458659290e000fea708","amp;dn":"Manil+Night+%281980%29+DVDRip+XViD+Hard+EngSub-sribats75","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f3759ae2ca60c377a784458659290e000fea708","infoHashBuffer":{"type":"Buffer","data":[15,55,89,174,44,166,12,55,122,120,68,88,101,146,144,224,0,254,167,8]},"announce":[],"urlList":[]}}