{"title":"Kah Narm Nom 1981 VCD [Thai Movie]","uid":5855544,"size":1407612654,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f3dfea6d32fd002ec6727b800708a7e6ca6fa62&amp;dn=Kah+Narm+Nom+1981+VCD+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"poothaijaa","files":-1,"time":1285600533,"description":"Title: Kah Narm Nom\nYear: 1981\nGenre: Drama\nCountry: Thailand\nAudio: Thai\nSubtitle: none\nStarring: Sorapong Chatree, Porjed Kaenpetch, Pissamai \n\nWilaisak, Naowarat Yooktanun, Wiyada Umarin\n\nSource: 2 VCDS\nFile Format: AVI\n\nPlot:\nThe story is about the love of a mother towards her two \n\nsons, Khun Thong and Salika. Khun Thong, in self defense, \n\nshots Na khan, who previously killed his father 10 years \n\nago and also injured his mother during a recent raid. The \n\nmother's love becomes painful because Khun Thong has \n\nbecome an outlaw. This movie has similar scenario to the \n\nversion shot in 1974 but it focus more about the mother \n\nsuffering. Na Khan's son used Khun Thong's name to raid \n\nother houses so Khun Thong has no way to quit. Khun Thong \n\nis a Thai Robin Wood and gives help to the poorest. Khun \n\nThong is still a good son and keeps the money he robs for \n\nhis mother and for his younger brother to enter monkhood. \n\nRejected by both his mother and brother who refuse dirty \n\nmoney, Khun Thong decides to work as a peasant and \n\ncarpenter to earn money from his hard work. But fate is \n\nagainst him. His girlfriend is trapped by Na khan son's \n\ngang, raped and killed. Khun Thong is accused again. His \n\nmother is disappointed by his behavior, saying it was not \n\nworth to educate him for becoming an outlaw and that \n\nfeeding milk to him was such a waste. He becomes an outlaw \n\nagain to catch Na Khan's son. He wants his teammates to \n\nsurrender and become good people. Finally he catches Na \n\nKhan's son, who recognizes all the evil he has done over \n\nKhun Thong's name. It is too late as her mother doesn't \n\nwant to talk to Khun Thong anymore. Willing to die, he \n\nmisbehaves a last time to force his mother to shoot him. \n\nBefore dying, Khun Thong and his mother confirm their \n\nfilial love and Khun Thong can grab Salika's yellow robe \n\nas his brother has become a monk. It is certainly one of \n\nthe best role of Sorapong Chatree.","torrent":{"xt":"urn:btih:0f3dfea6d32fd002ec6727b800708a7e6ca6fa62","amp;dn":"Kah+Narm+Nom+1981+VCD+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f3dfea6d32fd002ec6727b800708a7e6ca6fa62","infoHashBuffer":{"type":"Buffer","data":[15,61,254,166,211,47,208,2,236,103,39,184,0,112,138,126,108,166,250,98]},"announce":[],"urlList":[]}}