{"title":"AC/DC - Rock 'N' Roll Damnation (2nafish)","uid":5731610,"size":118304772,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1037b07d58d608f6642e5b6ab49f58a94641f133&amp;dn=AC%2FDC+-+Rock+%5C%27N%5C%27+Roll+Damnation+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280672140,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Rock 'n' Roll Damnation&quot; is a single by the Australian rock band AC/DC, and the first track on their Powerage album, released in 1978. Written by Angus Young, Malcolm Young and Bon Scott, it was played live by the band during the Powerage tour, and was also played live during the 2003 world tour, sung by Brian Johnson, Scott's replacement. It also appeared on the 1978 live album If You Want Blood You've Got It. The song also featured in AC/DC's Iron Man 2 soundtrack.\n\nPowerage is the fifth studio album by Australian hard rock band AC/DC, released in May 1978. It is also AC/DC's fourth international studio album. All songs were written by Angus Young, Malcolm Young, and Bon Scott.\n\nIt was originally released on Atlantic Records, and reached No. 133 on Billboard's Pop Albums chart in the US, eventually going platinum there. Powerage was re-released in 2003 as part of the AC/DC remasters series.\n\nPowerage is the first AC/DC album to be released nearly simultaneously in both Australian and international markets, and the first to use just one cover image for both. It was also the first to feature the same track listing on all versions, with the exception of the European vinyl edition (specifically, the first UK pressing of the LP). This version included &quot;Cold Hearted Man&quot;, a song that was not previously released, and would not be released on any other AC/DC album until 2009's AC/DC Backtracks box set, but which became more widely available through the box set of Bon Scott-era vinyl LP albums  in 1987, the first reissue of a set first released in 1981. The first UK pressing also includes different mixes than all later versions, most markedly on &quot;Down Payment Blues&quot; (which excludes the bluesy coda heard on later pressings) and &quot;What's Next to the Moon,&quot; which omits solos and backing vocals heard on later pressings. Within the 1987 box set, the song was packaged on a single sided 12-inch single. In some territories, Powerage omitted &quot;Rock 'n' Roll Damnation&quot;. This was due to a rushed job in getting the LP to pressing plants in time for the release date, hence &quot;Rock 'n' Roll Damnation&quot; (which was not yet completed) was omitted, &quot;Cold Hearted Man&quot; was added, and the rushed mixes are different than the 'finished' mixes that were thereafter used.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1037b07d58d608f6642e5b6ab49f58a94641f133","amp;dn":"AC%2FDC+-+Rock+%5C%27N%5C%27+Roll+Damnation+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1037b07d58d608f6642e5b6ab49f58a94641f133","infoHashBuffer":{"type":"Buffer","data":[16,55,176,125,88,214,8,246,100,46,91,106,180,159,88,169,70,65,241,51]},"announce":[],"urlList":[]}}