{"title":"Justin Bieber - U Smile (Xvid-2nafish) 1080p","uid":5859564,"size":146871492,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:103fba24ce1c488b79878322dcc709061f8f3c3e&amp;dn=Justin+Bieber+-+U+Smile+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1285914875,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:30\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 23.98\nBitRate : 4031 Kbps\nQuality Factor : 0.08 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no extra logos or titles.\n\n\n&quot;U Smile&quot; is a song performed by Canadian recording artist Justin Bieber. It was written by Bieber, Jerry Duplessis, Arden Altino, and Dan August Rigo, and produced by Duplessis and Altino. According to Bieber, the song is dedicated to his fans. The song was released as the second digital-only single from the latter half of Bieber's debut album on March 16, 2010. It will be released to mainstream radio in Canada on August 9, 2010, followed by a mainstream and rhythmic release on August 24, 2010, in the United States as the album's third single.\n\nThe song, a piano and instrument driven blue-eyed soul ballad, garnered acclaim from critics as a standout track from the album. The song charted at seventeen and twenty-seven respectively in the United States and Canada, and later charted in the United Kingdom. Bieber performed the song as an intro to &quot;Baby&quot; on the ninth season of American Idol and on Saturday Night Live.\n\nOn September 30, 2010, the video for &quot;U Smile&quot; premiered online. Bieber had stated that the video for &quot;U Smile&quot; was about &quot;letting fans experience the ultimate fantasy for any hard-core Belieber: being Justin's girlfriend&quot;, further explaining in a tweet, &quot;I took the opportunity 2 make a video 4 the fans, about a fan, and how we could fall IN LOVE.&quot; Mawuse Ziegbe from MTV met the video with a positive review. Ziegbe felt that the video suggested &quot;a more mature Bieber, who appears to relish the quiet moments with his gal pal away from the nonstop fan hysteria.&quot; Ziegbe also felt that the video &quot;displayed [Biebers] skills as an instrumentalist, as he belts out the lyrics from behind a grand piano throughout much of the vid.&quot;\n\nStarting out in a black and white frame (and later incorporating scenes of color), a group of girls are seen standing outside on the street while Bieber is seen exiting a building while trying to walk away without getting noticed. This however, is unsuccessful as the girls run up to Bieber; he then takes pictures and signs autographs with the girls. While this is happening Bieber takes an entrust with one particular girl asking her to meet him later on, to which she agrees. As the song starts playing Bieber is seen sitting in an empty auditorium playing the piano and singing. When Bieber's date shows up they sneak into an empty theater where they are seen; holding hands, horsing around on the theater's seats, and sliding down banisters. At the ending of the video they are seen engaging in a playful back-alley water fight and eventually collapse into each other's arms while Bieber is playing the piano back inside the theater.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:103fba24ce1c488b79878322dcc709061f8f3c3e","amp;dn":"Justin+Bieber+-+U+Smile+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"103fba24ce1c488b79878322dcc709061f8f3c3e","infoHashBuffer":{"type":"Buffer","data":[16,63,186,36,206,28,72,139,121,135,131,34,220,199,9,6,31,143,60,62]},"announce":[],"urlList":[]}}