{"title":"Star Trek: Voyager - Season 4 (1997) DVDRip Xvid Eng MP3 MKV [Bi","uid":5904828,"size":12733260570,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:11dcc0f7bd3bcbfd6f9c52f6922e47b3f76bf7d6&amp;dn=Star+Trek%3A+Voyager+-+Season+4+%281997%29+DVDRip+Xvid+Eng+MP3+MKV+%5BBi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bigjazz.h33t","files":28,"time":1287823457,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nStar Trek: Voyager - Season 4 (1997) DVDRip Xvid Eng MP3 MKV\n\nTitle:\t\tStar Trek: Voyager\nRelease:\tTV: 1997\tDVD:2004\nSeason:\t\t4 (Complete)\nRuntime:\tEach Episode approx. 44mins\n\nEncoding\n\nVideo;\nResolution:\t576x432\nBitrate:\t~1300kbps @ 25fps\nCodec:\t\tXvid, v1.2.2\nFormat:\t\tMatroska (.mkv)\n\nAudio;\nTrack 1:\t2.0 Channel MP3 VBR, English\n\nSubtitles:\tEnglish, French, German, Swedish, Danish, Norwegian, Dutch, Italian, Spanish\n\nScene Markers:\tEncoded with Scene Titles\n\nFile Size:\t~470MB\n\nSource Info;\nType:\t\tPAL DVD (R4)\nFrame Type:\tFull Frame, Interlaced\n\nTorrent Files:\t28\n\nPulled to the far side of the Galaxy, where the Federation is 75 years away at maximum warp speed, a Starfleet ship must cooperate with Maquis rebels to find a way home.\n\nCast:\nKate Mulgrew ...   Captain Kathryn Janeway\nRobert Beltran ...   Chakotay\nRoxann Dawson ...   B'Elanna Torres\nRobert Duncan McNeill ..Tom Paris\nEthan Phillips ...   Neelix\nRobert Picardo ...   The Doctor\nTim Russ ...   Tuvok\nGarrett Wang ...   Harry Kim\nTarik Ergin ...   Lieutenant Ayala\nJeri Ryan ...   Seven of Nine\nMajel Barrett ...   Voyager Computer\nJennifer Lien ... Kes\n\nStar Trek: Voyager - Season 4\n\n401 - Scorpian, Part II\nJaneway and Tuvok work with the Borg and meet Seven of Nine as they work on developing a weapon against Species 8472 in exchange for safe passage through Borg space.\n\n402 - The Gift\nKes' mental abilities develop to a point where they endanger Voyager.\n\n403 - Day of Honour\nB'Elanna tries to observe the Klingon Day of Honor after the warp core is lost.\n\n404 - Nemesis\nChakotay helps fight in an alien war.\n\n405 - Revulsion\nA hologram contacts Voyager and the Doctor is excited to meet another hologram.\n\n406 - The Raven\nSeven of Nine experiences Borg flashbacks as she attempts to become more human.\n\n407 - Scientific Method\nThe crew have unexplained illnesses as they are closely observed by unseen intruders.\n\n408 - Year Of Hell\nVoyager creates a new Astrometrics Lab, which maps a new course that brings them into contact with a Krenim temporal ship that can erase things from history.\n\n409 - Year of Hell, Part II\nA badly damaged Voyager hides in a nebula as a skeleton crew attempts repairs; meanwhile the Krenim commander proposes a compromise to Chakotay and Paris.\n\n410 - Random Thoughts\nTorres is arrested while visiting a world of telepaths where violent thoughts are a crime.\n\n411 - Concerning Flight\nAliens steal several key components of Voyager, which are retrieved with assistance from a holographic Leonardo Da Vinci.\n\n412 - Mortal Coil\nNeelix dies in an attempt to sample proto-matter from a nebula. Seven of Nine believes she can revive him using Borg nanoprobes, but Neelix finds it hard to adjust, particularly given that he has no memory of an afterlife of any kind.\n\n413 - Waking Moments\nThe crew of Voyager start to have dreams from which they cannot wake, and only Chakotay can save them.\n\n414 - Message in a Bottle\nThe Doctor's program is sent to an advanced Starfleet vessel via a vast ancient communications network, but he soon discovers that only he and the ship's own EMH remain to fight against Romulans who have taken over the ship and are attempting to return to Romulan space with it.\n\n415 - Hunters\nA transmission from Starfleet Command gets held at a Hirogen relay station and Janeway sets course to retrieve it.\n\n416 - Prey\nVoyager rescues a Hirogen survivor who tells them a new kind of prey is on the loose.\n\n417 - Retrospect\nAfter experiencing unsettling halucinations, Seven of Nine is hypnotized by the Doctor whose analysis reveals a trader may have extracted Borg technology from Seven without her consent.\n\n418 - The Killing Game\nThe Hirogen implant devices into the crew making them believe they are characters within the holodecks being used for hunts.\n\n419 - The Killing Game, Part II\nThe Hirogen implant devices into the crew making them believe they are characters within the holodecks being used for hunts.\n\n420 - Vis A Vis\nAn alien shuttle with a prototype propulsion system suddenly appears and requires assistance. Paris is restless and volunteers to help the pilot, Steth, repair the shuttle.\n\n421 - The Omega Directive\nJaneway receives the Omega Directive, an order to destroy the Omega molecules, even if it means violating the Prime Directive.\n\n422 - Unforgettable\nAn alien female from a cloaked ship asks for Chakotay by name and requests asylum on Voyager from her people.\n\n423 - Living Witness\nA Kyrian museum curator 700 years in the future hopes a Voyager relic containing a copy of the Doctor can confirm their version of history.\n\n424 - Demon\nTom Paris and Harry Kim take a shuttle down to an extremely inhospitable planet to obtain fuel.\n\n425 - One\nSeven of Nine is left alone on Voyager when a nebula's deadly radiation forces the rest of the crew to stay in stasis and the Doctor's hologram projectors are disrupted.\n\n426 - Hope and Fear\nParis and Neelix return from a mission with a passenger named Arturis who knows more than 4,000 languages. He manages to decode a message from Starfleet that could lead to a way home.\n\n-------------------------------------------------------------------\nPlease share....Don't hit and run...Seed it back at least once.\n\nOf course, if you want to seed it back more than once, that would be ok too :)\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:11dcc0f7bd3bcbfd6f9c52f6922e47b3f76bf7d6","amp;dn":"Star+Trek%3A+Voyager+-+Season+4+%281997%29+DVDRip+Xvid+Eng+MP3+MKV+%5BBi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11dcc0f7bd3bcbfd6f9c52f6922e47b3f76bf7d6","infoHashBuffer":{"type":"Buffer","data":[17,220,192,247,189,59,203,253,111,156,82,246,146,46,71,179,247,107,247,214]},"announce":[],"urlList":[]}}