{"title":"Top 20 Songs In Digital History","uid":5745251,"size":145475608,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11f2e09cd4e198768dae6a35a92c8615563ce0df&amp;dn=Top+20+Songs+In+Digital+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mujm","files":20,"time":1281187466,"description":"1. The Black Eyed Peas, &quot;I Gotta Feeling,&quot; 6,049,000. This ultra catchy song was #1 for 14 weeks, beginning in July 2009. It replaced &quot;Boom Boom Pow&quot; in the top spot, giving the Peas a record-setting 26-week run at #1. It won a Grammy for Best Pop Performance by a Duo or Group with Vocals and was nominated for Record of the Year..\n\n2. Flo Rida featuring T-Pain, &quot;Low,&quot; 5,640,000. This rap smash was #1 for 10 weeks beginning in January 2008. It was Flo Rida's first chart hit; T-Pain's 13th. It was T-Pain's third #1, following his own &quot;Buy U A Drank (Shawty Snappin')&quot; and Chris Brown's &quot;Kiss, Kiss,&quot; on which he was featured..\n\n3. Lady Gaga featuring Colby O'Donis, 5,616,000. &quot;Just Dance,&quot; This Madonna-inspired smash was #1 for three weeks in January 2009. It was Gaga's first chart hit; O'Donis' second, following his own &quot;What You Got&quot; (featuring Akon)..\n\n4. The Black Eyed Peas, &quot;Boom Boom Pow,&quot; 5,517,000. This was #1 for 12 weeks, beginning in April 2009. It was the Peas' first #1. The video won a Grammy for Best Short Form Music Video..\n\n5. Lady Gaga, &quot;Poker Face,&quot; 5,451,000. This was #1 for one week in April 2009. It was Gaga's second #1. It won a Grammy for Best Dance Recording and was nominated for both Record and Song of the Year..\n\n6. Jason Mraz, &quot;I'm Yours,&quot; 5,267,000. Mraz wrote this little ditty in 15 minutes. It was time well spent. The mellow pop shuffle hit #6 in September 2008. It was Mraz's first top 10 hit. It remained on the Hot 100 through October 2009, setting an all-time record for most weeks on the chart (76). It was nominated for a Grammy for Song of the Year..\n\n7. Ke$ha, &quot;TiK ToK,&quot; 5,078,000. Ke$ha gave Mick Jagger a name check on this cheeky smash, which began a nine-week run at #1 in January 2010.  It was Ke$ha's first Hot 100 single (not counting &quot;Right Round&quot;)..\n\n8. Timbaland featuring OneRepublic, &quot;Apologize,&quot; 4,747,000. This classy pop ballad logged four weeks at #2, beginning in November 2007. It was OneRepublic's first Hot 100 hit. It was Timbaland's third top 10 hit as a &quot;lead&quot; artist, following &quot;Give It To Me&quot; (featuring Nelly Furtado and Justin Timberlake) and &quot;The Way I Are&quot; (featuring Keri Hilson)..\n\n9. Taylor Swift, &quot;Love Story,&quot; 4,654,000. This is the best-selling country crossover song in digital history. It hit #4 in January 2009. It was Swift's second top 10 hit, following &quot;Change.&quot;.\n\n10. Flo Rida, &quot;Right Round,&quot; 4,594,000. Less than a year after &quot;Low&quot; ended its long run at #1, Flo Rida was back in the top spot. This was #1 for six weeks, beginning in February 2009..\n\n11. Coldplay, &quot;Viva La Vida,&quot; 4,588,000. This majestic pop hit is the best-selling digital hit by an act that hails from outside the U.S. It was #1 for one week in June 2008. It was the English group's first #1 hit. &quot;Viva La Vida&quot; won two Grammys: Song of the Year and Best Pop Performance by a Duo or Group with Vocals..\n\n12. Soulja Boy Tell'Em, &quot;Crank That (Soulja Boy),&quot; 4,520,000. This rap smash was #1 for seven weeks, beginning in September 2007. It was Soulja Boy's first Hot 100 single..\n\n13. Katy Perry, &quot;Hot N Cold,&quot; 4,461,000. This propulsive pop smash hit #3 in November 2008. It was Perry's second top 10 single, following &quot;I Kissed A Girl.&quot;.\n\n14. Train, &quot;Hey, Soul Sister,&quot; 4,311,000. Train ended a nine-year absence from the top 10 when this melodic pop tune logged four weeks at #3, beginning in April 2010. The 80s-themed hit gave name-checks to both the famous (Madonna) and the nearly forgotten (Mr. Mister). It was Train's second top 10 hit, following &quot;Drops Of Jupiter (Tell Me).&quot;.\n\n15. Beyonce, &quot;Single Ladies (Put A Ring On It),&quot; 4,166,000. This ubiquitous smash was #1 for four weeks, beginning in December 2008. It was Beyonce's fifth #1 solo hit, which exceeds the four she had with Destiny's Child. It won three Grammys (more than any other hit on this list):  Song of the Year, Best R&amp;B Song and Best Female R&amp;B Vocal Performance..\n\n16. Lady Gaga, &quot;Bad Romance,&quot; 4,154,000. This melodramatic hit logged seven weeks at #2, beginning in December 2009. It could put Gaga back in the Grammy finals for Record and Song of the Year..\n\n17. Kanye West, &quot;Stronger,&quot; 4,106,000. For his first #1 hit, 2005's &quot;Gold Digger,&quot; West teamed with Jamie Foxx. On this smash, which was #1 for one week in September 2007, West proved he could do it on his own. It won a Grammy for Best Rap Solo Performance..\n\n18. Miley Cyrus, &quot;Party In The U.S.A.,&quot; 4,105,000. This summer anthem was #2 for three weeks, beginning in August 2009. It was the teen star's fourth top 10 hit, following &quot;See You Again,&quot; &quot;7 Things&quot; and &quot;The Climb.&quot; Cyrus, 17, is the youngest artist on this list..\n\n19. Lady Antebellum, &quot;Need You Now,&quot; 4,028,000. This country/pop smash echoes such Eagles classics as &quot;New Kid In Town&quot; and &quot;Lyin' Eyes.&quot; It was #2 for two weeks in March 2010. Grammy nominations for Record and Song of the Year are a foregone conclusion..\n\n20. Leona Lewis, &quot;Bleeding Love,&quot; 4,026,000. This is odd: No American Idol alumnus has had a 4 million digital seller, but a winner on Britain's The X Factor did the trick. This elegant ballad was #1 for four weeks, beginning in April 2008. It was Lewis' first Hot 100 single. It was nominated for a Grammy for Record of the Year.\n","torrent":{"xt":"urn:btih:11f2e09cd4e198768dae6a35a92c8615563ce0df","amp;dn":"Top+20+Songs+In+Digital+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11f2e09cd4e198768dae6a35a92c8615563ce0df","infoHashBuffer":{"type":"Buffer","data":[17,242,224,156,212,225,152,118,141,174,106,53,169,44,134,21,86,60,224,223]},"announce":[],"urlList":[]}}