{"title":"Microsoft Security Essentials Beta for 32-bit","uid":5752297,"size":8158535,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:12038d48748cbe4515b8342216b13d30f02a9e7d&amp;dn=Microsoft+Security+Essentials+Beta+for+32-bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ktoshiba","files":2,"time":1281398806,"description":"Microsoft released a beta of the new version of its Security Essentials antimalware software. Following version 1.0 of the free Security Essentials released in September, the folks in Redmond outfitted the 2.0 beta with an updated antimalware engine. The new engine is smarter at detecting and removing security threats and offers a better performance, according to a Microsoft blog. The software also now integrates directly with Windows Firewall and gives users the option to turn the firewall on or off.\n\nBy integrating with Internet Explorer, the Security Essentials beta provides greater protection against Web-based threats, Microsoft said. It can also watch for attacks that come via a network, though this option is only available in Windows Vista and Windows 7. Users of Windows XP can't take advantage of this particular feature because XP lacks the necessary Windows Filtering Platform.\n\nYou can find and download the new beta at Microsoft's Connect page where you'll need to log in with a Windows Live account. You'll then be directed to the download page where you choose whether to grab the 32-bit or 64-bit version.\n","torrent":{"xt":"urn:btih:12038d48748cbe4515b8342216b13d30f02a9e7d","amp;dn":"Microsoft+Security+Essentials+Beta+for+32-bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12038d48748cbe4515b8342216b13d30f02a9e7d","infoHashBuffer":{"type":"Buffer","data":[18,3,141,72,116,140,190,69,21,184,52,34,22,177,61,48,240,42,158,125]},"announce":[],"urlList":[]}}