{"title":"Dambusters_Declassified_13_09_2010_b00trb28_p009x7pc.mpg","uid":5866295,"size":378566656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:120d774a144f390d6159afe94367ff85a89034bc&amp;dn=Dambusters_Declassified_13_09_2010_b00trb28_p009x7pc.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cosmcp","files":1,"time":1286226703,"description":"\n\nTelevision actor and vintage plane enthusiast Martin Shaw uncovers new information about the RAF's famous wartime Dambusters raid. \n  \nExecutive Producer Ian Cundall said: &quot;Many people think they know the story of the Dambusters but the truth is even more extraordinary than the famous movie version of the raid.\n\n&quot;Our interview with Guy Gibson's girlfriend sheds new light on a complex character who led his men to success on what was an almost impossible mission.&quot;\n   \nMartin Shaw, who holds his own private pilot's licence and flies vintage planes, can be seen in the documentary flying over the Upper Derwent Valley in the Peak District above Sheffield where 617 squadron famously practised their bomb runs before embarking on their mission to destroy dams in Germany during World War II. \n \nHe is joined in the cockpit of the Piper Navajo plane by war hero and Dambusters expert Wing Commander Chris Norton, who led the Harrier jump jets of the RAF's elite No1 Squadron against targets in Kosovo and the latest Gulf War.   \n \nThe pair trace the entire wartime route from RAF Scampton - home to the original 617 Squadron - to the Ruhr Valley in Germany where a local survivor talks about the raid. \n \nShaw said: &quot;This has been an amazing journey for me... I've learned so much about a story that I knew very well.\n\n&quot;So what have I learnt along the way? Well the Dambusters story and the men who made it possible.\n\n&quot;It's not like the movie at all... oh, no in truth it's a far more unbelieveable, a far more amazing story than that.&quot;\n","torrent":{"xt":"urn:btih:120d774a144f390d6159afe94367ff85a89034bc","amp;dn":"Dambusters_Declassified_13_09_2010_b00trb28_p009x7pc.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"120d774a144f390d6159afe94367ff85a89034bc","infoHashBuffer":{"type":"Buffer","data":[18,13,119,74,20,79,57,13,97,89,175,233,67,103,255,133,168,144,52,188]},"announce":[],"urlList":[]}}