{"title":"Coast to Coast AM - 07-25-10 - Assessing the Internet","uid":5720073,"size":57242841,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:135f559e8880cc1c624b30b54ad3966a5d6c28f1&amp;dn=Coast+to+Coast+AM+-+07-25-10+-+Assessing+the+Internet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bravos2u","files":5,"time":1280256453,"description":"Date:\n 07-25-10\n \nHost:\n George Knapp\n \nGuests:\n Nicholas Carr, Lee Crockett \n \n\n\nDuring the first half of the program, George Knapp welcomed writer Nick Carr, who thinks the Internet is forcing us to lose our contemplative brains for a distracted sampling of scanned bits of information. In the latter half of the show, author and speaker Lee Crockett looked at the beneficial aspects of the rapid advancement of technology. \n\nExplaining his concerns over the Internet's role in changing the way people think, Carr said that knowledge can be broken down into two parts: finding information and being able to think deeply about that information. It is that second aspect of knowledge which he believes the Internet is causing people to lose. Contrasting the Internet with books, he pointed out that printed text trains people to become immersed in the material and teaches them to pay attention. However, Carr said, the Internet performs the opposite function. &quot;It doesn't shield us from distraction, the way a printed page does, it inundates us with distractions,&quot; he lamented. \n\nIn detailing the scientific research into the deleterious effects of the Internet on thinking, Carr cited a study which had people read an online text with links embedded within it. The research, he said, showed that reading comprehension decreased as the number of links increased. Carr stressed that this happened regardless of whether or not the links were actually clicked, because the decision-making part of the brain had to evaluate them, thus taking the reader's attention away from the text. He also noted a medical study which tracked the eyes of someone reading text on the Internet. According to this research, the eyes travel in an &quot;F&quot; formation, scanning the top lines of the text, then drifting down the left hand side, then skimming the middle portion, and then drifting down to the bottom. As such, Carr mused, &quot;when we're 'reading' online, we're actually not doing that much reading.&quot;\n\nConversely, Crockett, the author of Understanding the Digital Generation and Living on the Future Edge, expressed enthusiasm about where technology is headed. &quot;It can be scary, but I look at it with great optimism,&quot; he said, &quot;I think it is a very exciting time.&quot; He marveled that current research suggests that computing power will exponentially double every six months and &quot;this is going to continue for another 50 to 100 years.&quot; As an example of the potency of this exponential growth, Crockett said that extrapolating a contemporary computer to the year 2022 yields a device with &quot;200 terabytes of RAM, a 40 terabyte hard drive, and is going to cost $1.37.&quot;\n\nHe also talked about new technologies that may soon emerge in everyday life. One such device, which he said was &quot;very, very close,&quot; is the bionic contact lens. &quot;It's projected that these are going to replace computer monitors in the next three to five years,&quot; Crockett said. He explained that this device would &quot;project images, for you, in front of your eyes.&quot; As such, these floating images will create an &quot;augmented reality&quot; where people can see information about others when they look at them. This new form of reality, Crockett predicted, will lead to a &quot;fully immersive&quot; three-dimensional form of the Internet that &quot;won't look anything like it does now.&quot; \n\n\nWebsite(s):\n-nicholasgcarr.com\n-committedsardine.com\n-understandingthedigitalgeneration.com\nBook(s):\n-The Shallows: What the Internet Is Doing to Our Brains\n-Living on the Future Edge\n-Understanding the Digital Generation","torrent":{"xt":"urn:btih:135f559e8880cc1c624b30b54ad3966a5d6c28f1","amp;dn":"Coast+to+Coast+AM+-+07-25-10+-+Assessing+the+Internet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"135f559e8880cc1c624b30b54ad3966a5d6c28f1","infoHashBuffer":{"type":"Buffer","data":[19,95,85,158,136,128,204,28,98,75,48,181,74,211,150,106,93,108,40,241]},"announce":[],"urlList":[]}}