{"title":"Biography Channel: David Copperfield","uid":5723814,"size":365094392,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:143afad3aa998176cfbf342c02e1cd237a19692a&amp;dn=Biography+Channel%3A+David+Copperfield&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"phatwarez","files":3,"time":1280389245,"description":"Biography: David Copperfield\n\nDavid was interested in magic and performance from a young age, when his grandfather first taught him a card trick. His first show was in his home town when he was just 12-years-old. His skills as a magician developed quickly, at age 16 he was already teaching a magic course at New York University.\n\nHe performed in theatres and on television throughout the 1970s and, in 1978, he was given his own show, 'The Magic of David Copperfield', which went on to win a number of American Television Awards. It has also led to David becoming a household name for his seamless displays of magic.\n\nDuring the 1980s, the scale of the illusions increased. One of his most famous tricks was in 1983, when he made the Statue of Liberty vanish. He has also walked through the Great Wall of China and escaped from the Prison of Alcatraz, a trick that no real prisoner ever managed to perform.\n\nHe is reported as the first illusionist to fly without the use of wires.\n\nOn a smaller scale, one of his more recent tricks was to make 13 randomly selected members of the audience of his live shows disappear.\n\nHe has been called the foremost illusionist of our time and, in 2000, was named a living legend by the United States Library of Congress. His universal appeal is demonstrated by the fact that he has appeared on the stamps of four different countries.\n\nHis ability as a businessman, as well as an illusionist, has brought financial rewards; he has been named the thirteenth highest paid entertainer in the world.\n\nFile Size ------- 348mb\nLength ---------- 41:47\nResolution ------ 720x480\nContainer ------- avi\nVideo Codec ----- h264\nAudio Codec ----- mp3\nFrame Rate ------ 24\n\np h a t w a r e z . t k","torrent":{"xt":"urn:btih:143afad3aa998176cfbf342c02e1cd237a19692a","amp;dn":"Biography+Channel%3A+David+Copperfield","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"143afad3aa998176cfbf342c02e1cd237a19692a","infoHashBuffer":{"type":"Buffer","data":[20,58,250,211,170,153,129,118,207,191,52,44,2,225,205,35,122,25,105,42]},"announce":[],"urlList":[]}}