{"title":"Digital Grampa 2000 - Dreams In Dial-Up: Data-Rot","uid":5739545,"size":49350282,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:14be82866fc8978159f687e2eafb1ef081ca6406&amp;dn=Digital+Grampa+2000+-+Dreams+In+Dial-Up%3A+Data-Rot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DigitalGrampa","files":17,"time":1280950867,"description":"This is my second album in the Dreams In Dial-Up series, and I feel it to be my most diverse release yet. As with my first DIDU, the album tracklisting follows the chronological order of the composition - that is to say, track 01 is the oldest song of the set. The idea being the ability to actively listen to my growth as an artist. This EP languished in the studio for just over a year, due to both emotional, financial, and technical problems. In that year, I went through a break-up, a six-month period living out of my van, getting back with my ex reluctantly, falling in love with her after a year of dating her, and building my life back up. There is a slow decay into darker territory in the middle tracks of the album, but by the last tracks I found my taste switching to almost a full-genre change-over.\n\nAs with all of my releases, a genre is impossible to really nail. At the heart of my music, there remains the spirit of old-school industrial - but my tracks often delve into noise; and there are more than a few sporatic instances of hip-hop (or at least my take on the genre) throughout this release.\n\nI am very proud of this album, and I am happy to share it with the world. Two words of caution though, turn your speakers down the first time you listen; and don\\\\\\\\\\\\\\'t listen while operating a vehicle.\n\nChange.\n\nDG2K","torrent":{"xt":"urn:btih:14be82866fc8978159f687e2eafb1ef081ca6406","amp;dn":"Digital+Grampa+2000+-+Dreams+In+Dial-Up%3A+Data-Rot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14be82866fc8978159f687e2eafb1ef081ca6406","infoHashBuffer":{"type":"Buffer","data":[20,190,130,134,111,200,151,129,89,246,135,226,234,251,30,240,129,202,100,6]},"announce":[],"urlList":[]}}