{"title":"My First Greek CD","uid":5839625,"size":148443713,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:14fd7abad6cbae7909687dde411e8b8942d2bc10&amp;dn=My+First+Greek+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"taxar","files":-1,"time":1284888761,"description":"INTERACTIVE MULTIMEDIA CD-ROM (GREEK AND ENGLISH)\nCreator: Tassos Anthoulias\n\nThis CD-ROM is suitable for children 4 to 8 years old. It contains analytical instructions to the parents for each part of it. The disk contains five programme packages:\n\n1. First Reading. This package consists of four programmes: Words, Phrases, Sentences and My First Book. It combines drawings, animation and sounds interacted with the child. It aims to help the child with his first attempts at reading.\n\n2. My First Steps in Mathematics. Eighteen types of exercises covering preschool and early primary school Mathematics using numbers up to 20 and the operations addition and subtraction. Most of the exercises are in the form of games with unexpected situations and a lot of humour.\n\n3. Greek Grammar. This package includes all the basic material contained in the Modern Greek Grammar: Declension of Nouns (masculine, feminine and neuter), Declension and Comparative forms of Adjectives, Tenses of Verbs (active and passive voice).\n\n4. Greek Alphabet. This package has been specially designed to aid with the recognition of Greek letters and phonemes by children who live in an English-speaking environment. It contains four kinds of exercises which provide practice in the Greek alphabet.\n\n5. Greek-English and English-Greek Dictionary. It contains a rich vocabulary suitable for children of this age.\n\nThe texts are in both Greek and English so that they can be understood by children living in an English-speaking environment, whilst at the same time giving them the opportunity to learn the Greek language. In contrast, children living in a Greek-speaking environment will come into contact with the English language for the first time, without feeling that they are having to undergo a formal lesson.\n\nFor full documentation in Greek look at:\n &lt;a href=&quot;\nhttp://www.helidoni.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.helidoni.info&lt;/a&gt; \n\nFor other torrents look at:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/taxar&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/taxar&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:14fd7abad6cbae7909687dde411e8b8942d2bc10","amp;dn":"My+First+Greek+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14fd7abad6cbae7909687dde411e8b8942d2bc10","infoHashBuffer":{"type":"Buffer","data":[20,253,122,186,214,203,174,121,9,104,125,222,65,30,139,137,66,210,188,16]},"announce":[],"urlList":[]}}