{"title":"Dave Edmunds - Slipping Away  (2nafish)","uid":5742624,"size":147972100,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:15f1ac06f59cd89a0472e78352f075bba29f252a&amp;dn=Dave+Edmunds+-+Slipping+Away++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1281088848,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nInformation is a 1983 album by Welsh rock musician Dave Edmunds. The album was his second release for Arista Records (in the UK) and Columbia Records (in the US).\n\nInformation marked the first time in Edmunds' solo career that he collaborated with an outside producer. Electric Light Orchestra frontman Jeff Lynne produced two songs on the album: the title track, and the Lynne-penned &quot;Slipping Away&quot;. The latter would become Edmunds' first American top-40 hit in 13 years (and his last top-40 hit to date), reaching #39 on the Billboard Hot 100. The album itself reached #51 on the Billboard 200 and #92 in the UK.\n\nOther notable cover versions on the album include NRBQ's &quot;I Want You Bad&quot; and The J. Geils Band's &quot;Wait&quot;.\n\nDavid 'Dave' Edmunds (born 15 April 1944, Cardiff, Glamorgan, South Wales) is a Welsh singer, guitarist and record producer. Although he is primarily associated with Pub rock and New Wave, and had numerous hits in the 1970s and early 1980s, his natural leaning has always been towards 1950s style rock and roll.\n\nOn his 1983 release, Information, Edmunds collaborated on two songs with Jeff Lynne, the leader of Electric Light Orchestra. One of these songs, a Lynne composition, &quot;Slipping Away&quot;, became Edmunds's only other U.S. Top 40  hit, albeit just barely, spending a single week at #39 while having a video clip in heavy rotation on MTV. It was not a hit in the UK. In 1984, Lynne produced six tracks on Edmunds's following album, Riff Raff.\n\nIn 1986, Dave Edmunds participated in Carl Perkins's Rockabilly Session television special to pay tribute to his hero. Other musicians involved in the project include George Harrison, Ringo Starr, and Eric Clapton.\n\nOn New Year's Eve 2008 he appeared on Jools Holland's annual Hootenanny, performing &quot;Girls Talk&quot; and &quot;I Hear You Knocking&quot;. He was Holland's guest again at Borde Hill Garden on 20 June 2009, on 28 August at open air concert at Carrickfergus Castle., 31 October at Ipswich Regent, 7 November at Stoke Victoria Hall and 14 November at Nottingham Concert Hall. Edmunds also played a five song set, including &quot;I Hear You Knocking,&quot; &quot;I Knew the Bride&quot; and &quot;Sabre Dance&quot; with the Holland Big Band at the Royal Albert Hall on 27 November 2009.\n\nHe returned and performed Sabre Dance on Hootenanny on the 2009/10 edition.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:15f1ac06f59cd89a0472e78352f075bba29f252a","amp;dn":"Dave+Edmunds+-+Slipping+Away++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f1ac06f59cd89a0472e78352f075bba29f252a","infoHashBuffer":{"type":"Buffer","data":[21,241,172,6,245,156,216,154,4,114,231,131,82,240,117,187,162,159,37,42]},"announce":[],"urlList":[]}}