{"title":"Natasha Bedingfield - Strip Me (Xvid-2nafish) 1080p","uid":5935848,"size":137052246,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:16a1d483830362c50dd3027b7034f391879e550c&amp;dn=Natasha+Bedingfield+-+Strip+Me+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1288945660,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:28\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 4946 Kbps\nQuality Factor : 0.10 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Strip Me&quot; is a song performed by British singer-songwriter Natasha Bedingfield. The song is the title track and second single from her upcoming studio album and was written and produced by Ryan Tedder. The song was sent to U.S. radio on August 31 and later into online music stores on September 21. The single debuted at number 95 on the Billboard Hot 100, on the week of November 6, 2010.\n\nAccording to Natasha herself, through her twitter account, she went back to her hometown London to shoot the video for the song with photographer and director Kathie Rankin. The music video premiered November 3, 2010, It features natasha in many outfits, The video starts with a black figure of Natasha singing the song. She performs the verse while in many different outfits The chorus shows her in a shiny fur and leather outfit, the next verse off-screen charecters doing her makeup in black and white patterns, In the bridge Natasha is in a lace dress,when it goes to the chorus it flashes to color and paint and mud flys through while Natasha is singing. She fades to black as the video ends.\n\nThe song is featured on the trailer of the 2010 film: Morning Glory, starring Rachel McAdams, Harrison Ford and Diane Keaton. According to All Access, Natasha's new single moved to #79 on the iTunes Top Songs Chart selling 7,000 copies just four days after the song was featured on the trailer for the film &quot;Morning Glory.&quot;\n\nStrip Me is the upcoming third studio album by singer/songwriter Natasha Bedingfield, though it is her fourth studio album overall. The album is due for release on December 7, 2010. Bedingfield recorded the album in Los Angeles, America from 2008 through to 2010.\n\nThe first single taken from the album was 'Touch', which was released on May 18, 2010. Bedingfield confirmed that the song was just a &quot;buzz single&quot;, and that the official first single would be released later in the year. A video was released for the single in August, 2010. The title track, 'Strip Me' was announced to be the first official single, following the &quot;buzz single&quot; 'Touch', and was released on September 21, 2010, with the video being released on November 4, 2010.\n\nNatasha Anne Bedingfield (born 26 November 1981) is an English pop singer and songwriter.\n\nBased in Book St., London, Bedingfield debuted in the 1990s as a member of the Christian dance/electronic group The DNA Algorithm with her siblings Daniel Bedingfield and Nikola Rachelle. Throughout the 1990s and early 2000s, Bedingfield recorded rock and gospel songs for the Hillsong London Church, while Daniel went on to enjoy success with hits &quot;Gotta Get Thru This&quot; and &quot;If You're Not The One&quot;.\n\nBedingfield recorded her first album Unwritten in 2004. The album contained primarily uptempo pop songs and was influenced by R&amp;B music; it enjoyed international success with over 2.3 million copies sold worldwide. In 2007, she received a Grammy Award nomination for &quot;Best Female Pop Vocal Performance&quot; for the song &quot;Unwritten&quot;. Bedingfield's second album N.B. (2007) yielded the singles &quot;I Wanna Have Your Babies&quot;, &quot;Soulmate&quot;. Bedingfield has achieved five top ten singles in the United Kingdom and, as of April 2008[update], she has sold over 2 million albums worldwide.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:16a1d483830362c50dd3027b7034f391879e550c","amp;dn":"Natasha+Bedingfield+-+Strip+Me+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16a1d483830362c50dd3027b7034f391879e550c","infoHashBuffer":{"type":"Buffer","data":[22,161,212,131,131,3,98,197,13,211,2,123,112,52,243,145,135,158,85,12]},"announce":[],"urlList":[]}}