{"title":"Castle.S03E02-03-04.HDTV.XviD (nlsubs) Nairo","uid":5899258,"size":1100947456,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:16fef885a9f64bacd9c03f8c0e2b2f2517482d7f&amp;dn=Castle.S03E02-03-04.HDTV.XviD+%28nlsubs%29+Nairo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NairoNL","files":3,"time":1287621831,"description":"Castle Seizoen 3 Aflevering 2: &quot;He's Dead, She's Dead&quot;\n\nWanneer een beroemde paragnost is vermoord, Gaan Beckett en Castle op zoek naar haar moordenaar, terwijl er ook een pittige discussie aan de gang is over het bestaan van buitenzintuiglijke vermogens. Bewijs wijst naar beide kanten, vooral wanneer er een brief van het slachtoffer, geschreven op de dag dat ze werd vermoord opduikt waarin haar dood staat voorspeld - of was het geschreven door een slimme moordenaar, in de hoop af te werpen van het onderzoek?\n\nCastle Seizoen 3 Aflevering 3: &quot;Under the Gun&quot;\n\nWanneer een gecodeerd document verborgen door een vermoorde borgtocht lijfeijgen Castle's verbeelding op hol doet slaan, moet Beckett de zaak naar de gewelddadige misdadigers sturen. Complicerende zaken is de verrassende komst van de ex-partner van Beckett (nu een premiejager). Als de twee herenigen over een geschiedenis waarin Castle geen inbreng heeft, wordt Castle gedwongen te kijken hoe de relatie een bocht neemt naar het romantische.\n\nCastle Seizoen 3 Aflevering 4 : &quot;Punked&quot;\n\nCastle en Beckett onderzoeken de moord op een jonge wiskundige neergeschoten met een 200-jaar oude kogel, schieten er wilde theorieÃƒÂ«n door Castle over een tijd-reizende moordenaar. Wanneer hun onderzoek een gepimpte DeLorean en een verdachte in Victoriaanse kleding onthult is het gekke idee van Castle ineens zo gek niet. Dit  verhaal kronkelt door de torens van Wall Street en in de wereld van een geheim steampunk samenleving die de romantiek en de eenvoud van het verleden omvat, gekoppeld met de hoop en de beloftes van de toekomst.","torrent":{"xt":"urn:btih:16fef885a9f64bacd9c03f8c0e2b2f2517482d7f","amp;dn":"Castle.S03E02-03-04.HDTV.XviD+%28nlsubs%29+Nairo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16fef885a9f64bacd9c03f8c0e2b2f2517482d7f","infoHashBuffer":{"type":"Buffer","data":[22,254,248,133,169,246,75,172,217,192,63,140,14,43,47,37,23,72,45,127]},"announce":[],"urlList":[]}}