{"title":"Nanci Griffith...Hearts in Mind(2004)[FLAC]","uid":5884344,"size":304261488,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17e8839aff0ac02b77bd3ccb17d7e41042ea697a&amp;dn=Nanci+Griffith...Hearts+in+Mind%282004%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":21,"time":1287008665,"description":"2004 Hearts in Mind   CD  New Door 986 443-9 \n\n1 Simple Life  3:05 \n2 Angels  4:33 \n3 Heart of Indochine  3:47 \n4 Beautiful  4:09 \n5 Back When Ted Loved Sylvia  4:15 \n6 Mountain of Sorrow  3:49 \n7 Old Hanoi  3:39 \n8 Before  2:43 \n9 I Love This Town  3:21 \n10 Rise to the Occasion  3:17 \n11 Love Conquers All  2:50 \n12 Last Train Home  3:05 \n13 Big Blue Ball of War  4:03 \n\nNanci Griffith is one of life's observers, an archivist of memories. Along with Emmylou Harris and Steve Earle she maintains her position as one of the most important voices in Americana; an impassioned songwriter unafraid to tackle difficult subjects head on.\n\nIn Hearts In Mind, her 15th studio album, we see her both as a child, watching wide-eyed as her beloved stepfather plays the piano, and as a worldly woman striding through streets of Hanoi, angry at those in power who have learned nothing from a century's worth of war.\n\nOnce married to a Vietnam veteran, Nanci has repeatedly addressed the conflict in her music, most eloquently on her last album, 2002's Clock Without Hands. It's no surprise, then, to find her revisiting the subject twice on this album, with &quot;Hearts Of Indochine&quot; and the gentle &quot;Old Hanoi&quot;. Comparing herself to Graham Greene in his Vietnam novel The Quiet American, Griffith depicts a country shrugging off its war-torn image to become a place of peace and progress. She finds herself searching these sacred streets for old Hanoi, like a mother struggling to come to terms with her child gaining independence.\n\nThe 9/11-inspired &quot;Mountain Of Sorrow&quot; brings things up to date. Julie Gold - Griffith's friend and writer of her most celebrated hit, &quot;From A Distance&quot; -explains in the sleevenotes how she watched the collapse of the World Trade Centre from her New York flat and was so traumatised by the experience that she couldn't compose for two years. A call from Griffith spurred her into action and this cathartic song about dealing with loss is the result.\n\nResolutely optimistic, Griffith always looks closer to home to restore her faith in human nature. &quot;Beautiful&quot; details her love for her stepfather and the happy family unit at which he was the centre, and bright opening track &quot;A Simple Life&quot; shows a yearning to return to the more straightforward life her mother led.\n\nBut, sensitive soul that she is, the chirpy Texan always manages to over-egg the treacle pudding somewhere on her albums. Here it's through the syrupy orchestration of &quot;Rise To The Occasion&quot;, written by Ron Davies as a wedding present to Griffith's Blue Orchestra band members Pat McInerny and Le Ann Etheridge.\n\nIt's not all worthy and serious, however; the mood is lifted by guest Jimmy Buffett on the tongue-in-cheek &quot;I Love This Town&quot; and by the cracking &quot;Last Train Home&quot;, which is all dusty Texas honky tonks and broken hearts.\n\nThese are finely drawn accounts of love and war, and it's Griffith's eternal optimism which shines through above all else.\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:17e8839aff0ac02b77bd3ccb17d7e41042ea697a","amp;dn":"Nanci+Griffith...Hearts+in+Mind%282004%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17e8839aff0ac02b77bd3ccb17d7e41042ea697a","infoHashBuffer":{"type":"Buffer","data":[23,232,131,154,255,10,192,43,119,189,60,203,23,215,228,16,66,234,105,122]},"announce":[],"urlList":[]}}