{"title":"STARGATE.SG-1.S08E18-20.SWESUB. -Lindoff.ISO","uid":5854210,"size":4466900992,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1a191ca6bcd972e609f598c9da51c6181bf9f38b&amp;dn=STARGATE.SG-1.S08E18-20.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1285535848,"description":"Season 8, Episode 18: Threads\n\nDaniel encounters Oma in a strange celestial coffee shop for ascended beings, and \n\ntheir conversation may be the only way to save the galaxy from Anubus' plan to \n\nunleash the weapon on Dakara. Meanwhile Teal'c and Master Bra'tac lead Jaffa \n\nforces on a more traditional attack. Sam must come to terms with Selmak/Jacob \n\ngrowing ill and Pete pressuring her to commit to the relationship.\n\t\n\n\nSeason 8, Episode 19: Moebius: Part 1\n\nWith the threats of both the Replicators and the Goa'uld greatly diminished and \n\nthe sister ship to the Prometheus, the Deadalus, now under construction, SG-1 is \n\nanxious to get a ride on the new ship. However, the mood is somewhat darkened by a \n\nphone call informing Dr. Jackson of Catherine Langford's death. After the funeral, \n\nCatherine's niece gives Daniel &quot;a few odds and ends&quot; that her aunt wanted him to \n\nhave. Upon delivery it is discovered that almost her entire collection was shipped \n\nto Daniel's lab. He finds in one of her books a possible location of a ZPM, but \n\nscans of the area showed that it was no longer there. Daniel proposes that they \n\nuse the Ancient time machine to take it from Ra at Giza in 3000 BC.\n\t\n\n\nSeason 8, Episode 20: Moebius: Part 2\n\nSG-1 has changed the course of history and made SGC virtually non-existent. \n\nDoctors Carter and Jackson have helped Brigadier General Hammond to find the \n\nAntarctic Stargate, but are not being allowed to help any further. They help Jack \n\nto power up the time machine, and he gets Hammond to allow them on the mission to \n\nfind Teal'c.","torrent":{"xt":"urn:btih:1a191ca6bcd972e609f598c9da51c6181bf9f38b","amp;dn":"STARGATE.SG-1.S08E18-20.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a191ca6bcd972e609f598c9da51c6181bf9f38b","infoHashBuffer":{"type":"Buffer","data":[26,25,28,166,188,217,114,230,9,245,152,201,218,81,198,24,27,249,243,139]},"announce":[],"urlList":[]}}