{"title":"Autosport Magazine UK 30/09/2010","uid":5872696,"size":83214283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1aab05fb6bcc60548800a47f8a4f8775929e563c&amp;dn=Autosport+Magazine+UK+30%2F09%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1286513274,"description":"NEWS\n10 Ferrari: Alonso has edge. Scuderia confident Spanish star has psychological edge\n12 Rights row for Lotus. Revived F1 team faces name row ahead of 2011 season\n14 Heidfeld decries Merc. Team won't win next year, says former reserve driver\n18 Ben Collins joins BTCC. 'The Stig' to race third Motorbase BMW at Brands\n20 Toyota eyes GT effort. Japanese giant may use GT route for Le Mans return\n23 Bowyer's appeal fear. NASCAR winner worried over appeal success\n25 Brits key to Indy moves. Wheldon and Wilson at the centre of 2011 transfer talk\n26 Loeb defuses Ogier threat. No problem with fellow French Citroen team-mate, insists WRC legend\n\nREPORTS\n28 Singapore Grand Prix. Alonso back in title fight after second straight victory\n40 Brit F3 Brands Hatch. Fortec misses out on hat-trick in wet season finale\n43 British F3 supports. Ashburn wins British GT title; Pye secures Brit FFord crown\n46 World of Sport. Intercontinental Rally Challenge; British Rally Championship; NASCAR; Auto GP; Italian F3\n\nFEATURES\n53 Introducing. Formula BMW Europe champion Robin Frijns\n54 Spain's newest track. Can Navarra mix it with 13 other national venues?\n56 GP3 season review. The full story behind Esteban Gutierrez's title win in the inaugural series\n\nSPORTS EXTRA\n73 Award finalists revealed. Six McLaren AUTOSPORT BRDC Award hopefuls chosen\n74 Butcher for FFestival. Rory Butcher to spearhead Geva FFestival attack\n78 Reports. Spa 6 Hours Roadbook; Donington Park BARC; Oulton Park BARC; Croft DDMC;\nLoton Park British Hillclimb; Anglesey BRSCC; Kirkistown 500MRCI; Snetterton BARC\n\nREGULARS\n93 Photo finish. Ralf Schumacher, Belgian Grand Prix 1998\n94 Race of my life. Peter Sauber, South African Grand Prix, Kyalami 1993\n\nOCRd by PDF Converter Professional 7. Cover has links to main stories.\n\nI guess you guys were getting worried that this source had dried up! I've just been rather busy, to be honest. I've also been trying out different ways of OCRing the PDFs to make them searchable (quite important if you have a large collection and can't remember which issue had a certain article). I had been using Acrobat 9.3.4 which is pretty poor (worse than 8.2 which I had been using before 'upgrading'). So I tried ABBYY FineReader 10, ABBYY PDF Transformer 3, Nuance Omnipage Professional 17 and Nuance PDF Converter Professional 7. There is no doubt that the ABBYY products did the best OCR - they were really impressive. But I could not stop them converting the vector shapes to bitmaps. So I ended up using PDF Converter Professional 7 whose OCR was nearly as good as the ABBYY products but could be configured to leave all the images alone. The only irritation is that if you try and select the text, you have to point a little below the actual text. This doesn't make any difference to searching the issue, of course (either in Acrobat or using one of the desktop search tools like dtSearch Desktop). You may be interested to know that all the text in the magazine is converted to vector shapes before they create the PDF (so that you can't search for text or copy the text out of the PDF!). The result is that the text still looks lovely (try magnifying a page to 800% to see what I mean) - hence my reluctance to use an OCR tool that converted them to blocky bitmaps. Is anyone interested in me running PDF Converter Pro on previous issues of Autosport and uploading them?","torrent":{"xt":"urn:btih:1aab05fb6bcc60548800a47f8a4f8775929e563c","amp;dn":"Autosport+Magazine+UK+30%2F09%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aab05fb6bcc60548800a47f8a4f8775929e563c","infoHashBuffer":{"type":"Buffer","data":[26,171,5,251,107,204,96,84,136,0,164,127,138,79,135,117,146,158,86,60]},"announce":[],"urlList":[]}}