{"title":"Judas Priest - Freewheel Burning (2nafish)","uid":5905189,"size":169207812,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1b3dc2f0111fc3e386598cac51e37ecaaf79c52c&amp;dn=Judas+Priest+-+Freewheel+Burning+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1287831425,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Freewheel Burning&quot; is a song by the British heavy metal band Judas Priest, appearing on their 1984 album Defenders of the Faith, and first released as the first single off that album. The EP version of the song contained an extended guitar intro that was omitted on the full length release. In 2002, New World Disorder 3: Freewheel Burning, a mountain bike video released by Freeride Entertainment, licensed the song for use. The song was also covered on Fozzy's album, Happenstance, and Gran Turismo 4 SoundTrack.\n\nThe guitar solo in the song is played by Glenn Tipton and K.K. Downing.\n\nThe music video contains footage of the band playing while a young boy is playing the arcade version of Pole Position.\n\nDefenders of the Faith is the 9th studio album by British heavy metal band Judas Priest. The album was recorded at Ibiza Sound Studios, Ibiza, Spain and mixed from September to November 1983 at DB Recording Studios and Bayshore Recording Studios in Miami, Florida. The LP &amp; cassette tape were released on January 4, 1984 and later appeared on CD in July. A re-mastered CD was released in May 2001. Three tracks were released as singles, &quot;Freewheel Burning&quot;, &quot;Some Heads Are Gonna Roll&quot; and &quot;Love Bites&quot;.\n\n    &quot;Rising from darkness where Hell hath no mercy and the screams for vengeance echo on forever. Only those who keep the faith shall escape the wrath of the Metallian... Master of all metal.&quot;\n\nThe cover art by Doug Johnson (who also designed the Hellion in Screaming for Vengeance) depicts the Metallian, a ram-horned, tiger-like land assault creature with Gatling guns and tank tracks conceptualized by the band.\n\n&quot;Eat Me Alive&quot; was listed at #3 on the Parents Music Resource Center's &quot;Filthy Fifteen,&quot; a list of 15 songs the organization found most objectionable. PMRC co-founder Tipper Gore stated the song was about oral sex at gunpoint. In response to the allegations, Priest recorded the song &quot;Parental Guidance&quot; on the follow-up album Turbo. Defenders of the Faith is a guitar-related section in Guitar World Magazine in which Guitar World readers are shown along with personal information. This is referred to as &quot;Defending the Faith.&quot;\n\nOn the tour for this album, the band had played every song live, with the exception of &quot;Eat Me Alive&quot;. On the tour for the Nostradamus album, in 2008, the band played many songs which had never been played live before, one of them being &quot;Eat Me Alive&quot;. This made Defenders of the Faith the only Judas Priest album from which every song had been played live (other than the first LP Rocka Rolla), until the 2009 tour where British Steel was performed in full, in order.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1b3dc2f0111fc3e386598cac51e37ecaaf79c52c","amp;dn":"Judas+Priest+-+Freewheel+Burning+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b3dc2f0111fc3e386598cac51e37ecaaf79c52c","infoHashBuffer":{"type":"Buffer","data":[27,61,194,240,17,31,195,227,134,89,140,172,81,227,126,202,175,121,197,44]},"announce":[],"urlList":[]}}