{"title":"South Park Season One Commentary","uid":5916129,"size":324329324,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1b455a4020b3e609a134b898e22ddafef7e71302&amp;dn=South+Park+Season+One+Commentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"yoho.yoho","files":-1,"time":1288234701,"description":"Warner dumped all of the Trey Parker and Matt Stone audio commentaries off of the episodes on their South Park: The Complete First Season DVDs. But Comedy Central.com is offering all of the commentaries on a multi-disc CD set as a bonus if you buy the DVDs through their website. Sez Matt Stone of the commentary:\n\n&quot;Warner Brothers would not release it on the DVD without editing some of its content for &quot;standards&quot; issues. Trey and I simply love the sounds of our own voices to let this happen. We also believe in a little thing called the First Amendment. After you hear it you may wonder &quot;What was the big deal about it anyway?&quot; Good question. And one better directed at Warner Brothers than at a TV screen. So let them know what you think. Trey and I did. And enjoy our first ever sober audio commentary.&quot;\n\nNote that you can also get the bonus commentary CDs by sending in your proof of purchase with a small shipping and handling fee to Comedy Central, and they'll mail you the CDs. You can visit Trey and Matt's South Park Studios for the address information soon.","torrent":{"xt":"urn:btih:1b455a4020b3e609a134b898e22ddafef7e71302","amp;dn":"South+Park+Season+One+Commentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b455a4020b3e609a134b898e22ddafef7e71302","infoHashBuffer":{"type":"Buffer","data":[27,69,90,64,32,179,230,9,161,52,184,152,226,45,218,254,247,231,19,2]},"announce":[],"urlList":[]}}