{"title":"Army Of Freshmen - Get Um Up (2nafish)","uid":5913700,"size":98557956,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1b4d2e81d5646436188bb59605fe15ad6e89ee73&amp;dn=Army+Of+Freshmen+-+Get+Um+Up+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1288150200,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nArmy of Freshmen is an independent 6 piece rock band based out of Ventura, California that has played over 1,000 shows in 43 states and 11 countries and are widely known as the co-founders of the annual Get Happy Tour, along with Bowling for Soup.\n\nThe band entered the studio to record their second album, Beg, Borrow, Steal in late 2003. It was produced by Angus Cooke and was released on the label 33rd Street Records, which was owned by the now-defunct music store chain Tower Records. The album featured the single &quot;Get Um Up,&quot; which was added to over 20 alternative radio stations and spent 5 weeks in the top 20 on the U.S. Alternative radio specialty charts.\n\nFollowing the release of Beg, Borrow, Steal in 2004, the band returned to Japan supporting The Living End, along with a co-headlining show with Sugarcult and Bowling For Soup in Sapporo, Japan where the band's record went to the top 10 in that city.\n\nReturning from Japan, the band embarked on the entire Warped Tour in 2004. During the tour's stop in Toronto, Canada, drummer Mike Rini was asked to leave the band. Mike Milligan, a Chicago-based drummer who had played with AOF on several shows with his previous band, Short Arm Trick, relocated to Ventura and officially replaced Rini in December 2004.\n\nShortly after the Warped Tour, the band toured the United Kingdom for the first time with The Littlest Man Band and Suburban Legends.\n\nImmediately after returning to the United States, the band finished their busiest year yet touring the country again with Lucky Boys Confusion.\n\nIn 2005 the band did a headlining summer tour still in support of Beg, Borrow, Steal and returned to the United Kingdom that fall for a sold out tour opening for Bowling For Soup. In support of the tour, they released an exclusive UK only EP, At the End Of the Day, which was recorded in Texas and produced by Jaret Reddick of Bowling For Soup.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1b4d2e81d5646436188bb59605fe15ad6e89ee73","amp;dn":"Army+Of+Freshmen+-+Get+Um+Up+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b4d2e81d5646436188bb59605fe15ad6e89ee73","infoHashBuffer":{"type":"Buffer","data":[27,77,46,129,213,100,100,54,24,139,181,150,5,254,21,173,110,137,238,115]},"announce":[],"urlList":[]}}