{"title":"Democracy Now - 19 oct 2010","uid":5896204,"size":457035390,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1c3f99462770a41e37921755339588e82ec951aa&amp;dn=Democracy+Now+-+19+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1287505854,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 19, 2010\n\n- Bank of America, GMAC Lift Foreclosure Moratorium\n- Employees at &quot;Foreclosure Mill&quot; Were Bribed to Alter Documents\n- GOP Candidate in Alaska Defends Handcuffing of Reporter\n- GOP-Linked Group Urges Latinos Not to Vote in Nov. Election\n- Sharron Angle to Latino Students: &quot;You Look a Little Asian&quot;\n- Jury Rejects Entrapment Defense and Convicts Newburgh 4\n- Militants Attack Chechen Parliament; At Least Six Dead\n- US Mistakenly Deports Mentally Ill US Citizen to Mexico\n- Obama Admin Seeks Changes to Telecom Surveillance Laws\n- Facebook Admits Major Breach of Privacy\n- French Unions Stage Nationwide General Strike\n- Video Shows Indonesian Soldiers Torturing West Papuans\n\n\nSpecial reports\n\n- Angela Davis on the Prison Abolishment Movement, Frederick Douglass, the 40th Anniversary of Her Arrest and President Obama's First Two Years\n\nFor over four decades, Angela Davis has been one of most influential activists and intellectuals in the United States. An icon of the 1970s black liberation movement, her work around issues of gender, race, class and prisons has influenced critical thought and social movements for years. She is a leading advocate for prison abolition, a position informed by her own experience as a fugitive on the FBI's Top 10 most wanted list 40 years ago. Davis rose to national attention in 1969 when she was fired as a professor from UCLA as a result of her membership in the Communist Party and her leading a campaign to defend three black prisoners at Soledad prison. Today she is university professor and the founder of the group Critical Resistance, a grassroots effort to end the prison industrial complex. This year she edited a new edition of Frederick Douglass' classic work, &quot;Narrative of the Life of Frederick Douglass, an American Slave, Written by Himself.&quot; We spend the hour with Angela Davis and play rare archival footage of Angela.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:1c3f99462770a41e37921755339588e82ec951aa","amp;dn":"Democracy+Now+-+19+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c3f99462770a41e37921755339588e82ec951aa","infoHashBuffer":{"type":"Buffer","data":[28,63,153,70,39,112,164,30,55,146,23,85,51,149,136,232,46,201,81,170]},"announce":[],"urlList":[]}}