{"title":"The Breakfast Club [PORNO][FEATURE]","uid":5892029,"size":1463449600,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1c4dcd7b03d4a5634571a50cd107d6c9e7784bcb&amp;dn=The+Breakfast+Club+%5BPORNO%5D%5BFEATURE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1287304451,"description":"Category \tFeature, HD - Shot In High Def, Plot Based, Couples, Parody / Spoof, Comedy\nDirector \tLee Roy Meyers\nStarring \tSamantha Ryan, Andy San Dimas, Faye Reagan, Syren Sexton, Levi Cash, Tessa Taylor, Breanne Benson, Sonny Hicks, Chad Alva, Brooke Van Buuren\n\nFrom New Sensations, the studio that brought you the hit parodies The Big Lebowski: A XXX Parody &amp; The Office: A XXX Parody, comes a Sexy Spoof of one of the most Awesome movies of all time in THE BREAKFAST CLUB: A XXX PARODY! When five College ...    Full Descriptionstudents are forced to spend their Saturday in detention, they think that it is going to be, like, a total bummer. But instead it turns out to be a total Fuckfest! Watch the school's star athlete putting the winning moves on the Sexy &amp; quirky Loner; then check out the Renegade getting Pretty deep in Pink when he finally hooks up with the Popular Girl; and witness the class Geek popping cherries in his &quot;totally-not-fake&quot; memory of Niagara Falls! Throw in some perky cheerleader group sex with a beautiful Dean that has an insatiable craving for cock, and you've got the sexiest day ever spent in a library since... ever! Teen angst has never been so funny &amp; steamy as it is in THE BREAKFAST CLUB: A XXX PARODY!\n\nThis is the only Chad Alva video. Adult stars also making their debut in this video: Brooke Van Buuren.  ","torrent":{"xt":"urn:btih:1c4dcd7b03d4a5634571a50cd107d6c9e7784bcb","amp;dn":"The+Breakfast+Club+%5BPORNO%5D%5BFEATURE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c4dcd7b03d4a5634571a50cd107d6c9e7784bcb","infoHashBuffer":{"type":"Buffer","data":[28,77,205,123,3,212,165,99,69,113,165,12,209,7,214,201,231,120,75,203]},"announce":[],"urlList":[]}}