{"title":"Devils.Playground[DVDRip][Sub.].avi","uid":5917357,"size":552124820,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1d23303df27dd7afe45a728744595acac1018c68&amp;dn=Devils.Playground%5BDVDRip%5D%5BSub.%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sonyds","files":1,"time":1288274303,"description":"Titulo: Devils Playground\nAÃƒÂ±o: 2010\nCategoria: Terror\nCalidad: DVDRip\nPeso: 527 mb\nIdioma del audio: Ingles Subtitulada Espanol\n\nLa trama nos situa en Londres, en un futuro no muy lejano. Industrias Newgen, una compania lider en productos farmaceuticos, esta tratando de contener un escandalo a los medios de comunicacion despues de que las pruebas de un nuevo farmaco, el RAK-295 (un potenciador del rendimiento legal), hayan resultado un fracaso total, causando severas reacciones alergicas y fisicas a los 30.000 sujetos que estaban probando el nuevo farmaco, excepto en uno de ellos, la joven Angela Mills.\nAngela esta embarazada y es la unica que no ha tenido problemas en las pruebas, el Dr. Brooke, presidente de Newgen, cree que esa mujer podria ser la solucion a este desastre y pide a Cole, el jefe de seguridad, que la encuentre y la traiga para examinarla.\nPero un violento estallido del nuevo farmaco revela que esta tiene unas consecuencias mas catastroficas de lo que podian imaginar, el medicamento altera la fisiologia y las facultades mentales en los sujetos, provocando mejoras en la velocidad y la capacidad muscular haciendolos increiblemente rapidos, agiles y muy feroces, transformandolos en seres locos, furiosos e insensibles al dolor. Por si fuera poco, una simple mordedura puede contagiar los efectos de la droga.\n\nNos vemos por TorrentSpain ","torrent":{"xt":"urn:btih:1d23303df27dd7afe45a728744595acac1018c68","amp;dn":"Devils.Playground%5BDVDRip%5D%5BSub.%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d23303df27dd7afe45a728744595acac1018c68","infoHashBuffer":{"type":"Buffer","data":[29,35,48,61,242,125,215,175,228,90,114,135,68,89,90,202,193,1,140,104]},"announce":[],"urlList":[]}}