{"title":"Prince of Persia Sands of Time eBDRip QEBS 1080p-FASM","uid":5840096,"size":3686927353,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:1e23c10dd48dd2b8047f6c9d4ca7c8bdc9d7e140&amp;dn=Prince+of+Persia+Sands+of+Time+eBDRip+QEBS+1080p-FASM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":-1,"time":1284912369,"description":"Movie name ................: Prince of Persia Sands of Time 2010\nMovie info.................: http://www.imdb.com/title/tt0473075/\nFile Container ............: MP4\nVideo Source ..............: BLURAY MPEG4\nVideo Format ..............: MPEG4 AVC HIGH PROFILE LEVEL 4\nVideo Aspect Ratio ........: 2.35:1\nVideo Attributes ..........: 23.976 fps 1920x800 @ 3459 kbit/s\nVideo Commpresion Technique: Quality Enhancer Bitrate Squeezer 2.2\nVideo quality .............: FASMastic\nVideo colour matrix .......: BT.709-5\nAudio1 Source .............: BluRay - DTS HD core 5.1\nAudio1 Format .............: AAC LC 5.1\nAudio1 Attributes .........: 707 kbit/s\nAudio1 Quality ............: FASMastic\nAudio1 Language ...........: English\nSubtitles .................: Polish (external)\nFile size .................: 3,5GiB\nLenght ....................: 1:55:53\nDXVA Compatible ...........: YES\nFAT32 Compatible ..........: YES\nPS3 Compatible ............: YES\nXBOX360 Compatible ........: YES (read below)\nWWW Streamable ............: YES\nStandalone players ........: Limited to h264 compatible devices only\nSample Video...............: Included\n\nPlot:\nAdopted from the streets of Nasaf by King Sharaman of Persia, young Dastan grows up amongst royalty and quickly earns his place as a mighty warrior and prince. As his brothers Garsiv and Tus plan battle strategies, a spy sends word that the Holy City of Alamut has been supplying weapons to enemies of Persia. Taking matters into his own hands, Tus orders an attack on the sacred city and upon its fall Dastan encounters the beautiful Princess Tamina. When King Sharaman dies under mysterious circumstances shortly after, and Dastan is accused of his murder, he flees with the princess on a harrowing mission to clear his name. Learning from Tamina the true motives behind Alamut's invasion, Dastan must embark on a perilous quest to stop an evil mastermind's plot for ultimate power with a mystical weapon that can control the very fabric of time.\n &lt;a href=&quot;\nhttp://comparescreenshots.slicx.com/images/FASM_QEBS_2.2_3459kbps_3160495278.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://comparescreenshots.slicx.com/images/FASM_QEBS_2.2_3459kbps_3160495278.png&lt;/a&gt; &lt;a href=&quot;\nhttp://comparescreenshots.slicx.com/images/FASM_QEBS_2.2_3459kbps_7843152096.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://comparescreenshots.slicx.com/images/FASM_QEBS_2.2_3459kbps_7843152096.png&lt;/a&gt;\n\nEncoders note: \nHere goes 1080p version of this movie with the high bitrate AAC and incorporated\nforeign speaking parts subtitles.\n\nI have changed the naming of the release to promote the new method of encoding:\nEBDRIP - Enhanced Bluray Disk Rip with quality set to be better than Bluray \nitself(without guarranty we actually did it ;-). If you want to know why we can say that\ntake a look here: &lt;a href=&quot;\nhttp://comparescreenshots.slicx.com/comparison/79579&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://comparescreenshots.slicx.com/comparison/79579&lt;/a&gt;\n\nRegards to all encoders especially Big thanx to Atom, FLAWL3SS and FraMeSToR crew, my friends Filix,\nRok3r, Kempas, Faolanscath and all who likes my work.\n\n1. UNFINISHED/SAMPLE movies HAVE synchro problems. This is the nature of highly\ncompressed content. Also there seems to be a problem with Haali Media\nSplitter. If you are using Media Player Classic, please make sure you have\nenabled INTERNAL FILTER for MP4.\n2. Please COMMENT my work ONLY if you have actually seen it. If you LIKED this\nrelease - tell others about it. If you didnt,  leave a comment saying  why, so I can learn from your opinions and provide you with something better in the future .\n3. I can confirm that XBox360 will play it through WINDOWS media center extender.\nFor more info read this forum http://www.avforums.com/forums/streamers-network-media-players/1107552-what-xbox-360-like-media-extender.html\n4. On the beginning of the scene, the innovators ruled it. They came and show what they were capable of\nand other people were amazed by their achievements. Now it seems the only important thing on the scene\nis speed and contacts. You might be poor creator, but if you have fast connection and contacts you rule.\nIt seems for me that the true heritage of the first scene - innovation is now a part of p2p scene. Why? \nBecause official scene rules does not allow it. Funny eh, but its not my problemm as long as i can show\nyou my achievements. Enjoy...\n5. If you like the movie, show your gratitude to the creators by going to cinema or buying\nBluray/DVD !\n6. These movies can be directly streamed through WWW using Adobe Flash Player\nversion 9 or higher.\n7. The name FASM was derived from assembler efficiency. When you write something\ndirectly in assembler,  it usually runs much faster and has smaller size,\nthan the same thing written in C, Java etc. It also means FAchman SoofMan\n- founders of FASM \n8. FASM Quality Enhancer Bitrate Squeezer is  h264 compression method\noptimized directly for lowbitrate HD contents. It is constantly being improved,  each revision brings quality to a new level. Its efficiency over standard\nx264 encoding is explained by the same reasons as  XVID encodes are better than\nDIVX3.\n9. FASM recommends IMGBURN for burning those files into DVD.\n10.Any subtitles made for different releases, but taken from the same source\n(Bluray Rip) should also work with this release.\n11. FASM 720p releases will concentrate more on size to keep it as low as possible \n(including true HD quality of the video with some minor artifacts) and special STEREO\nsound to allow play these directly on most devices possible (even on newer cellphones.)\n12. FASM 1080p releases will concentrate more on quality, but the size will be low enough and will contain\nAAC5.1 sound. The goal would be to create eBDRip with quality better than Bluray original itself.\n\n","torrent":{"xt":"urn:btih:1e23c10dd48dd2b8047f6c9d4ca7c8bdc9d7e140","amp;dn":"Prince+of+Persia+Sands+of+Time+eBDRip+QEBS+1080p-FASM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e23c10dd48dd2b8047f6c9d4ca7c8bdc9d7e140","infoHashBuffer":{"type":"Buffer","data":[30,35,193,13,212,141,210,184,4,127,108,157,76,167,200,189,201,215,225,64]},"announce":[],"urlList":[]}}