{"title":"The Thief and the Cobbler Scrapbook 1 (Richard Williams Animatio","uid":5700768,"size":2549760717,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1e6cbf8df8fe04d37ede022102b67d35808d8c41&amp;dn=The+Thief+and+the+Cobbler+Scrapbook+1+%28Richard+Williams+Animatio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jkahle1","files":2368,"time":1279496418,"description":"Richard Williams is the legendary, triple Oscar winning animator of Who Framed Roger Rabbit, The Thief and the Cobbler, A Christmas Carol, and Raggedy Ann &amp; Andy - A Musical Adventure.\n\nYou can see his work at \n\nThis scrapbook is a piece of animation history, an archive collecting an incredible amount of rare original artwork, articles and writings, as well as interviews, audio, some video and other surprises from and related to Richard Williams' remarkable career of over 50 years in animation.\n\nBritish based Williams has won 3 Oscars (for Roger Rabbit and A Christmas Carol), 3 British Academy Awards and over 250 other international awards.\n\nHe is also known for his unfinished masterpiece, The Thief and the Cobbler, which was never released as intended but is available unofficially on the internet as &quot;The Thief and the Cobbler: Recobbled Cut,&quot; a restoration of the intended version of the film, on which he spent 23 years.\n\nHis credits include The Return of the Pink Panther, The Pink Panther Strikes Again, What's New Pussycat, Casino Royale, The Charge of the Light Brigade, and hundreds of acclaimed television advertisements.\n\nRichard Williams' current project is a 16-DVD boxed set which brings together his legendary Masterclasses with his best-selling book to create The Animator's Survival Kit - Animated. This has over 350 specially animated examples intercut with his 4 day Masterclass filmed at Blue Sky Studios in New York.\n\nIn the 1990s he gave the Richard Williams' Animation Masterclasses around the world to participants from studios such as Disney, Pixar, ILM, Dreamworks/PDI and Warner Bros followed by the best-selling The Animators Survival Kit (2001).\n\nDuring his more than 50 years in the business Williams has been one of the true innovators and serves as the link between the Golden Age of animation by hand and the new computer animation successes. Perhaps even more important has been his dedication to passing along his knowledge to a new generation of animators so that they in turn can push the medium in new directions.\n\n'Absolute animation genius' - LOS ANGELES TIMES\n\n'Arguably the best animator working in the field today' - HOLLYWOOD REPORTER\n\nVoted by peers as 'The Animator's Animator' - OBSERVER\n\n'The only &quot;genius&quot; genius to come along in animation in years ... probably one of the most respected draftsmen in the world.' - LOS ANGELES TV TIMES\n\nOSCAR: Special Academy Award 1989, Who Framed Roger Rabbit\nOSCAR: Academy Award - Special Effects 1989, Who Framed Roger Rabbit\nOSCAR: Academy Award 1972, A Christmas Carol\nBRITISH ACADEMY AWARD: Special Achievements 1989, Who Framed Roger Rabbit\nEVENING STANDARD SPECIAL AWARD: Distinguished Contribution to British Cinema 1989,\nWho Framed Roger Rabbit\nBRITISH ACADEMY AWARD: 1958, The Little Island\nEMMY AWARD: 1982, Ziggy's Gift\nWINSOR McCAY AWARD: 1984, Distinguished Contribution to the Art of Animation &quot;Annie&quot;\n","torrent":{"xt":"urn:btih:1e6cbf8df8fe04d37ede022102b67d35808d8c41","amp;dn":"The+Thief+and+the+Cobbler+Scrapbook+1+%28Richard+Williams+Animatio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e6cbf8df8fe04d37ede022102b67d35808d8c41","infoHashBuffer":{"type":"Buffer","data":[30,108,191,141,248,254,4,211,126,222,2,33,2,182,125,53,128,141,140,65]},"announce":[],"urlList":[]}}