{"title":"The Rolling Stones - Plundered My Soul (2nafish)","uid":5724282,"size":186740740,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1f6f5f30812b3555c4d1cd977df01e9f1dd039be&amp;dn=The+Rolling+Stones+-+Plundered+My+Soul+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280403751,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Plundered My Soul&quot; is a song by The Rolling Stones featured as a bonus track on the 2010 re-release of their 1972 album Exile on Main St.. It was the first song released by the band from the new recordings, limited-edition copies of the single shelved in independent stores on April 17, 2010, in honor of Record Store Day. The single peaked at #200 in the UK Top 200 Singles chart, at #2 on Billboard's Singles Sales and #42 on Billboard's Rock Songs Airplay.\n\n&quot;Plundered My Soul&quot; is one of ten tracks pulled from the Rolling Stones' archives and re-recorded by the band for release. The track features recordings of several former members of the Rolling Stones. Bill Wyman, who left the band in 1993, performs bass, and Mick Taylor, the former lead guitarist who left in 1974, performs lead guitar. Nicky Hopkins, who died in 1994 and had previously featured on earlier Rolling Stones albums and recordings, is featured on piano. Taylor and Jagger recorded new vocals and guitars in March 2010.\n\nExile on Main St. is the tenth studio album by The Rolling Stones. Released as a double LP in May 1972, it draws on many genres including rock &amp; roll, blues, country and soul and calypso. Exile on Main St.  was initially greeted by reviewers with condemnation or high praise, but it has since become almost universally regarded as a masterpiece.\n\nA remastered version of the album was released in Europe on 17 May 2010 and in the United States on 18 May 2010, featuring 10 new tracks, including &quot;Plundered My Soul&quot;, &quot;Dancing in the Light&quot;, &quot;Following the River&quot; and &quot;Pass the Wine&quot; as well as alternate versions of &quot;Soul Survivor&quot; and &quot;Loving Cup&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1f6f5f30812b3555c4d1cd977df01e9f1dd039be","amp;dn":"The+Rolling+Stones+-+Plundered+My+Soul+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f6f5f30812b3555c4d1cd977df01e9f1dd039be","infoHashBuffer":{"type":"Buffer","data":[31,111,95,48,129,43,53,85,196,209,205,151,125,240,30,159,29,208,57,190]},"announce":[],"urlList":[]}}