{"title":"Teleac Buitenbeentjes - Agressief Gedrag (DVD ISO)NLT-Release","uid":5901823,"size":1526759168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20204a8da27ee54731de612d57ed18c30e1e937a&amp;dn=Teleac+Buitenbeentjes+-+Agressief+Gedrag+%28DVD+ISO%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NLT-Release-Linday","files":-1,"time":1287702665,"description":"\n7% van de kinderen van 8 tot 11 jaar heeft gedragsproblemen. Ongeveer 250.000 jongeren, in de leeftijd van 13 tot 18 jaar, hebben psychische problemen. Veel voorkomende problemen zijn angst- en dwangstoornissen, eetstoornissen (anorexia en bulimia), depressie, agressieve gedragsstoornissen, ADHD, autisme en aanverwante stoornissen.\nPortretten van kinderen en ouders\n\nHet programma Buitenbeentjes geeft informatie over de aard, de oorzaken en de behandeling van zes veelvoorkomende, vaak ernstige psychische aandoeningen bij kinderen en jongeren. Het gaat om portretten van kinderen en ouders die problemen hebben. Samen met de hulpverlening zoeken zij een manier om de situatie hanteerbaar te maken en te houden. Naast informatie over aandoeningen besteden we aandacht aan actueel onderzoek naar de achtergronden van psychiatrische stoornissen. Meer kennis over deze zaken kan leiden tot meer begrip en openheid voor 'buitenbeentjes' en hun ouders.\n\nVaak wordt gedacht dat een agressieve gedragsstoornis alleen ontstaat door een verkeerde opvoeding of een zwak sociaal milieu. Maar uit onderzoek blijkt dat een combinatie van aanleg en omgeving een rol spelen. Ook zijn er aanwijzingen dat kinderen met ernstige gedragsstoornissen vaak een biologische afwijking hebben. De gevolgen van een agressieve gedragsstoornis kunnen onvoorstelbaar ernstig zijn voor de familie of de maatschappij. Hoe kunnen kinderen behandeld worden, zodat zij niet op het verkeerde pad komen?\n\nDanny is 14 jaar en heeft een agressieve gedragsstoornis. Al jong pestte hij andere kinderen en was hij boos en opstandig. Hij deed nooit wat hem werd gevraagd, was dominant en luisterde niet. In eerste instantie is hulp gezocht om Danny te laten leren hoe hij beter contact kon maken met leeftijdsgenootjes. Omdat de situatie thuis steeds moeilijker werd, is hij in een internaat geplaatst.\n\nSubs   : Nederlands Gesproken\nType   : ISO\nGenre : Documentaire\n\n\nUniek hahscode:\n20204A8DA27EE54731DE612D57ED18C30E1E937A\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\n\nBy Linday","torrent":{"xt":"urn:btih:20204a8da27ee54731de612d57ed18c30e1e937a","amp;dn":"Teleac+Buitenbeentjes+-+Agressief+Gedrag+%28DVD+ISO%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20204a8da27ee54731de612d57ed18c30e1e937a","infoHashBuffer":{"type":"Buffer","data":[32,32,74,141,162,126,229,71,49,222,97,45,87,237,24,195,14,30,147,122]},"announce":[],"urlList":[]}}