{"title":"Divina De La Muerte 1x01 DVD DVB Spanish","uid":5917074,"size":366493346,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:20bbd800fbc9bc683ea5e47e074413a3fcad0682&amp;dn=Divina+De+La+Muerte+1x01+DVD+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"acer2010","files":1,"time":1288261659,"description":"Cuando la atractiva pero insÃƒÂ­pida aspirante a modelo Deb tiene un trÃƒÂ¡gico accidente de coche, se encuentra de pronto ante las puertas del Cielo. Fred le dice que es una egocÃƒÂ©ntrica. Indignada, ella trata de persuadirle de que la deje volver a su superficial existencia. Al final, por error, su alma vuelve, pero en otro cuerpo que no es el suyo, si no el de la recientemente asesinada por un tiro de bala Jane Bingum. Ella es una joven abogada de talla grande, brillante y considerada, que cuenta con una fiel asistente, Teri. Jane ha vivido siempre a la sombra de sus compaÃƒÂ±eras, mientras que Deb, como modelo, ha contado siempre con su belleza fÃƒÂ­sica. Ahora, gracias a un giro del destino y a una maniobra divina, Deb tendrÃƒÂ¡ que llegar a un acuerdo consigo misma para poder vivir en el cuerpo de Jane, y trabajar en un cuerpo grande dentro de una gran firma de abogados, en un enfrentamiento entre la belleza y la inteligencia. Las cosas se complicarÃƒÂ¡n aun mÃƒÂ¡s cuando el ex novio de Deb entra a trabajar en su misma firma. Jane deberÃƒÂ¡ aprender a vivir con todas estas contradictorias perspectivas en su camino. ","torrent":{"xt":"urn:btih:20bbd800fbc9bc683ea5e47e074413a3fcad0682","amp;dn":"Divina+De+La+Muerte+1x01+DVD+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20bbd800fbc9bc683ea5e47e074413a3fcad0682","infoHashBuffer":{"type":"Buffer","data":[32,187,216,0,251,201,188,104,62,165,228,126,7,68,19,163,252,173,6,130]},"announce":[],"urlList":[]}}