{"title":"Cracker...Countrysides(2003)[FLAC]","uid":5878610,"size":304532452,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21330f7a964737bf9af27ffee5285c72c683a8bd&amp;dn=Cracker...Countrysides%282003%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":25,"time":1286753331,"description":"2003 Countrysides   CD    COOKCD 261\n\n\n1 Truckload of Art   \n2 Duty Free   \n3 Up Against the Wall Redneck Mothers   \n4 Sinaloa Cowboys   \n5 Family Tradition   \n6 The Bottle Let Me Down   \n7 Reasons to Quit   \n8 Buenas Noches from a Lonely Room   \n9 Ain't Gonna Suck Itself \n\nNow that they're no longer on a major label, Cracker can indulge themselves. For some bands, this could be a problem, but a band as irreverent as Cracker can benefit from a little room to move, since that means they can toss off an album like Countrysides without having to justify why they're doing a collection of sloppy, rowdy country covers, or having to make excuses that it's something more than just a fun record. Because that's what Countrysides is -- a simple collection of eight raucous covers of the band's favorite country tunes, with the rowdy, vulgar anti-Virgin Records story-song &quot;Ain't Gonna Suck Itself&quot; acting as the grand finale. This is honky tonk played by a bunch of drunk wiseasses. Sometimes, the smirk is a little too heavy, but usually the band is having such a good time it's easy to give in and join the festivities. Only Merle Haggard's &quot;The Bottle Let Me Down&quot; and Ray Wylie Hubbard's &quot;Up Against the Wall Redneck Mother&quot; (and possibly Hank Williams, Jr.'s &quot;Family Tradition&quot;) are well-known; the rest are favorite album tracks from outlaws and alt-country singers, and they're all given the same appealingly shambolic treatment. While it's true that this is ultimately just a covers album -- even though &quot;Ain't Gonna Suck Itself&quot; is a really good vindictive joke and one of David Lowery's best recent songs -- it is also true that it's more flat-out fun than anything Cracker has done in nearly ten years. And frankly, that's a welcome change -- if they can keep this spirit on an album of originals, they'd have a hell of a record on their hands. With this, they just have a hell of a good time, and that's more than enough. ~ Stephen Thomas Erlewine, All Music Guide\n\ncd ripped by dBpoweramp\n\nplease seed\n","torrent":{"xt":"urn:btih:21330f7a964737bf9af27ffee5285c72c683a8bd","amp;dn":"Cracker...Countrysides%282003%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21330f7a964737bf9af27ffee5285c72c683a8bd","infoHashBuffer":{"type":"Buffer","data":[33,51,15,122,150,71,55,191,154,242,127,254,229,40,92,114,198,131,168,189]},"announce":[],"urlList":[]}}