{"title":"Megadeth - Trust (2nafish)","uid":5898023,"size":148998148,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:23217ff9991350918af5feee81e926f74fbf7fbc&amp;dn=Megadeth+-+Trust+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1287568458,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Trust&quot; is the first song on Megadeth's seventh studio album Cryptic Writings. It was released on May 8, 1997 in both English and Spanish language versions. The song had significant airplay and MTV rotation and reached #5 on the Billboard Mainstream Rock Tracks chart, making it Megadeth's most successful single to date followed by &quot;Breadline&quot; and &quot;Crush 'Em&quot; from their follow-up album Risk, both of which reached #6 in the same charts. It was later included on the three compilation albums, Capitol Punishment, Back to the Start and Anthology: Set the World Afire, and the box set Warchest.\n\nThe song tells the story of relationships that have failed due to mutual dishonesty.\n\nThe song was nominated for a Grammy award in January 1998 for best heavy metal performance.\n\nA &quot;Spanish&quot; version of the song was used as a bonus track on the Latin American edition of Cryptic Writings and later on the international remaster of the album. However only the chorus is in Spanish. The song is otherwise identical to its album counterpart in verse. Mustaine would record a Spanish version of The World Needs A Hero song Promises a few years later, which also appeared on the Latin American version of its parent album.\n\nAn instrumental version was released for Extreme Championship Wrestling performer Jerry Lynn and was later issued on ECW: Extreme Music compilation.\n\nThe drum intro of the song is currently played right before kickoffs during each home game played by the Arizona State Sun Devils.\n\nCryptic Writings is the seventh studio album by heavy metal band Megadeth, released in June 1997, with a remixed and remastered version released in 2004. The album debuted at #10 on Billboard Top 200. This is the last Megadeth studio album to feature drummer Nick Menza who was the longest lasting drummer until current drummer Shawn Drover joined the band in 2004.\n\nVideos were made for the songs &quot;Trust&quot;, &quot;Almost Honest&quot;, and &quot;A Secret Place&quot;.\n\n&quot;Use the Man&quot; includes samples from the song &quot;Needles and Pins&quot; (which was the original name for the album) by The Searchers, although this was removed on the remaster.\n\nContinuing the trend from Youthanasia, Cryptic Writings features fewer songs critical of government and politics in favor of more personal songs. Megadeth's 1990s hard rock style also continues on this album. Some songs, however, recall the band's 1980s thrash metal era, such as &quot;The Disintegrators&quot;, &quot;She-Wolf&quot;, &quot;Vortex&quot;, and &quot;FFF&quot;. This album is similar in style to Countdown to Extinction and Youthanasia; it is currently still the last Megadeth album to go platinum.\n\nThe first 500,000 copies of Cryptic Writings in the U.S. were released with silver background album cover. These releases also included a Vic Rattlehead collectable card which promoted &quot;The Cryptic Writings Of Megadeth&quot; 4- issue run by CHAOS! comics. The latter U.S. pressings features the same artwork with black background album cover. The black background album cover is also featured in the remasters.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:23217ff9991350918af5feee81e926f74fbf7fbc","amp;dn":"Megadeth+-+Trust+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23217ff9991350918af5feee81e926f74fbf7fbc","infoHashBuffer":{"type":"Buffer","data":[35,33,127,249,153,19,80,145,138,245,254,238,129,233,38,247,79,191,127,188]},"announce":[],"urlList":[]}}