{"title":"Victor Victoria 1982 (Pal to DivX) multisubs - Michael Rizzo","uid":5901450,"size":1038739294,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:23b71715548b80c7e451368323bc5fc83556dcba&amp;dn=Victor+Victoria+1982+%28Pal+to+DivX%29+multisubs+-+Michael+Rizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1287689514,"description":"This version is for those that do not require a PAL subtitled version.\nIf you do require subtitles that are either French, Portuguese or Spanish even\nyou'd still be better off with our other DivX versions that are based on\nthe longer movie lenght NTSC conversion movie files. (Its made from a DVD9\nby the way).\n\n\nOn the other hand, if you require a subtitled version that supports either\nGerman, Swedish, Norwegian, Finnish, Danish, Italian, Dutch, Polish or\neven PAL version French, Spanish or Portuguese, then this is the version for\nyou - OR you might prefer our hard coded (avi-recomp) xvid versions that we\nhave or are posting for each of the languages indicated for the PAL line-up.\n\nAll these languages are included here in SRT subtitle files we extracted \nfrom the DVD using the &quot;subrip&quot; program - It took only a few mnutes for each\nlanguage file and a bit of perseverance I might add - all in a good cause\nfor the larger family of course! (Its my Irish spirit coming though!) \nAn SRT works btter than DivX embedded as some players handle the positioning\ndifferently and this sometimes causes problems with viewing during playback.\n\n\nFor those of you patiently waiting for our full HD version (2GB)\nWe hope soon to be able to purchase an HD version at the store\n(when its available)to make a conversion for you at supreme resolution\nrates for the nice, larger HDTV sets now in use. \n\nThis offering we now bring to you is full 720 X 576\nwide-screen format (same as the DVD5 folder we obtained)\nand with lovely 192k audio too! We even include a souvenir kit of \nthe best songs from the movie in mp3 format along with subtitles\n\nThe moment it is available we expect to have an HD 720p version\nposted for you too!\n\nVictor Victoria is a most favorite of my movies personally in that I find\nit does wonders for the spirit to have Julie Andrews and Robert Preston\nrepartee as they do in situations that certainly do serve as inspiration\nto loftier attempts to articulate with clever wit, and with intelligence\nthat is as I say, in great sprit, certainly!\n\nThe &quot;dinner at the ritz without a wallet&quot; scene is unforgettable and \na &quot;tour de force&quot; around the Hollywood sets when you consider their \nmore recent exploits at the box office, by comparison.\n\nJulie Andrews shows a great spirit in her drive to keep her sensibilities\nintact despite being in what is an impoverished state financially\nat the moment in time.\n\nThe idea that a decent spirit couldn't begrudge this gal a meal even\nif the gesture has to be contrived in this fashion speaks to the sense of \nidealism and optimism of the human spirit that Ms. Andrews is wanting\nus to believe in here, even if its differently manifested to fit whatever\ncircumstances we may apply the principle to.\n\n\nWe ask for your seeding support \nwith thanks! Michael Rizzo Chessman\n","torrent":{"xt":"urn:btih:23b71715548b80c7e451368323bc5fc83556dcba","amp;dn":"Victor+Victoria+1982+%28Pal+to+DivX%29+multisubs+-+Michael+Rizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23b71715548b80c7e451368323bc5fc83556dcba","infoHashBuffer":{"type":"Buffer","data":[35,183,23,21,84,139,128,199,228,81,54,131,35,188,95,200,53,86,220,186]},"announce":[],"urlList":[]}}