{"title":"Coast To Coast Am - 07-27-10 - Economy, Geopolitics, And Off -Th","uid":5724748,"size":55061425,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:24336024b83b4e20fe657f3d0a0c0641845156c7&amp;dn=Coast+To+Coast+Am+-+07-27-10+-+Economy%2C+Geopolitics%2C+And+Off+-Th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bravos2u","files":5,"time":1280421628,"description":"Date:\n 07-27-10\n \nHost:\n George Noory\n \nGuests:\n Nick Rosen, Craig Hulet \n \n\n\nAppearing during the first half of the program, analyst Craig Hulet offered commentary on the economy, and geopolitics. American corporations like GM are now conducting more of their business in places like China, he said, adding that a lot of the bailout money to the banks has also gone overseas for lending. The Wall Street reform bill has no stipulations to regulate the derivatives market, and favors large banks which will continue to buy out smaller banks, he noted. He characterized the current situation as a &quot;mixed economy&quot; in which authority emanates from a central power like the Federal Reserve, keeping the dollar low, and inflation high; yet the amount of actual dollars in circulation are at the lowest level since the Great Depression, and that indicates deflation. \n\nHe foresees a scenario in which Israel attacks Iran, and America gets drawn in. For the US and its allies, Iran has always been the target, but they weren't prepared to dominate them until they physically surrounded them by occupying Iraq and Afghanistan, he suggested. \n\n\nIn the latter half, documentarian and journalist Nick Rosen discussed living off-the-grid, typically in alternative communities. This means living independently of the utility companies, and providing your own power, &quot;but it does not mean living in the Stone Age,&quot; he explained. &quot;It's about being more self reliant, being less dependent on the system, and realizing we have to look after ourselves,&quot; he added. Rosen bought a hut and some land in Spain along the Mediterranean and was able to go off-the-grid using such things as solar panels and rainwater harvesting. His website offers an interactive section called Landbuddy for people to help each other go off-grid in their local regions. \n\nSome 750,000 households in America have gone off-the-grid, and this trend is growing at 10-15% a year, he reported. He traveled to various parts of the country documenting how people and communities were successfully becoming independent. Interestingly, he noted that powerful groups like the Bilderbergers and Trilateral Commission sought to keep the old inefficient energy systems in place, to protect their investments, but the off-the-grid movement serves as an alternative to this kind of centralized power and control. \n\n\nWebsite(s):\n-off-grid.net\n-vivum.net\n-craigbhulet.com\nBook(s):\n-Off the Grid\n-The Hydra of Carnage","torrent":{"xt":"urn:btih:24336024b83b4e20fe657f3d0a0c0641845156c7","amp;dn":"Coast+To+Coast+Am+-+07-27-10+-+Economy%2C+Geopolitics%2C+And+Off+-Th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24336024b83b4e20fe657f3d0a0c0641845156c7","infoHashBuffer":{"type":"Buffer","data":[36,51,96,36,184,59,78,32,254,101,127,61,10,12,6,65,132,81,86,199]},"announce":[],"urlList":[]}}