{"title":"A.Charge.Kept.pdf","uid":5750754,"size":1026020,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:251a9384b9292b4a3eab6f96d38387a5cb74899d&amp;dn=A.Charge.Kept.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1281383360,"description":"A Charge Kept - The Record of the Bush Presidency 2001 - 2009\nby George W. Bush, Marc A. Thiessen\n\nbook data - A Charge Kept: The Record of the Bush Presidency 2001 - 2009 0.00 \navg rating - 0 ratings 0 reviews, details edit \n\npublished - April 1st 2009 by Morgan James Publishing (first published 2009) \n\ndetails - Paperback, 128 pages \nisbn1600375898    (isbn13: 9781600375897) \n\ndescription - &quot;We have served America through one of the most consequential periods of our history...&quot; ~ President George W. Bush, 2006 State of the Union\n\nIndeed, the period of time President Bush served the US very bravely, was the most consequential period of time in the history of the US. 9/11/01 was the Pearl Harbor of the the 21st Century, and on each occasion the consequences that followed both acts of infamy, reverberated across the world. \n\nNotwithstanding all the insults hurled at him, and the character assassination resorted to by the democrats and the &quot;left&quot;, the President bravely focused on &quot;the charge&quot; the Constitution required of him. I saw on TV the events and decisions of the President and how he was maligned, so I was a witness to how bravely he faced those dangerous years. \n\nToday we live in a changed world, in fear and uncertain of the future. The US no longer can be depended on to be a beacon for freedom, and a champion for good and against those groups, individuals, or rogue countries that would do us harm. God help us all. We thank God that President Bush was the sitting president when the attacks occurred on 9/11. That's why I had to read &quot;A Charge Kept&quot; - the truth needs to be told, because &quot;the truth will set us free&quot;","torrent":{"xt":"urn:btih:251a9384b9292b4a3eab6f96d38387a5cb74899d","amp;dn":"A.Charge.Kept.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"251a9384b9292b4a3eab6f96d38387a5cb74899d","infoHashBuffer":{"type":"Buffer","data":[37,26,147,132,185,41,43,74,62,171,111,150,211,131,135,165,203,116,137,157]},"announce":[],"urlList":[]}}