{"title":"Honey West Disc 1","uid":5724062,"size":1604427776,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2560ac3ecb0445a30c1a9d2c4d39fc0c6043dea5&amp;dn=Honey+West+Disc+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"soletar","files":1,"time":1280393986,"description":"As televisions first title roll female Private Eye, Honey West would take on any tough case. After the death of her father, the sexy private detective took over his high-tech PI firm. Being assisted by the rugged Sam Bolt and her pet ocelot Bruce, she could handle herself mingling with millionaires just as well as scaling a thirty foot wall.\n\nAnne Francis, John Ericson, Bruce the Ocelot\n\nDISC ONE: \n\n&quot;The Swingin' Mrs. Jones&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by Paul Wendkos: Honey goes undercover at a fancy singles resort to track down a rich woman's blackmailer. This, the first episode in the series, sets the tone, showcasing Honey West's sleuthing expertise, martial arts skills, and seductive prowess, as well as her professional (yet flirty) relationship with partner Sam Bolt. The episode features Honey's first use of her 2-way radio compact communicator device as well as a tear gas earrings gadget. (25:23 - includes a &quot;Next Week&quot; promo)\n\n&quot;The Owl and The Eye&quot; - written by William Bast, directed by Paul Wendkos: Honey plays cat burglar in order to help safeguard a rare jade owl which winds up stolen. Check out Honey slip up a pack of dogs, in once scene, using a fire extinguisher. (25:26 - includes a &quot;Next Week&quot; promo)\n\n&quot;The Abominable Snowman&quot; - written by Glen Bagni &amp; Paul Dubov, directed by Paul Wendkos: Honey's client is killed in a car crash with only a snow globe and the word &quot;Snowman&quot; as the only clues. This episode marks the first appearance of Honey's car phone (and Honey taking a bubble bath). (25:26 - includes a &quot;Next Week&quot; promo)\n\n&quot;A Matter of Wife and Death&quot; - written by Tony Barret, directed by John Florea: Honey must protect a female executive who has been targeted for assassination. But who is the killer dressed in a frogman diving suit? Watch for Honey's brief catfight sequence. (25:26)\n\n&quot;Live a Little, Kill a Little&quot; - written by Tony Barrett, directed by Murray Golden: Honey is hired to find a missing girl who is running from a murderous boyfriend. (25:28)\n\n&quot;Whatever Lola Wants....&quot; - written by William Bast, directed by John Peyser: Honey is unknowingly hired by a killer to stop an embezzler. Will she be his next victim? This episode features a gas pen gadget. (25:17)\n\n&quot;The Princess and The Paupers&quot; - written by Leonard Stadd, directed by Virgil W. Vogel: The lead singer of a `Beatlesesque music band known as The Paupers, is kidnapped and held for ransom. It's up to Honey to track him down. Actor Michael J. Pollard (Bonnie and Clyde &amp; Tango and Cash) guest stars. Honey looks great in a black bikini. (25:06)\n\n&quot;In The Bag&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by Seymour Robbie: Honey stumbles onto a diamond smuggling scheme when a little girl, in her care, gets her bag switched with the crooks'. Maureen McCormick (TVs Marcia Brady from The Brady Bunch)) guest stars. This episode features a homing beacon pen gadget. (25:27)\n\nExtra Features:\nGlamour Shots Photo Gallery - Includes 18 images of Anne Francis &amp; co-stars from the series. (2:26)\nVintage Commercials - Hunts Steakhouse Catsup, Wesson Cooking Oil, The FBI TV Series, Maybelline Eye makeup (X2), Intensified Tide Laundry Detergent, Wilkinson Sword Ltd. Razor Blades, U.S. Savings Bonds. 8 commercials total. (6:25)\n\nTotal Running Time Approximately 212 Min.","torrent":{"xt":"urn:btih:2560ac3ecb0445a30c1a9d2c4d39fc0c6043dea5","amp;dn":"Honey+West+Disc+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2560ac3ecb0445a30c1a9d2c4d39fc0c6043dea5","infoHashBuffer":{"type":"Buffer","data":[37,96,172,62,203,4,69,163,12,26,157,44,77,57,252,12,96,67,222,165]},"announce":[],"urlList":[]}}