{"title":"city by the sea XviD-dvdrip ( nlsubs) 2002 2lions-team","uid":5746192,"size":738092390,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:260017d8f515b3a5308c2b3d09c51c3546065203&amp;dn=city+by+the+sea+XviD-dvdrip+%28+nlsubs%29+2002+2lions-team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2507mike","files":-1,"time":1281228140,"description":"city by the sea Xvid-dvdrip (dutch subs hardcoded) 2002 2lions-team\n &lt;a href=&quot;\nhttp://www.roland1975.nl/films/images/City%20by%20the%20sea.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.roland1975.nl/films/images/City%20by%20the%20sea.jpg&lt;/a&gt;\n\ngeregisseerd door Michael Caton-Jones\nmet Robert De Niro, Frances McDormand en James Franco\n\nVincent LaMarca is een gerespecteerd politieagent uit Manhattan, die terugkeert naar de buurt waar hij opgroeide - Long Beach in New York - voor het onderzoek naar de moord op de beruchte drugdealer Picasso. LaMarca is echter met stomheid geslagen wanneer hij ontdekt dat de hoofdverdachte in de zaak zijn drugsverslaafde zoon Joey blijkt te zijn. De rechercheur heeft zijn zoon in jaren niet meer gezien of gehoord. Zijn pijnlijke scheiding van Joeys moeder zorgde al die tijd immers voor een onoverbrugbare kloof. Zodra zijn oversten ontdekken dat LaMarca een persoonlijke relatie heeft met de vermoedelijke moordenaar van Picasso, wordt hij van de zaak gehaald. Maar de agent kan niet machteloos toekijken en hij gaat zelf op zoek naar Joey.\n\n******************************************************************************\nVincent LaMarca (Robert De Niro) a veteran street cop and the son of an executed killer. While his father didn't intend to kill the child he kidnapped, the son reaps the reputation anyway and decides to be so good that he is beyond reproach. Meanwhile, his son Joey LeMarca (James Franco), a drug user with fading memories of athletic high school  glory, gets wrapped up in a drug-related killing and with no other choice asks his estranged father for help. After a failed marriage and an estranged son suddenly comes to the attention of Vincent's current girlfriend Michelle (Frances McDormand), asking him why he won't help his son. He has tried so hard to distance himself that he cannot accept any intrusion into his contentment. Then Joey's on again/off again girlfriend Gina (Eliza Dushku) who struggles to stay sober for her and Joey's infant son Angelo, comes into Vincent's life asking him to save Joey, then unable to stay sober, drops off Angelo, leaving the child with Vincent. Joey gets deeper into trouble when the local drug enforcer Spyder (William Forsythe) kills Vincent's cop partner Reg (George Dzundza) who was helping Vincent clear his Joey's name, and the murder is pinned on Joey. In the end Vincent sets aside his self-imposed isolation and helps save his son.\n\ninfo\nvideo:\nFormat                           : AVI\nCodec ID                         : XVID\nDuration                         : 1h 43mn\nDisplay aspect ratio             : 16:9\nWidth                            : 640 pixels\nHeight                           : 352 pixels\n\naudio:\nFormat                           : MPEG Audio\nBit rate                         : 128 Kbps\nChannel(s)                       : 2 channels\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0269095/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0269095/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/2772&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/2772&lt;/a&gt;\n******************************************************************************\n\nBrought to you by\n2Lions Team\n\nmeer DivX zien??\nKom dan eens kijken op ons NIEUWE site\n &lt;a href=&quot;\nhttp://2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://2lions-site.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden.\n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live\n","torrent":{"xt":"urn:btih:260017d8f515b3a5308c2b3d09c51c3546065203","amp;dn":"city+by+the+sea+XviD-dvdrip+%28+nlsubs%29+2002+2lions-team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"260017d8f515b3a5308c2b3d09c51c3546065203","infoHashBuffer":{"type":"Buffer","data":[38,0,23,216,245,21,179,165,48,140,43,61,9,197,28,53,70,6,82,3]},"announce":[],"urlList":[]}}