{"title":"Auburn feat. Iyaz - La La La (2nafish)","uid":5897886,"size":121247748,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:26e6f4ce0ad564ec955b3cd4ac988e3b7c7c8ddf&amp;dn=Auburn+feat.+Iyaz+-+La+La+La+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1287561849,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAuburn Williams, born in 1990 in Minneapolis-Saint Paul, Minnesota is an urban pop singer. Williams released an independent debut album Same Girl in 2007, though it failed to garner success. She signed to Warner Brothers and Beluga Heights  in early 2010 and released her first official single &quot;La La La&quot; in mid-2010. Her mainstream debut album is currently due for release in the fall of 2010.\n\nWilliams first started with the song &quot;Pretty two&quot; Williams failed to garner success with her independent debut album, but she gained the attention of J.R. Rotem with the album. In early 2010, Williams signed to Beluga Heights with distribution from Warner Brothers as the label's first female artist. She subsequently began work on her mainstream debut album.\n\nWilliams' first official single, &quot;La La La&quot;, featuring Iyaz, was released on June 1, 2010. The single samples ATC's &quot;Around the World (La La La La La)&quot; and debuted at number seventy-four on the Billboard Hot 100 in July of 2010. It has since peaked at number fifty-one on the chart. Her mainstream debut album is currently due for a release in the fall of 2010. She will also be the opening act for Jason Derulo's tour in the fall of 2010. Her new single was leaked on October 10, 2010. The single is entitled &quot;Til The Club Goes Down&quot; and samples Jason DeRulo's megahit In My Head.\n\nWilliams was born in 1989 in Minneapolis-Saint Paul, Minnesota. She began singing at a young age but didn't aspire to be a professional singer until 2006. She began using many social networks and digital media to connect with her fans and to gain the attention of labels in 2007. After failing to sign to a label, she released her independent debut album Same Giirl in late 2007, though it failed to chart. It was preceded by a single, &quot;Ewww Ewww&quot;, featuring Chellii-B, which reached number six on the underground hip-hop chart at DJBooth.net.\n\nAuburn also released a single called Perfect Two which was huge on the internet.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:26e6f4ce0ad564ec955b3cd4ac988e3b7c7c8ddf","amp;dn":"Auburn+feat.+Iyaz+-+La+La+La+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26e6f4ce0ad564ec955b3cd4ac988e3b7c7c8ddf","infoHashBuffer":{"type":"Buffer","data":[38,230,244,206,10,213,100,236,149,91,60,212,172,152,142,59,124,124,141,223]},"announce":[],"urlList":[]}}