{"title":"MADAGASCAR BOXSET IN XVID BY WINKER@KIDZCORNER","uid":5688831,"size":1898704165,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2875b085bc8efd4f25a84022de3edd9fa89a0783&amp;dn=MADAGASCAR+BOXSET+IN+XVID+BY+WINKER%40KIDZCORNER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alanwatson","files":4,"time":1278995041,"description":"Madagascar:\n\nAt New York's Central Park Zoo, a lion (Stiller), a zebra (Rock), a giraffe (Schwimmer), and a hippo (Pinkett Smith) are best friends and stars of the show. But when one of the animals goes missing from their cage, the other three break free to look for him, only to find themselves reunited... on a ship en route to Africa. When their vessel is hijacked, however, the friends, who have all been raised in captivity, learn first-hand what life can be like in the wild!\n\nMadagascar: Escape 2 Africa\n\nAll the loveable characters are back - Alex the Lion (Ben Stiller), Marty the Zebra (Chris Rock), Melman the Giraffe (David Schwimmer), Gloria the Hippo (Jada Pinkett Smith), King Julien (Sacha Baron Cohen), Maurice (Cedric the Entertainer) and the Penguins - in Madagascar: Escape 2 Africa.\n\nLeft marooned on the distant shores of Madagascar, the New yorkers have hatched a plan so crazy it might just work! With military precision, the penguins have repaired the old crashed plane - sort of! Once aloft, this unlikely crew stays airborne just enough to make it to the wildest place of all - the vast plains of Africa itself! Can the zoo-raised crew survive in the wilderness?","torrent":{"xt":"urn:btih:2875b085bc8efd4f25a84022de3edd9fa89a0783","amp;dn":"MADAGASCAR+BOXSET+IN+XVID+BY+WINKER%40KIDZCORNER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2875b085bc8efd4f25a84022de3edd9fa89a0783","infoHashBuffer":{"type":"Buffer","data":[40,117,176,133,188,142,253,79,37,168,64,34,222,62,221,159,168,154,7,131]},"announce":[],"urlList":[]}}