{"title":"24 Season 6 dvd 3 van 6(nlsubs)2Lions-Team","uid":5827865,"size":4682713398,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:28a067cdfbe62dfed8e7fbe8a56911c11fe6d717&amp;dn=24+Season+6+dvd+3+van+6%28nlsubs%292Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nobby010","files":-1,"time":1284396763,"description":"24 Season 6\n\nDutch:\nNa 20 maanden in een Chinese gevangenis te hebben vastgezeten, wordt Jack Bauer plotseling teruggebracht naar de Verenigde Staten. Zijn 'vrijlating' maakt deel uit van een geheime deal: zijn leven in ruil voor de verblijfsplaats van Hamri Al-Assad, de leider van een terroristische organisatie die met haar aanslagen het hele land in haar greep houdt. Jack, zowel fysiek als geestelijk een gebroken man, stemt toe met de ruil. Maar als hij erachter komt dat zijn nieuwe gijzelnemer, Abu Fayed, achter de aanslagen zit en dat zijn offer zinloos is, slaat Jack terug en ontsnapt! Het is nu aan hem om de president en CTU ervan te overtuigen dat de man die zij proberen te doden mogelijk de enige man is die een einde kan maken aan het snel escalerende geweld...\n\nEnglish:\nFederal Agent Jack Bauer can't afford to always play by the rules. As a member of the L.A. Counter Terrorist Unit, Jack must stop bombs, viruses, assassination attempts, and usually save someone he cares about at the same time. Every season of this series has 24 episodes, each unfolding in real time following a consecutive hour in one very bad day.\n\nSeason 6: In the sixth season (2007), 20 months have passed since Day 5. After being captured by the Chinese for his involvement in the events of Day 4, Jack Bauer is returned to the United States Government a broken, yet honorable, man. To stop a series of devastating attacks on the US, CTU has agreed to hand Jack over to a terrorist mastermind, Abu Fayed, who is bent on revenge. Jack survives and, after a nuclear attack on American soil, vows to retrieve the remainder of the nuclear weapons used in the day's attacks. The White House, meanwhile, suffers from an internal power struggle between President Wayne Palmer and his Vice President Noah Daniels, forcing Palmer's staff to choose sides, which in turn affect CTU and its employees. After eliminating the day's threats, Jack is forced into a personal crusade to save Audrey Raines from those he fears most, and discovers that his family is more involved with the day's events than he ever imagined... \n\nTagline  : For America to survive, Jack Bauer must die. \nProductiemaatschappij : 20th Century Fox Home Entertainment  \nCast: Kiefer Sutherland, Mary Lynn Rajskub &amp; Gregory Itzin  \n\n=========================================\nDvD Info:\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail DVD9 Pal\nMenu : Yes\nAudio : Eng 5.1 DD\nOndertitels : Dutch/English (Lossless)\nGenre : Actie/Misdaad\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0285331&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0285331&lt;/a&gt;\n\n*****************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*****************************************\n\nBrought to you by \n\nNobby\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons vernieuwde site \n     &lt;a href=&quot;\nhttp://www.2lions.site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.site.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \nDon`t quit after you finished the download, but keep seeding.\n","torrent":{"xt":"urn:btih:28a067cdfbe62dfed8e7fbe8a56911c11fe6d717","amp;dn":"24+Season+6+dvd+3+van+6%28nlsubs%292Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28a067cdfbe62dfed8e7fbe8a56911c11fe6d717","infoHashBuffer":{"type":"Buffer","data":[40,160,103,205,251,230,45,254,216,231,251,232,165,105,17,193,31,230,215,23]},"announce":[],"urlList":[]}}