{"title":"DaniuSoft DVD Creator 1.2.0 Portable","uid":5698125,"size":54685147,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:28cd3284336e3ac8c95874c5e7ed4b0bab8977a4&amp;dn=DaniuSoft+DVD+Creator+1.2.0+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":5,"time":1279387995,"description":"DaniuSoft DVD Creator 1.2.0 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included. This is just the GiveAwayOfTheDay.com program for today. Get it while it lasts. And after it use the Reg.reg file...\n\n\nBurn your precious videos to DVD with amazing DVD menu and share them with your friends and family.\n\nDaniusoft DVD Creator offers you the easiest and fastest way to burn videos like AVI, WMV, MP4, MKV, MOV, FLV, ASF, MOD, VOB, MPEG to DVD for playback on various DVD players or backup them as ISO files or DVD folder. And HD videos are also supported like AVCHD video (MTS/M2TS), TS, TRP, HD MOV. In addition, you can create customized DVD menu with free preset templates, name DVD as you like, create chapters for videos to skip playback and even customize the thumbnail.\nCreate your own stylish DVD with Daniusoft DVD Creator:\n\n    * Burn any video like AVI, WMV, MP4, MOV, MPEG, VOB, FLV to DVD\n    * Support HD videos, including MTS, M2TS, TS, TRP, H.264, etc.\n    * Backup videos as ISO files or DVD folder\n    * Provide a variety of free DVD menu templates to make DVD menu\n    * Create customized DVD menu by adding background picture &amp; music\n    * Create DVD chapter and title thumbnail to skip playback conveniently\n    * Easy to use, only a few click to complete the DVD authoring\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.giveawayoftheday.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.giveawayoftheday.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.daniusoft.com/dvd-creator.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.daniusoft.com/dvd-creator.html&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista/W7 machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n\nEnjoy and remember to seed... :o)","torrent":{"xt":"urn:btih:28cd3284336e3ac8c95874c5e7ed4b0bab8977a4","amp;dn":"DaniuSoft+DVD+Creator+1.2.0+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28cd3284336e3ac8c95874c5e7ed4b0bab8977a4","infoHashBuffer":{"type":"Buffer","data":[40,205,50,132,51,110,58,200,201,88,116,197,231,237,75,11,171,137,119,164]},"announce":[],"urlList":[]}}