{"title":"Cliff Richard - Love Is Forever &amp; Good News  FLAC","uid":5832400,"size":516959020,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:29db12852c7c8c5ccfe0d26a2474ea2207adeb18&amp;dn=Cliff+Richard+-+Love+Is+Forever+%26+Good+News++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"keeybee","files":38,"time":1284570360,"description":"Please seed!\n\nSir Cliff Richard, OBE (born Harry Rodger Webb; 14 October 1940) is an English singer, musician, performer, actor, entrepreneur and philanthropist.\nWith his backing group The Shadows, Richard, originally positioned as a rebellious rock and roll singer in the Elvis Presley style, dominated the British popular music scene in the pre-Beatles period of the late 1950s\nand early 1960s. His 1958 hit single &quot;Move It&quot; is often described as Britain's first authentic rock and roll song, and John Lennon once claimed that &quot;before Cliff and the Shadows, there had been nothing worth listening to in British music.&quot; A conversion to Christianity and subsequent softening of his music later led to a more middle of the road pop image, sometimes venturing into gospel. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Cliff_Richard&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Cliff_Richard&lt;/a&gt;\n\n\n2 on 1 &quot;Love Is Forever&quot; and &quot;Good News&quot; - Cliff Richard\nOriginally released 1965 and 1967\nThis CD digitally remastered 2002\n\n01  Cliff Richard - Love Is Forever - Everyone Needs Someone To Love\n02  Cliff Richard - Love Is Forever - Long Ago (And Far Away)\n03  Cliff Richard - Love Is Forever - (All Of A Sudden) My Heart Sings\n04  Cliff Richard - Love Is Forever - Have I Told You Lately That I Love You\n05  Cliff Richard - Love Is Forever - Fly Me To The Moon (In Other Words)\n06  Cliff Richard - Love Is Forever - Theme From A Summer Place\n07  Cliff Richard - Love Is Forever - I Found A Rose\n08  Cliff Richard - Love Is Forever - My Foolish Heart\n09  Cliff Richard - Love Is Forever - Through The Eye Of A Needle\n10  Cliff Richard - Love Is Forever - My Coloring Book\n11  Cliff Richard - Love Is Forever - I'll Walk Alone\n12  Cliff Richard - Love Is Forever - Someday (You'll Want Me To Want You) \n13  Cliff Richard - Love Is Forever - Paradise Lost\n14  Cliff Richard - Love Is Forever - Look Homeward Angel\n15  Cliff Richard - Good News - Good News\n16  Cliff Richard - Good News - It Is No Secret\n17  Cliff Richard - Good News - We Shall Be Changed\n18  Cliff Richard - Good News - 23rd Psalm (Crimond) \n19  Cliff Richard - Good News - Go Where I Send Thee\n20  Cliff Richard - Good News - What A Friend We Have In Jesus \n21  Cliff Richard - Good News - All Glory Laud And Honour\n22  Cliff Richard - Good News - Just A Closer Walk With Thee\n23  Cliff Richard - Good News - The King Of Love My Shepherd Is\n24  Cliff Richard - Good News - Mary What You Gonna Name That Pretty Little Baby\n25  Cliff Richard - Good News - When I Survey The Wondrous Cross\n26  Cliff Richard - Good News - Take My Hand, Precious Lord\n27  Cliff Richard - Good News - Get On Board Little Children\n28  Cliff Richard - Good News - May The Good Lord Bless And Keep You\n","torrent":{"xt":"urn:btih:29db12852c7c8c5ccfe0d26a2474ea2207adeb18","amp;dn":"Cliff+Richard+-+Love+Is+Forever+%26+Good+News++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29db12852c7c8c5ccfe0d26a2474ea2207adeb18","infoHashBuffer":{"type":"Buffer","data":[41,219,18,133,44,124,140,92,207,224,210,106,36,116,234,34,7,173,235,24]},"announce":[],"urlList":[]}}