{"title":"Fantastic Four Complete (1994) S2 DVD 2-2 (multi) 2Lions-Team","uid":5849341,"size":4712392903,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2a4c89868d4d563ec13400f19f262d4ec8b377d1&amp;dn=Fantastic+Four+Complete+%281994%29+S2+DVD+2-2+%28multi%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Pioen","files":-1,"time":1285323063,"description":"Fantastic Four Complete Animatie Boxset (1994) Seizoen 1 - DVD 1-2       \n\n\nOriginele Titel: Fantastic Four Complete 1994 Animated Collection (4-Discs)\nAnimatiefilm(s) uit 1994\nReleasedatum DVD: 2009\nRegio: R2 NL -- PAL\nSpeelduur: ca. 150 Min.\n\nDe samenwerking van Stan Lee met Jack Kirby bij MARVEL COMICS heeft geleid tot een uitzonderlijk team van superhelden: De Fantastic Four! Stripliefhebbers maakten in 1961 voor het eerst met hen kennis. Deze 2-DVD-set bevat het complete eerste seizoen van de tekenfilmserie uit 1994.\n\nEen briljant wetenschapper... Zijn beste vriend... De vrouw van wie hij houdt... En haar opvliegende kleine broertje! Samen trotseerden ze de onbekende verschrikkingen van de ruimte, en werden door kosmische straling veranderd in meer dan menselijke wezens! Mr Fantastic!... The Thing!... The Invisible Woman!... The Human Torch!... Nu zijn zij de Fantastic Four - De wereld zal nooit meer dezelfde zijn!...\n\nSeizoen 1 compleet: Aan boord van een experimenteel raket-ruimteschip worden Reed Richards, Susan Storm, Johnny Storm en Ben Grimm gebombardeerd door kosmische straling. Als ze terugkeren naar de aarde merken de reizigers dat ze over verbijsterende superkrachten beschikken, samen vechten ze voor het welzijn van de mensheid als... de Fantastic Four!\n\n\nGerestaureerd beeld en geluid\n\nAmazon.com\nMarvel Comics' Fantastic Four animated series (1994-95)--depicting the first family of superheroes--got significantly better as it went along. The series always had good intentions, borrowing plots, concepts, characters, and even lines of dialogue from the classic Stan Lee-Jack Kirby comic books that kicked off the Marvel age of comics. And it was willing to spend two or even three episodes on a single story line. The early episodes, however, had serious drawbacks, such as a clumsy animation style (the Silver Surfer never looked less noble), weak humor (the origin episode created a framing sequence in which the FF appears on the Dick Cavett Show), and an awful theme song by Giorgio Moroder (Flashdance, Top Gun). Fortunately, the animation improved in the second season, and instrumental theme music replaced the song. Memorable moments from the series include the monumental Frightful Four-Inhumans tie-in and Galactus's search for a new herald. Memorable characters include villains Doctor Doom, the Skrulls, the Mole Man, and the Puppet Master, and heroes Daredevil, the Black Panther, Thor, and the Hulk. Guest voices include Ron Perlman, Michael Dorn, Kathy Ireland, Mark Hamill, and John Rhys-Davies. It's worth a look for FF fans, especially in the complete four-disc set that contains all 29 episodes, a welcome change from Disney's single-disc compilations of the Spider-Man series from the same time period. (Ages 8 and older: cartoon action, threatening situations, some mature concepts) --David Horiuchi \nProduct Description\nIt's here--the longest-running Marvel series in history arrives for the first time on DVD in this spectacular four-disc set, featuring all 26 episodes of the heralded 1990's animated series. Learn the origin of the Fantastic Four, and be there as Mr. Fantastic, The Invisible Woman, Human Torch, and The Thing save the world from the dastardly Doctor Doom and his legion of villains. Now you can relive every action-packed episode, complete with exclusive introductions by Stan Lee. It's a fantastic DVD collection you'll want to experience over and over again. \n &lt;a href=&quot;\nhttp://www.amazon.com/dp/B0007US7CQ?tag=thehomeimprovemz&amp;link_code=as3&amp;creativeASIN=B0007US7CQ&amp;creative=373489&amp;camp=211189&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/dp/B0007US7CQ?tag=thehomeimprovemz&amp;link_code=as3&amp;creativeASIN=B0007US7CQ&amp;creative=373489&amp;camp=211189&lt;/a&gt;\n\nAfleveringen Seizoen 1 DVD-1:\n- The Origin Of The Fantastic Four, Part I\n- The Origin Of The Fantastic Four, Part II\n- Now Comes The Sub-Mariner\n- Incursion Of The Skrull\n- The Silver Surfer And The Coming Of Galactus, Part I\n- The Silver Surfer And The Coming Of Galactus, Part II\n- Super Skrull\n\nBonusmateriaal:\n- Geen\n\n\nAudio:\nDolby Digital Surround 5.1:\n- Engels\n\nDolby Digital 2.0:\n- Engels\n- Duits\n\nOndertiteling:\n- Nederlands\n- Engels\n- Deens\n- Noors\n- Fins\n- Zweeds\n\nVoor mÃƒÂ©ÃƒÂ©r info zie de weblink.\n\nDit is dus de complete 1e DVD van Seizoen 1 inclusief Menu's.\nOriginele Cover en Labels zitten uiteraard mee ingepakt.\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nThanks : HappyGremlin1\n \n\nGenre : Animatie\n \nWeblink : http://www.ultimatedisney.com/fantasticfour-series.html \n  \n******************************************\n\nBrought to you by \n\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\n\n\nPlease check our site !!!\n                         &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt; \n\n\n      \n\n \n \n \n","torrent":{"xt":"urn:btih:2a4c89868d4d563ec13400f19f262d4ec8b377d1","amp;dn":"Fantastic+Four+Complete+%281994%29+S2+DVD+2-2+%28multi%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a4c89868d4d563ec13400f19f262d4ec8b377d1","infoHashBuffer":{"type":"Buffer","data":[42,76,137,134,141,77,86,62,193,52,0,241,159,38,45,78,200,179,119,209]},"announce":[],"urlList":[]}}