{"title":"Police State 4 Rise of FEMA (2010) DVDR NL Subs [NLT Release] (D","uid":5841590,"size":4632806197,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2b09086c447c47c00b8e02075a2e19720264236d&amp;dn=Police+State+4+Rise+of+FEMA+%282010%29+DVDR+NL+Subs+%5BNLT+Release%5D+%28D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hoihiep","files":-1,"time":1284983923,"description":"Police State 4: The Rise of FEMA (2010)\n\nVerenigde Staten\n\nDocumentaire\n\n141 minuten\ngeregisseerd door Alex Jones\nmet N.V.T\n\nNederlands Plot:\nTiranie is hier! De grimmige toekomst voorspeld in 1984 is werkelijkheid geworden.\nDe Verenigde Staten staat nu wereldwijd bekent als een van de meest onderdrukkende\npolitie staat op aarde. En het word alleen maar erger. POLICE STATE 4, verhaalt\nde zieke dieptepunten tot waar onze republiek tot gevallen is. Veteraan documentaire\nmaker Alex Jones bewijst op meerdere aspecten het bestaan van een geheim netwerk\nvan FEMA kampen, die op dit moment nationaal worden uitgebreid. Het militaire \nindustriÃƒÂ«le complex transformeert ons, eens vrije natie, in een gigantische\ngevangenis. Een geldloos maatschappelijk controle rooster, gebouwd in de naam van\nhet bestrijden van terrorisme, was eigenlijk gebouwd om het Amerikaanse volk tot\nslaaf te maken. Body Scanners, sound cannons, burger spionnen, gemaakte terreur en\ncamera's op elke hoek van de straat -- het is enkelt het begin van de \n'nieuwe wereldorde' zijn duivelse plan. Deze film laat zien hoe de &quot;continuÃƒÂ¯teit van\nde regering&quot; zijn programma, een alles overheersende krachtige schaduw staat heeft\ngevestigd. Bereid je voor om de heimelijke wereld van de noodsituatie dictatorschap, \nFEMA kampen, en een versnipperde constitutie te zien. Aanschouw politie en de militaire \ndiensten, op brute wijze onschuldige burgers aanvallen terwijl onze eigen regering\nvalse vlag operaties ontketend om zijn onderdrukking te rechtvaardigen. Bekijk\nvervolgens hoe Alex Jones corrupte ingehuurde politie aanpakt en mainsteam media\nhersenspoeling blootstelt.\nDE POLITIE STAAT KOMT NIET, HIJ IS ER AL!\n\nEnglish Plot:\nTyranny is HERE! The grim future foretold in 1984 has become reality. \nThe United States is now recognized globally as one of the most oppressive police \nstates on earth. And it's only getting worse. POLICE STATE 4 chronicles the \nsickening depths to which our republic has fallen. Veteran documentary filmmaker \nAlex Jones conclusively proves the existence of a secret network of FEMA camps, \nnow being expanded nationwide. The military industrial complex is transforming our \nonce free nation into a giant prison camp. A cashless society control grid, \nconstructed in the name of fighting terrorism, was actually built to enslave the \nAmerican people. Body scanners, sound cannons, citizen spies, staged terror and \ncameras on every street corner -- it's only the beginning of the New World Order's \nhellish plan. This film exposes how the &quot;Continuity of Government&quot; program has \nestablished an all powerful shadow state. Prepare to enter the secretive world of \nemergency dictatorship, FEMA camps, and a shredded Constitution. Witness police and \nmilitary savagely attacking innocent citizens as our own government unleashes false \nflag operations to justify its oppression. Then watch as Alex Jones takes on corrupt \nmercenary police and exposes mainstream media brainwashing. \nTHE POLICE STATE ISN'T COMING, IT'S HERE! \n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : CAM\nAnders\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Documentaire\n \nWeblink : http://www.amazon.com/Police-State-Rise-FEMA-Jones/dp/B003H3CKLO \n\n\nDvD Inf0:\n\nMovie..........: Police State 4: The Rise of FEMA (2010)\n\nRuntime...........: 141 minuten\n\nFormat.............: DVDR\n\nSource..........: Police.State.4-The.Rise.Of.FEMA.Docu.DVDRip.XviD.2010.English\n\nMain Movie .......: High quality convert\n\nAudio ............: Engels AC3 DD2.0\n\nMenu ............: Nee\n\nSubtitles ........: Nederlands\n\n------- Vertaald door ..: Jopie123, erg goed werk m8!\n\n------- Controle...: Jopie123\n\n------- Bewerking &amp; Resync...: Jopie123\n\nExtra Info: We hebben de dvdrip op de hoogst mogelijke manier omgezet naar dvd, \nom voor jullie de beste kwaliteit te behouden!\n\nInfo over het beeld: Gewoon superkwaliteit!\n\nScreens: Niet nodig, is zo goed als retail!\n\nUnieke Hashcode: 2B09086C447C47C00B8E02075A2E19720264236D\n\nThis torrent is brought to you by: NLT Release\nUploader: Hoihiep\n\nAlso visit our forum! www.nlt.ons-forum.nl","torrent":{"xt":"urn:btih:2b09086c447c47c00b8e02075a2e19720264236d","amp;dn":"Police+State+4+Rise+of+FEMA+%282010%29+DVDR+NL+Subs+%5BNLT+Release%5D+%28D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b09086c447c47c00b8e02075a2e19720264236d","infoHashBuffer":{"type":"Buffer","data":[43,9,8,108,68,124,71,192,11,142,2,7,90,46,25,114,2,100,35,109]},"announce":[],"urlList":[]}}