{"title":"Ninja Assassin (2009) BDRip H264 AAC","uid":5728671,"size":733957841,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2b35194ee2132ad1c7b2e01049fbf08a57447dc1&amp;dn=Ninja+Assassin+%282009%29+BDRip+H264+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1280567017,"description":"Synopsis: Raizo is one of the deadliest assassins in the world. Taken from the streets as a child, he was transformed into a trained killer by the Ozunu Clan, a secret society whose very existence is considered a myth. But haunted by the merciless execution of his friend by the Clan, Raizo breaks free from them...and vanishes. Now he waits, preparing to exact his revenge. In Berlin, Europol agent Mika Coretti has stumbled upon a money trail linking several political murders to an underground network of untraceable assassins from the Far East. Defying the orders of her superior, Ryan Maslow, Mika digs into top secret agency files to learn the truth behind the murders. Her investigation makes her a target, and the Ozunu Clan sends a team of killers, led by the lethal Takeshi, to silence her forever. Raizo saves Mika from her attackers, but he knows that the Clan will not rest until they are both eliminated. Now, entangled in a deadly game of cat and mouse through the streets of Europe, Raizo and Mika must trust one another if they hope to survive and finally bring down the elusive Ozunu Clan.\n\nFormat: H264\nResolution: 960 x 540\nBitrate: 1 Mbps\nLanguage: English","torrent":{"xt":"urn:btih:2b35194ee2132ad1c7b2e01049fbf08a57447dc1","amp;dn":"Ninja+Assassin+%282009%29+BDRip+H264+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b35194ee2132ad1c7b2e01049fbf08a57447dc1","infoHashBuffer":{"type":"Buffer","data":[43,53,25,78,226,19,42,209,199,178,224,16,73,251,240,138,87,68,125,193]},"announce":[],"urlList":[]}}