{"title":"Sliders - I Viaggiatori Serie 2 Completa [DVDmux ITA] TNT Villag","uid":5755541,"size":4467480576,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2b35de12c46ace532e563e0d9589073df30b24ed&amp;dn=Sliders+-+I+Viaggiatori+Serie+2+Completa+%5BDVDmux+ITA%5D+TNT+Villag&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"l.diliberto","files":13,"time":1281549947,"description":"Sliders - I Viaggiatori Serie 2 Completa [DVDmux ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=33858&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=33858&lt;/a&gt;\n\n.: Trama :.\n\nLa storia narra le vicende di un gruppo di viaggiatori che, per l'appunto, si ritrova a viaggiare attraverso dimensioni parallele del loro universo.\n\nIl giovane studente universitario Quinn Mallory, interpretato da Jerry O'Connell, nell'intento di costruire una macchina capace di modificare in qualche modo la gravitÃƒÂ  terrestre, realizza invece un macchinario (soprannominato &quot;Slider machine&quot;) in grado di aprire un varco attraverso vari universi paralleli. In pratica questa macchina apre un tunnel (basato sul ponte di Einstein-Rosen, teoria realmente esistente) che puÃƒÂ² trasportare chi lo attraversa in una dimensione nella quale il luogo e il tempo sono gli stessi (quindi stesso luogo e stesso giorno) ma nella quale sono avvenuti diversi avvenimenti e scelte (micro o macroscopiche che siano). Al ritorno dal suo primo viaggio, Quinn trova un suo doppio (proveniente da una dimensione parallela che ha giÃƒÂ  ultimato e perfezionato la macchina) e che, oltre a dargli la soluzione dell'equazione che rende possibile la creazione di questo varco, gli racconta brevemente come utilizzare la macchina. L'altro Quinn non riesce a comunicargli la cosa piÃƒÂ¹ importante: cosa non fare assolutamente per non rimanere bloccato in un'altra dimensione! Il suo professore di fisica Maximillian Arturo (John Rhys-Davies), la sua collega di lavoro Wade (Sabrina Lloyd) decidono di accompagnare Quinn nel suo secondo viaggio ma egli, decidendo di aumentare l'intensitÃƒÂ  del vortice per permettere il trasporto di tre persone, esagera tanto da risucchiare anche un ex cantante di successo degli Anni'70 la cui carriera ormai non ha piÃƒÂ¹ sbocchi, Rembrandt Brown (Cleavant Derricks), il quale stava attraversando, con la sua macchina, la strada di fronte al sotterraneo dove era situato il macchinario.\n\nPrima di partire, Quinn imposta la durata del viaggio sulle cinque ore ma, una volta sul posto, ÃƒÂ¨ costretto a modificarla ed ÃƒÂ¨ proprio questo fatto che gli costerÃƒÂ  caro: a causa di questa modifica nelle condizioni del viaggio, il gruppo di viaggiatori non tornerÃƒÂ  piÃƒÂ¹ alla propria dimensione di partenza ma ad un'altra senza sapere piÃƒÂ¹ come tornare indietro. Nessuno sa come impostare le coordinate dimensionali sul timer in modo da tornare a casa, quindi ai viaggiatori non resta altro che saltare da una dimensione all'altra, sperando di riuscire, prima o poi, a tornare indietro oppure di incontrare dei loro doppi in possesso di una &quot;slider machine&quot; piÃƒÂ¹ sofisticata, in grado di ricevere le coordinate dimensionali.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://mywebpages.comcast.net/pccranford/sliders.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mywebpages.comcast.net/pccranford/sliders.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nTitolo: I Viaggiatori\nAnno: 1995-1999\nGenere: Sci-Fi\nPersonaggi principali\nCleavant Derricks: Rembrandt &quot;Crying Man&quot; Brown\nKary Wuhrer: Maggie Beckett\nRobert Floyd: Quinn &quot;Mallory&quot; Mallory\nTembi Locke: Diana Davis\n\n========================================\n\n.: Dati tecnici di un episodio, gli altri sono simili :.\n\nDimensione: 327 MB\nDurata: 42''\n\nVideo Codec: XviD\nVideo Bitrate: 954 kb/s\nRisoluzione: 576x432 (1.33:1) [=4:3]\nFPS (Frames/sec):25.000\nQF (Frame quality): 0.153 bits/pixel\n\nAudio Codec: mpeglayer3 (mp3) (0x0055) ISO/MPEG\nAudio Bitrate: 112 kb/s (56/ch, stereo)\nFreq Audio: 44100 Hz","torrent":{"xt":"urn:btih:2b35de12c46ace532e563e0d9589073df30b24ed","amp;dn":"Sliders+-+I+Viaggiatori+Serie+2+Completa+%5BDVDmux+ITA%5D+TNT+Villag","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b35de12c46ace532e563e0d9589073df30b24ed","infoHashBuffer":{"type":"Buffer","data":[43,53,222,18,196,106,206,83,46,86,62,13,149,137,7,61,243,11,36,237]},"announce":[],"urlList":[]}}