{"title":"Helmet - Unsung (2nafish)","uid":5916286,"size":148727812,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2ba151637e835e711eb957c221bd6daf79dd7db1&amp;dn=Helmet+-+Unsung+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1288244584,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Unsung&quot; is a single by alternative metal band Helmet from their 1992 album, Meantime. It is the album's fourth track and easily the band's most well known song. A music video was produced for &quot;Unsung&quot; and found significant airplay on MTV in the early 1990s. The song's popularity has had it featured in many successful video games including Guitar Hero (and its compilation, Guitar Hero Smash Hits, which used a version recorded from a 1992 gig in Chicago), Grand Theft Auto: San Andreas, Madden 10, True Crime: New York City and Saints Row 2.\n\n&quot;Unsung&quot; is recorded in Dropped D tuning and begins with a bass guitar solo. Its stop-and-go dynamics and catchy rhythm made it somewhat of a flagship of the growing '90s alternative metal scene. It was also reportedly influential to Pantera's similar song &quot;Rise&quot;; however, both songs were released in very close proximity.\n\nThe song has been covered by The Wildhearts on their new album of covers, Stop Us If You've Heard This One Before, Vol 1.\n\nMeantime is the second album and major-label debut by Helmet, released in 1992 on Interscope Records. Meantime has continued to sell consistently well in the years since its release, and in 1994 was certified gold by the Recording Industry Association of America.\n\nHelmet released one single from Meantime, &quot;Unsung&quot;, which was a charting success on the US Modern Rock Tracks chart, and remains their best-known song. The album itself reached #68 on Billboard's Top 200; an unexpected success for the band. Music videos were also made for &quot;Unsung&quot; &quot;Give It&quot; and &quot;In the Meantime&quot;.\n\nHelmet is an alternative metal band from New York formed in 1989. Founded by vocalist/guitarist Page Hamilton, Helmet has had numerous lineup changes, and Hamilton has been the only constant member.\n\nHelmet has released six studio albums and two compilations. The band found mainstream success with their 1992 major label debut Meantime, which debuted at number 68 on the Billboard 200 and spawned the hits &quot;Unsung&quot; and &quot;In the Meantime&quot;. After releasing two more albums, Helmet broke up in 1998, but reformed in 2004. The band released their first post-reunion album, Size Matters, later that year and it was their last release on their longtime label Interscope Records. They were briefly signed with Warcon Records, who released their next album, Monochrome, on July 18, 2006. Currently, Helmet are signed to Work Song, who released their seventh album Seeing Eye Dog.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2ba151637e835e711eb957c221bd6daf79dd7db1","amp;dn":"Helmet+-+Unsung+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ba151637e835e711eb957c221bd6daf79dd7db1","infoHashBuffer":{"type":"Buffer","data":[43,161,81,99,126,131,94,113,30,185,87,194,33,189,109,175,121,221,125,177]},"announce":[],"urlList":[]}}