{"title":"Wikileaks: Afghan War Diary, 2004-2010 (All formats)","uid":5735906,"size":1637650037,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2ca8a7f4303264ca8f853f1de673bd98d152854c&amp;dn=Wikileaks%3A+Afghan+War+Diary%2C+2004-2010+%28All+formats%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":9,"time":1280816221,"description":"(This torrent contains the Afghan War Diary in all published formats, including the Google Earth bookmarks and the still encrypted 1.4 GB &quot;insurance&quot; file.)\n\n=== Afghan War Diary, 2004-2010 ===\nFrom WikiLeaks\n\nUnless otherwise specified, the document described here:\n\n    * Was first publicly revealed by WikiLeaks working with our source.\n    * Was classified, confidential, censored or otherwise withheld from the public before release.\n    * Is of political, diplomatic, ethical or historical significance.\n\nAny questions about this document's veracity are noted.\nThe summary is approved by the editorial board.\nIf you have similar or updated material, see our submission instructions.\n\nRelease date\n    July 25, 2010\n\n=== Summary ===\n\n25th July 2010 5:00 PM EST WikiLeaks has released a document set called the Afghan War Diary, an extraordinary compendium of over 91,000 reports covering the war in Afghanistan from 2004 to 2010.\n\nThe reports, while written by soldiers and intelligence officers, and mainly describing lethal military actions involving the United States military, also include intelligence information, reports of meetings with political figures, and related details.\n\nThe document collection is available on a dedicated webpage.\n\nThe reports cover most units from the US Army with the exception of most US Special Forces' activities. The reports do not generally cover top secret operations or European and other ISAF Forces operations.\n\nWe have delayed the release of some 15,000 reports from the total archive as part of a harm minimization process demanded by our source. After further review, these reports will be released, with occasional redactions, and eventually in full, as the security situation in Afghanistan permits.\n\nThe data is provided in HTML (web), CSV (comma-separated values) and SQL (database) formats, and was rendered into KML (Keyhole Markup Language) mapping data that can be used with Google Earth. Please note that the checksums will change.\n\n    * Complete dump of the website, HTML format 75 MB\n          o (SHA1: 80adb634a0d218bd0f9a0f22734e3d2e7e67acfc)\n          o This is a complete dump of the website at http://wardiary.wikileaks.org. Extract this to your local hard disk and open it with your web browser. Please check the project website http://wardiary.wikileaks.org for the most recent version.\n    * All entries, CSV format 15 MB\n          o (SHA1: d6b82f955a7beb9589f92e9487c74669d1912a34)\n          o Raw data in comma-separated value format for further processing.\n    * All entries, SQL format 16M MB\n          o (SHA1: 9463f73ebbcd3f95899a138d6ba9817e1b6b800d)\n          o Raw data in SQL format for further processing.\n    * All entries, KML format 16 MB\n          o (SHA1: 34562c0c7722522161e40330d80ac9082014845f)\n          o This archive contains all events in one KML file. This file needs much memory if opened with Google Earth.\n    * All NATO entries, KML format 209 kB\n          o (SHA1: 088ff8999a316f30e5e398021375fa3b4fc6349e)\n          o Contains the events that were tagged with NATO.\n    * Entries by month, KML format 16 MB\n          o (SHA1: 01a5c0639e1e1e844b10e962a44849b2a521d092)\n          o This archive provides the entries split by month. This makes it easier to browse the data in Google Earth on low power machines.\n    * Entries with scale filter, KML format 981 kB\n          o (SHA1: 4669c721b87775a44472f6688e768305c686beff)\n          o File that will show a scale corresponding to the number of incidents in Google Earth. Each incident begins with a 0.5 base score, and 0.1 has been added for each incident involving humans. This set of data provides only events that have a scaling of 1.5.\n    * Insurance file 1.4 GB\n          o (SHA1: cce54d3a8af370213d23fcbfe8cddc8619a0734c)","torrent":{"xt":"urn:btih:2ca8a7f4303264ca8f853f1de673bd98d152854c","amp;dn":"Wikileaks%3A+Afghan+War+Diary%2C+2004-2010+%28All+formats%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ca8a7f4303264ca8f853f1de673bd98d152854c","infoHashBuffer":{"type":"Buffer","data":[44,168,167,244,48,50,100,202,143,133,63,29,230,115,189,152,209,82,133,76]},"announce":[],"urlList":[]}}