{"title":"Switchball","uid":5878901,"size":143358640,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2e3e791cded17760466d82b6aa7ef69a0fdd2771&amp;dn=Switchball&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Dr.Blake","files":1,"time":1286762150,"description":"Just download Daemon Tools Lite and mount the mdx file\n\nSwitchball (originally CrazyBall) is a 3D action-puzzle game, made by Swedish developer Atomic Elbow, which was released for Microsoft Windows on June 26, 2007, on Xbox Live Arcade for the Xbox 360 on November 7, 2007 and on PlayStation Network for the PlayStation 3 on September 17, 2009.\n\nThe game puts the player in the role of a marble, which is guided through a narrow winding course suspended in mid-air in five different environments: Skyworld, Iceworld, Caveworld, Cloudworld and Lavaworld.\n\nUsing AGEIA as its core physics engine, the marble can be &quot;morphed&quot; into different balls with unique physical properties, like a Marble Ball, a Power Ball (which can be charged and have an accelerated &quot;dash&quot;, a &quot;jump&quot; ability or switchable &quot;magnetism&quot; properties), a Steel Ball (which can push heavy objects around), and so forth. Each course contains obstacles and traps, such as wooden blocks, sheets of cloth, spinning fans, magnets, and cannons. The game utilizes physics-based puzzles as well, such as moving boxes or weighting ramps; also, different balls react to the environment; Steel Balls, for example, will tear cloth platforms.\n\nEach level is timed, and players are rewarded with Gold, Silver and Bronze medals, depending on how quickly they completed the level.","torrent":{"xt":"urn:btih:2e3e791cded17760466d82b6aa7ef69a0fdd2771","amp;dn":"Switchball","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e3e791cded17760466d82b6aa7ef69a0fdd2771","infoHashBuffer":{"type":"Buffer","data":[46,62,121,28,222,209,119,96,70,109,130,182,170,126,246,154,15,221,39,113]},"announce":[],"urlList":[]}}