{"title":"By The Will Of Genghis Kahn (2009)PAL DVD iso (dutch subs) NLT-R","uid":5880230,"size":4640072026,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2f68abbe9f18336434f4770e06848e641b1b838f&amp;dn=By+The+Will+Of+Genghis+Kahn+%282009%29PAL+DVD+iso+%28dutch+subs%29+NLT-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1286757664,"description":"By The Will Of Genghis Kahn (2009)PAL DVD (nl subs) NLT-Release\n\n\n[url=http://www.imdb.com/title/tt1124364/]IMDB[/url]\nKazakhstan\nActie/Avontuur\n122 minuten\ngeregisseerd door Andrei Borissov\nmet Alexey Egorov, Sergei Egorov, Eduard Ondar en Cary-Hiroyuki Tagawa\n\nDeze meeslepende film vertelt het levensverhaal van Temujin, de Mongoolse veroveraar die de stammen in zijn land verenigde en de geschiedenis in zou gaan als Genghis Khan. Het verhaal begint met drie jeugdvrienden die een echte broederband met elkaar hebben. Een van hen kiest voor de spiritualiteit en groeit uit tot een invloedrijk sjamaan. De andere twee volgen het oorlogspad en worden door de bevolking al snel erkend als leiders. Maar slechts een van de vrienden is door de Eeuwige Blauwe Hemel uitverkoren om de ultieme heerser van de steppe te worden. De weg naar die bestemming is echter geplaveid met rampspoed. Zo maakt Temujins liefde voor een vrouw hem uiteindelijk meedogenloos, drijft zijn respect voor de wet hem tot broedermoord en leidt zijn hang naar vrede juist tot bloedige oorlogen.\nHet leven van de legendarische Genghis Kahn, die in 1206 vanuit MongoliÃƒÂ« zijn rijk tot ongekende grootte uitbouwde, blijft inspiratie leveren voor indrukwekkende epische films. De Russische regisseur Andrei Borissov maakte met BY THE WILL OF GENGHIS KHAN Een groots historisch epos met een meeslepend avontuur, vol indrukwekkende massascÃƒÂ¨nes, schitterende kostuums en adembenemende landschappen.\n**********************************************\n\nKazakhstan\nAction / Adventure\n122 minutes\ndirected by Andrei Borissov\nwith Alexey Egorov, Sergei Egorov, Edward and Cary-Hiroyuki Tagawa Ondar\n\nThis compelling film tells the story of Temujin, the Mongol conqueror who united the tribes in his country and would go down in history as Genghis Khan. The story begins with three childhood friends who are real brother relationship with each other. One of them choose the spirituality and becoming an influential shaman. The other two follow the path of war and by the people soon recognized as leaders. But only one of the friends of the Eternal Blue Sky has chosen to become the ultimate ruler of the steppe to be. The road to that destination is paved with adversity. For example, Temujin love for a woman he ultimately ruthless, driving his respect for the law leads him to fratricide and his penchant for true peace to bloody wars.\nThe life of the legendary Genghis Khan, in Mongolia from 1206 until his empire built up and magnitude, will provide inspiration for impressive epic movies. The Russian director Andrei Borissov made with BY THE WILL OF A grand historical epic Genghis Khan with a gripping adventure, full of impressive crowd scenes, gorgeous costumes and breathtaking scenery.\n\nRelease info:\nVersie...............: DVD5 PAL NL\nGeluidssporen...........: Russisch DD 5.1\nOndertiteling..........: Nederlands(original)\nAantal delen......: Rar 5 Parts (parts 1 voor 1 downloaden)\nBeeldformaat........: 16:9 anamorphic widescreen (1.78:1)\nMenu.............: Ja\nExtra's..............: Nee\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Actie Avontuur\n \nWeblink : http://chingiskhanfilm.ru/eng/ \n\nEnjoy the movie\n\nXX-Men\n","torrent":{"xt":"urn:btih:2f68abbe9f18336434f4770e06848e641b1b838f","amp;dn":"By+The+Will+Of+Genghis+Kahn+%282009%29PAL+DVD+iso+%28dutch+subs%29+NLT-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f68abbe9f18336434f4770e06848e641b1b838f","infoHashBuffer":{"type":"Buffer","data":[47,104,171,190,159,24,51,100,52,244,119,14,6,132,142,100,27,27,131,143]},"announce":[],"urlList":[]}}