{"title":"El asirio.(ebook)","uid":5923287,"size":6156059,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:302530908a2a35aeafe086cae49bb32f7ab9037f&amp;dn=El+asirio.%28ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1288505621,"description":"\n\nÃ‚Â«El asirioÃ‚Â», espectacular epopeya de amor y conflictos bÃƒÂ©licos que se desarrolla durante el siglo VII a. de C, cuando la antigua Asiria se hallaba en la cima de su gloria.\n\nEn el palacio real de NÃƒÂ­nive, Tiglath Assur y AsarhadÃƒÂ³n, hermanastros y excelentes amigos, rivalizan por el trono y comparten mujeres, sueÃƒÂ±os y secretos. Uno de ellos llegarÃƒÂ¡ a convertirse en rey de Asiria; el otro, en un legendario guerrero. SegÃƒÂºn predicen los augurios, su prima, la encantadora princesa Asharhamat, se desposarÃƒÂ¡ con el heredero de la corona... Sin embargo se convierte en esposa de uno y amante del otro.\n\n\n\nPero el ansia de poder consume tan febrilmente como el anhelo amoroso. Tras la designaciÃƒÂ³n del sucesor, una plaga de suicidios y asesinatos conduce a Asiria al borde de la guerra civil mientras tribus bÃƒÂ¡rbaras invaden el paÃƒÂ­s. Son tiempos terribles en que se suceden traiciones, actos de crueldad, brutales torturas y matanzas sangrientas, y muchos ven sus sueÃƒÂ±os destrozados. Las pasiones chocan con la polÃƒÂ­tica y los hermanos se enfrentan entre sÃƒÂ­. Tras la caÃƒÂ­da de Babilonia se produce el auge de NÃƒÂ­nive y se plantea una terrible elecciÃƒÂ³n entre la voluntad de los dioses y los deseos de los protagonistas que cambiarÃƒÂ¡ el destino de un imperio.\n\nÃ‚Â«El asirioÃ‚Â», de Nicholas Guild, es una inolvidable epopeya de intrigas amorosas y apasionantes aventuras que discurren en la Asiria de hace veintisiete siglos. Es una novela ÃƒÂ©pica, a la antigua usanza, una novela que te embarga, que te enamora y que te hace sufrir. Probablemente son los dioses quienes escribieron el destino de Tiglath y del paÃƒÂ­s de Assur, pero solo Nicholas Guild es responsable de recrear con maestrÃƒÂ­a la Asiria del siglo VII a.c.\n","torrent":{"xt":"urn:btih:302530908a2a35aeafe086cae49bb32f7ab9037f","amp;dn":"El+asirio.%28ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"302530908a2a35aeafe086cae49bb32f7ab9037f","infoHashBuffer":{"type":"Buffer","data":[48,37,48,144,138,42,53,174,175,224,134,202,228,155,179,47,122,185,3,127]},"announce":[],"urlList":[]}}