{"title":"Kheaw_Aa_Kaard[Zz] Thai Movie 2010","uid":5715741,"size":4142447137,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:309ecbbdd1ce9a07f931c11e0ffa3a4b72510cb9&amp;dn=Kheaw_Aa_Kaard%5BZz%5D+Thai+Movie+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":17,"time":1280087098,"description":"MASTER DVD 5\nRuntime 109 mins\nRated PG-13\n\nGenres \nHorror,Thai,Thriller\n\nVideo Format \nAnamorphic Widescreen 16:9\n\nAudio \nThai 5.1\nSubtitle \nThai\n\n\nDirected by Thanadol Nualsuth and Thammanoon Sakulbunthanom\nProduced by Poj Arnon\nStarring Kwankao Sawetwimol, Akara Amartayakul, Apinya Sakuljaroensuk\nRelased in Thai cinemas on April 29, 2010; rated 18+\nWise Kwai's rating: 3/5\n\nKarma comes back to bite the innocent and the not-so-innocent in The Intruder (Kheaw Aa-Kaard, ?????? ?????, literally &quot;fang feud&quot;), a snakes-in-the-apartment thriller that is heavy on the melodrama and woefully short on camp but still entertaining for shocking body horror and snake bites that made me jump.\n\nThe action takes place in a down-at-the-heels, moldering apartment building that was built in the 1980s on the eastern edge of Bangkok in what is known locally as Nong Ngoo Hao -- the Cobra Swamp. Despite its rundown appearance and constant threat of snakes -- a vigilant guard spreads sulfur to keep the slitherers at bay -- the building is a popular dwelling for flight crews at the nearby Suvarnabhumi Airport and young hipsters griping about the poor Internet connection. There's also a family with a small child and a rock band that plays thrash metal too loudly.\n\nCharacters are briefly introduced and quickly dispensed with as the building is swiftly consumed by an all-out CGI snake invasion. Worm-shaped cobras fill the hallways, snarl the power cables and strangle the phone service. They fill an elevator car and wriggle their way under a corpses' skin.\n\nThe survivors are narrowed down a small group that tries to stay one step ahead of the snakes. Akara Amartayakul is a doctor specializing in snakebites who just happens to be visiting the building when the snake-swarm strikes. And it just so happens he used to date the building's landlady, played by Kwankao Sawetimol.\n\nThere's also the family with the little girl, whose dad has been carrying on with a young woman in the building. So there's more tension between the mom and dad.","torrent":{"xt":"urn:btih:309ecbbdd1ce9a07f931c11e0ffa3a4b72510cb9","amp;dn":"Kheaw_Aa_Kaard%5BZz%5D+Thai+Movie+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"309ecbbdd1ce9a07f931c11e0ffa3a4b72510cb9","infoHashBuffer":{"type":"Buffer","data":[48,158,203,189,209,206,154,7,249,49,193,30,15,250,58,75,114,81,12,185]},"announce":[],"urlList":[]}}