{"title":"La torre de las sombras [PAL][Spanish][Wii][www.consolasatope.co","uid":5896870,"size":4699980130,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:311ec686eba61720529fe3f6eb52a23354684833&amp;dn=La+torre+de+las+sombras+%5BPAL%5D%5BSpanish%5D%5BWii%5D%5Bwww.consolasatope.co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":3,"time":1287528854,"description":"La torre es un misterio para todos. Nadie sabe por quÃƒÂ© ni quiÃƒÂ©n la construyÃƒÂ³. Se yergue desafiante hasta que su austero pinÃƒÂ¡culo alcanza el firmamento y envuelve en tinieblas las tierras que la rodean. Si la miras de cerca, te parecerÃƒÂ¡ que estÃƒÂ¡ llena de autÃƒÂ©nticos remolinos de oscuridad, que el misterioso chapitel de piedra estÃƒÂ¡ plagado de sombras y que las oleadas de penumbra del interior se mueven de abajo arriba.\n\nLa sombra de un joven, a la que han separado cruelmente de su propietario, se atreve a adentrarse en la torre. Su firme objetivo es llegar a la cÃƒÂºspide. SerÃƒÂ¡ esta sombra la que busque las respuestas a las preguntas que otros no se atreven a plantear, para asÃƒÂ­ recuperar lo que le pertenece.Como es una sombra, no puede tocar ni afectar a ningÃƒÂºn objeto real. Tampoco puede adentrarse en la oscuridad absoluta ni exponerse a la luz directa, ya que desaparecerÃƒÂ­a por completo. Solo puede caminar entre las sombras o seguir por los caminos que estas conforman. SerÃƒÂ­a imposible que llevara a cabo su gesta ella sola, pero no lo estÃƒÂ¡.\nSpangle es una sÃƒÂ­lfide, un ser hecho de luz que acompaÃƒÂ±arÃƒÂ¡ a la sombra del joven en su aventura. La sÃƒÂ­lfide puede tocar y mover los objetos del mundo real, incluida la fuente de luz que ilumina cada planta de la torre. Si cambia la posiciÃƒÂ³n de la fuente de luz, conseguirÃƒÂ¡ que las sombras de los objetos se agranden, se encojan o que se proyecten en otra direcciÃƒÂ³n, creando asÃƒÂ­ una nueva composiciÃƒÂ³n de sombras por la que avanzarÃƒÂ¡ el joven.\n\nLlegar hasta lo mÃƒÂ¡s alto de la torre no es tan sencillo como ascender por un camino: cada piso plantea retos a cuerpo y mente que solo pueden superarse combinando acciones en el mundo real y en el reino de las sombras. Seres malignos hechos de oscuridad acechan en la penumbra y atacan a cualquier intruso, por lo que luchar contra ellos es la ÃƒÂºnica soluciÃƒÂ³n. Cada planta cuenta con una puerta de salida que es necesario abrir para que la sombra del joven y la sÃƒÂ­lfide puedan avanzar torre arriba. Para ello, hay que recoger diversos objetos, aunque no serÃƒÂ¡ tarea fÃƒÂ¡cil descubrir cÃƒÂ³mo llegar hasta ellos. El periplo hasta lo alto de la torre requiere valor, ingenio e inteligencia ya que las tenebrosas salas de piedra esconden muchos retos.\n\n","torrent":{"xt":"urn:btih:311ec686eba61720529fe3f6eb52a23354684833","amp;dn":"La+torre+de+las+sombras+%5BPAL%5D%5BSpanish%5D%5BWii%5D%5Bwww.consolasatope.co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"311ec686eba61720529fe3f6eb52a23354684833","infoHashBuffer":{"type":"Buffer","data":[49,30,198,134,235,166,23,32,82,159,227,246,235,82,162,51,84,104,72,51]},"announce":[],"urlList":[]}}