{"title":"Guerino Mazzola - The Topos of Music: Geometric Logic of Concept","uid":5863495,"size":51853896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31c1853d2305c9b88f15ca57f28daa7b0fa7553a&amp;dn=Guerino+Mazzola+-+The+Topos+of+Music%3A+Geometric+Logic+of+Concept&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neadvokat","files":-1,"time":1286057680,"description":"The Topos of Music is the upgraded and vastly deepened English extension of the seminal German Geometrie der TÃƒÂ¶ne. It reflects the dramatic progress of mathematical music theory and its operationalization by information technology since the publication of Geometrie der TÃƒÂ¶ne in 1990. The conceptual basis has been vastly generalized to topos-theoretic foundations, including a corresponding thoroughly geometric musical logic. The theoretical models and results now include topologies for rhythm, melody, and harmony, as well as a classification theory of musical objects that comprises the topos-theoretic concept framework. Classification also implies techniques of algebraic moduli theory. The classical models of modulation and counterpoint have been extended to exotic scales and counterpoint interval dichotomies.\n\nThe probably most exciting new field of research deals with musical performance and its implementation on advanced object-oriented software environments. This subject not only uses extensively the existing mathematical music theory, it also opens the language to differential equations and tools of differential geometry, such as Lie derivatives. Mathematical performance theory is the key to inverse performance theory, an advanced new research field which deals with the calculation of varieties of parameters which give rise to a determined performance. This field uses techniques of algebraic geometry and statistics, approaches which have already produced significant results in the understanding of highest-ranked human performances.\n\nThe book's formal language and models are currently being used by leading researchers in Europe and Northern America and have become a foundation of music software design.","torrent":{"xt":"urn:btih:31c1853d2305c9b88f15ca57f28daa7b0fa7553a","amp;dn":"Guerino+Mazzola+-+The+Topos+of+Music%3A+Geometric+Logic+of+Concept","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31c1853d2305c9b88f15ca57f28daa7b0fa7553a","infoHashBuffer":{"type":"Buffer","data":[49,193,133,61,35,5,201,184,143,21,202,87,242,141,170,123,15,167,85,58]},"announce":[],"urlList":[]}}