{"title":"Democracy Now - 03 nov 2010","uid":5931676,"size":456025935,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:31db17f649ca5f38484f508bf14de9ea76a7c5f5&amp;dn=Democracy+Now+-+03+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1288798465,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 03, 2010\n\n- GOP Takes House, But Dems Keep Senate\n- Sen. Feingold Loses Re-Election Bid in Wisconsin\n- Tea Party Scores Senate Victories in Delaware, Florida\n- Boehner to Obama: &quot;Change Course&quot;\n- GOP Gains in 10 Gubernatorial Races\n- California Voters Reject Legalized Marijuana, Maintain Clear Air Rules\n- 76 Killed in Iraq Bombings\n- Report: BP Pipelines in Alaska Corrosive, Risk Explosion\n- Study: Deadly Chemicals Spread Widely After Spill\n- Bush Considered Dropping Cheney for Re-Election Bid\n\n\nSpecial reports\n\n- GOP Win Back House, Dems Keep Senate in 2010 Midterm Elections\n\nRepublicans took control of the House and made gains in the Senate in Tuesday's midterm elections, just four years after Democrats swept control of Congress. With thirteen races yet to be called, Republicans gained fifty-nine seats in the House, the party's largest win in congressional elections in more than a century. Analysts expect Democrats to maintain control of the Senate, but two key races have not yet been called: Democratic Sen. Michael Bennet vs. Republican Ken Buck in Colorado and Democratic Sen. Patty Murray vs. Republican Dino Rossi in Washington State.\n\n\n- EXCLUSIVE: Filmmaker Michael Moore on Midterm Elections, the Tea Party, and the Future of the Democratic Party\n\nFor the past twenty years, renowned filmmaker, author and activist Michael Moore has been one of the most politically active, provocative and successful documentary filmmakers in the business. Moore came to our studio last night for our special Election Night broadcast to discuss the tea party movement and the future of the Democratic and Republican parties.\n\n\n- Election Roundtable: Breaking Down the Results with Laura Flanders of GritTV, The Nation's Richard Kim &amp; John Nichols, and Journalist David Goodman\n\nThe midterm elections saw two key Senate victories for the Tea Party and major losses for the right-leaning Blue Dog Democrats. Meanwhile, the Senate lost one of its most progressive lawmakers with the ouster of Democrat Russ Feingold of Wisconsin. We get analysis from four guests: Laura Flanders, host of GritTV; Richard Kim, senior editor at The Nation magazine; John Nichols of The Nation magazine; and Vermont-based journalist and author David Goodman.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:31db17f649ca5f38484f508bf14de9ea76a7c5f5","amp;dn":"Democracy+Now+-+03+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31db17f649ca5f38484f508bf14de9ea76a7c5f5","infoHashBuffer":{"type":"Buffer","data":[49,219,23,246,73,202,95,56,72,79,80,139,241,77,233,234,118,167,197,245]},"announce":[],"urlList":[]}}