{"title":"Frankenstein (1931)[DVDRip][big_dad_e]","uid":5913686,"size":704869127,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:32bd17eb2463eecd270c4145b88abb36f0f9f238&amp;dn=Frankenstein+%281931%29%5BDVDRip%5D%5Bbig_dad_e%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"big_dad_e","files":-1,"time":1288149369,"description":"Frankenstein (1931)\n\nDirector: James Whale\n\nHenry Frankenstein (Colin Clive), an ardent young scientist, and his devoted assistant Fritz (Dwight Frye), a hunchback, piece together a human body, the parts of which have been secretly collected from various sources. Frankenstein's consuming desire is to create human life through various electrical devices which he has perfected.\n\nElizabeth (Mae Clarke), his fiancÃƒÂ©e, is worried to distraction over his peculiar actions. She cannot understand why he secludes himself in an abandoned watch tower, which he has equipped as a laboratory, and refuses to see anyone. She and her friend, Victor Moritz (John Boles), go to Dr. Waldman (Edward Van Sloan), his old medical professor, and ask Dr. Waldman's help in reclaiming the young scientist from his absorbing experiments. Elizabeth, intent on rescuing Frankenstein, arrives just as Henry is making his final tests. They all watch Frankenstein and the hunchback as they raise the dead creature on an operating table, high into the room, toward an opening at the top of the laboratory. Then a terrific crash of thunder, the crackling of Frankenstein's electric machines, and the hand of Frankenstein's monster (Boris Karloff) begins to move.\n\nThrough Fritz's error, a criminal brain was secured for Frankenstein's experiments which results in the monster knowing only hate, horror and murder. The manufactured monster despite its grotesque form, initially appears not to be a malevolent beast, but a simple, innocent creation. Frankenstein welcomes it into his laboratory, and asks his creation to sit, which it does. Fritz, however, enters with a flaming torch which frightens the monster. Its fright is mistaken by Frankenstein and Dr. Waldman as an attempt to attack them, and so it is taken to the dungeon where it is chained. Thinking that it is not fit for society, and will wreak havoc at any chance, they leave the monster locked up where Fritz antagonizes it with a torch. As Henry and Dr. Waldman consider the fate of the monster they hear a shriek from the dungeon. Frankenstein and Dr. Waldman rush in to find the monster has strangled Fritz. The monster makes a lunge at the two but they escape the dungeon, locking the monster inside. Realizing that the creature must be destroyed Henry prepares an injection of a powerful drug and the two conspire to release the monster and inject it as it attacks. When the door is unlocked the creature emerges and lunges at Frankenstein as Dr. Waldman injects the drug into the creature's back. The monster knocks Dr. Waldman to the floor and has nearly killed Henry when the drug takes effect and he falls to the floor unconscious.\n\nHenry leaves to prepare for his wedding while Dr. Waldman conducts an examination of the unconscious creature. As he is preparing to begin dissecting it the creature awakens and strangles him. It escapes from the tower and wanders through the landscape. It then has a short encounter with a farmer's young daughter, Maria, who asks him to play a game with her in which they playfully toss flowers into a lake and watch them float. The monster enjoys the game, but when they run out of flowers, tragedy occurs. Because of his defective brain, the monster thinks the little girl will float, so he picks her up and throws her into the lake, and the girl drowns. Realizing he has made a terrible mistake, the monster walks away feeling troubled and remorseful. This drowning scene is one of the most controversial in the film, with a long history of censorship.\n\nWith preparations for the wedding completed, Frankenstein is once again himself and serenely happy with Elizabeth. They are to marry as soon as Dr. Waldman arrives. Victor rushes in, saying that the Doctor has been found strangled in his operating room. Frankenstein suspects the monster. A chilling scream convinces him that the monster is in the house. When the searchers arrive, they find Elizabeth unconscious on the bed. The monster has escaped. He is only intent upon destroying Frankenstein.\n\nLeading an enraged band of peasants, Frankenstein searches the surrounding country for the monster. He becomes separated from the band and is discovered by the monster who, after the two stare each other down for a curious moment, attacks him. After a struggle, in which Frankenstein's torch fails to save him, the monster knocks Frankenstein unconscious and carries him off to the old mill. The peasants hear his cries and follow. Finally reaching the mill, they find the monster has climbed to the very top, dragging Frankenstein with him. In a burst of rage, he hurls the young scientist to the ground. His fall is broken by the vanes of the windmill, saving him from instant death. Some of the villagers hurry him to his home while the others remain to burn the mill and destroy the entrapped monster.\n\nLater, back at Castle Frankenstein, Frankenstein's father, Baron Frankenstein (Frederick Kerr) celebrates the wedding of his recovered son with a toast to a future grandchild.\n\nMedia Info:\nGeneral\nComplete name                    : C:\\Documents and Settings\\Owner\\Desktop\\Frankenstein (1931)[DVDRip][big_dad_e]\\Frankenstein (1931)[DVDRip][big_dad_e].avi\nFormat                           : AVI\nFormat/Info                      : Audio Video Interleave\nFile size                        : 672 MiB\nDuration                         : 1h 9mn\nOverall bit rate                 : 1 342 Kbps\n\nVideo\nID                               : 0\nFormat                           : MPEG-4 Visual\nFormat profile                   : Simple@L1\nFormat settings, BVOP            : No\nFormat settings, QPel            : No\nFormat settings, GMC             : No warppoints\nFormat settings, Matrix          : Default (H.263)\nCodec ID                         : DIVX\nCodec ID/Info                    : Project Mayo\nCodec ID/Hint                    : DivX 4\nDuration                         : 1h 9mn\nBit rate                         : 1 200 Kbps\nWidth                            : 720 pixels\nHeight                           : 480 pixels\nDisplay aspect ratio             : 4:3\nFrame rate                       : 29.970 fps\nStandard                         : NTSC\nResolution                       : 24 bits\nColorimetry                      : 4:2:0\nScan type                        : Progressive\nBits/(Pixel*Frame)               : 0.116\nStream size                      : 601 MiB (89%)\nWriting library                  : avc2.0.11.1110\n\nAudio\nID                               : 1\nFormat                           : MPEG Audio\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nCodec ID                         : 55\nCodec ID/Hint                    : MP3\nDuration                         : 1h 9mn\nBit rate mode                    : Constant\nBit rate                         : 128 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 48.0 KHz\nResolution                       : 16 bits\nStream size                      : 64.1 MiB (10%)\nAlignment                        : Aligned on interleaves\nInterleave, duration             : 24 ms (0.72 video frame)\nFile Scan:\nMalwarebytes' Anti-Malware 1.46\nwww.malwarebytes.org\n\nDatabase version: 4949\n\nWindows 5.1.2600 Service Pack 3\nInternet Explorer 8.0.6001.18702\n\n10/26/2010 5:13:09 PM\nmbam-log-2010-10-26 (17-13-09).txt\n\nScan type: Quick scan\nObjects scanned: 0\nTime elapsed: 10 second(s)\n\nMemory Processes Infected: 0\nMemory Modules Infected: 0\nRegistry Keys Infected: 0\nRegistry Values Infected: 0\nRegistry Data Items Infected: 0\nFolders Infected: 0\nFiles Infected: 0\n\nMemory Processes Infected:\n(No malicious items detected)\n\nMemory Modules Infected:\n(No malicious items detected)\n\nRegistry Keys Infected:\n(No malicious items detected)\n\nRegistry Values Infected:\n(No malicious items detected)\n\nRegistry Data Items Infected:\n(No malicious items detected)\n\nFolders Infected:\n(No malicious items detected)\n\nFiles Infected:\n(No malicious items detected)\n\nWhen using TPB please read these important notes:\n  \n01- Anti-malware apps may warn about keygens, patches, cracks, etc., because of \n    their capabilities, (generating codes, etc.). Sometimes they're added to \n    the virus/spyware database and will be detected as malware. If you don't trust\n    the keygens, patches, cracks, etc., don't use them. \n    \n02- Before running .exe-files, keygens, patches, cracks, etc., always check first \n    if they can be unpacked. Often some third party added a virus to the \n    original file, repacked it and uploaded it again.\n\n03- Letting anti-malware apps send scan results to their companies can cause\n    keygens, patches, cracks, etc., to be added to their virus-database.\n\n04- Firewalls which are set to automatically determine connections will allow \n    apps &amp; malware!. Avoid this by manually configuring your firewall.\n\n05- Usually (new) torrents with many downloads and seeders in a brief period is\n    suspicious! Torrents with the Skull &amp; Crossbones icon are trusted.\n\n06- Some people use multiple accounts and post fake comments \n    and/or files trying to spread confusion. They seldom seriously\n    comment or have any torrents, or a just a few to look passable.\n\n07- Clicking on unknown links can cause malware to be installed on your machine.\n  \n08- In general often there are more fake and negative comments than reliable and\n    positive comments.\n\n09- In some countries uploading/downloading copyright protected material is \n    forbidden, but showing some appreciation to reliable up-loaders is not.\n\n10- Posting fake and negative comments or fake/infected uploads on TPB can result\n    in getting banned from TPB!\n \n\nFor reporting bad or suspicious torrents:  &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor more of my torrents: &lt;a href=&quot;\nhttps://thepiratebay.se/user/big_dad_e/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/big_dad_e/&lt;/a&gt;  (Secured)\n\nAll torrents scanned with:\nNorton Anti-virus\nMalwarebytes' Anti-malware\n &lt;a href=&quot;\nhttp://www.pirate-party.us/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pirate-party.us/&lt;/a&gt;\n\nALWAYS SEED &amp; THANKS SEEDERS!\n\n","torrent":{"xt":"urn:btih:32bd17eb2463eecd270c4145b88abb36f0f9f238","amp;dn":"Frankenstein+%281931%29%5BDVDRip%5D%5Bbig_dad_e%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32bd17eb2463eecd270c4145b88abb36f0f9f238","infoHashBuffer":{"type":"Buffer","data":[50,189,23,235,36,99,238,205,39,12,65,69,184,138,187,54,240,249,242,56]},"announce":[],"urlList":[]}}