{"title":"Timmy-T Discography","uid":5739398,"size":526129381,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:337ad5889a5890f7c1b4271ef718127e41c1e3b2&amp;dn=Timmy-T+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ddawg","files":29,"time":1280945158,"description":"\n\nTimmy-T Discography\n\n\n[1990] Time After Time\n[1992] All for Love\n\n\n\nBorn Timothy Torres in Fresno, CA)\n\nIn 1991, the song &quot;One More Try&quot; was a very big hit - so big that it still is listed in the TOP 5 songs for that year on many charts. A No. 1 Billboard single, &quot;One More Try&quot; went platinum, selling well over one million copies in the United States and has achieved over 3 million radio plays in the United States.\n\nThe man behind the hit, Timmy T, was born on Sept 21, 1967 in Fresno, California. Timmy became interested in music at age 9. He learned to play piano and write songs by the age of 12.\n\nHe was in a local rap group under the name Timmy Tee.  &quot;I was writing music for various rappers but my heart was into dance music,&quot; Timmy says. &quot;I knew it was my calling. I spent $80 on a moog synthesizer and $250 on a Roland 808 drum machine in a local pawn shop, saved up a few bucks and went into a local studio in Fresno that was built in a garage. I wrote and recorded a song that was called &quot;Time After Time&quot; and took the tape to Los Angeles to make a demo 12 inch record. When I received the 250 copies, I began to deliver them on my motorcycle to various radio stations. I can recall them falling off the back of the bike one time and getting run over by a car that was behind me. I used to take the record to every club I could think of.&quot;\n\nTimmy finally got his big break when a Fresno radio station Hot 96 FM agreed to play his song. After it was played one time on the air, the phones lit up asking who this person was. Timmy had a hit on his hands.  The station's PD John Clay suggested a few more stations, and one of them was Power 106 in Los Angeles. Timmy decided to take the 200 mile drive to personally deliver his record.  He recalls: &quot;It  was after hours and I had to ring the buzzer to let the DJ know I had a package for them. He told me to leave it by the door and he would come down and get it. I signed a picture that said &quot;Please Play My Record&quot; and left a couple of copies.&quot;\n\nAbout a week later, Timmy's friends were calling to say they heard his song on the L.A. station. From then on it was a domino effect. He began getting calls from radio station PDs all over the country wanting a copy. With literally no funds to support this endeavor, Timmy hooked up with a local backer who put him on his local record label. A couple of months later, Timmy got a call from Quality Records and the rest is history!\n\nIn the wake of the phenomenal success of &quot;One More Try&quot;, the dance hit, &quot;Time After Time&quot;, was sometimes overlooked and Timmy was often unfairly labeled a &quot;one hit wonder&quot;.  &quot;Time After Time&quot; made the Billboard Top 40 and went gold, selling over a half million copies. Timmy T has sold millions of records worldwide.\n\nHis string of hits continued with songs such as &quot;What Will I Do&quot;, &quot;Cry A Million Tears&quot;, &quot;Too Young To Love You&quot; and &quot;Paradise&quot;. You can hear Timmy's hit song &quot;Over You&quot; on the motion pictures soundtrack of &quot;The Raffle&quot;, which included such other artists such as Elton John and Michael Damian.\n\nTimmy has toured throughout the world, entertaining millions of fans in the United States, Canada and Mexico, as well as Belgium, Holland, Germany, England, Japan and many others venues.\n\nHe has performed with such notables as Frankie J, Baby Bash, Michael Bolton, MC Hammer, Boys to Men, Mariah Carey, Amy Grant, Celine Dion, to name but a few. His television credits include Regis &amp; Kathy Lee, The Home Show with Gary Collins, The Joan Rivers Show, Into the Night starring Rick Dees, The Paul Rodriquez Show, CNN, Dance Party U.S.A., Personalities, The Party Machine starring Nia Peeples, A.M. Los Angeles and many others.\n\nCurrently hard at work on his latest soon to be released CD, Timmy continues to tour across the country, singing his latest songs along with his timeless 90s hits, gaining new fans everywhere he appears\n","torrent":{"xt":"urn:btih:337ad5889a5890f7c1b4271ef718127e41c1e3b2","amp;dn":"Timmy-T+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"337ad5889a5890f7c1b4271ef718127e41c1e3b2","infoHashBuffer":{"type":"Buffer","data":[51,122,213,136,154,88,144,247,193,180,39,30,247,24,18,126,65,193,227,178]},"announce":[],"urlList":[]}}