{"title":"Lordi - Hard Rock Hallelujah (Live) (2nafish)","uid":5921280,"size":188137476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:344504195c4fb4d1ffcac545a029a970c9325fbc&amp;dn=Lordi+-+Hard+Rock+Hallelujah+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1288429091,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo.\n\n\n&quot;Hard Rock Hallelujah&quot; is a song by the Finnish heavy metal band Lordi, which won the 2006 Eurovision Song Contest with 292 points. It was also Finland's first placement in the top five. It was voted as the most popular Finnish Eurovision entry in the forty years the country has participated. It held the record for most points until it was beaten by &quot;Fairytale&quot; by Alexander Rybak of Norway with 387 points three years later. &quot;Hard Rock Hallelujah&quot; was also released as a single in 2006, reaching the #1 spot in Finland and also peaking in the UK Top 40 at #25.\n\nThe semifinal and final performances of &quot;Hard Rock Hallelujah&quot; at the 2006 Eurovision Song Contest were similar; the lead singer, Mr. Lordi, stated before the final that the only planned changes were that &quot;We'll scream louder. And turn the amps up.&quot; The performance took place on a fairly bare Eurovision stage, with banks of video monitors in the back displaying abstract images of fire, and the band in their usual monster costumes.\n\nMr. Lordi, the lead singer, performed the first verse while wearing a top hat with the flag of Finland on it; he also wielded a microphone, the handle of which was attached to the handle of a two-headed battle axe. During the final verse, while he was singing the lyric &quot;Wings on my back / Got horns on my head&quot;, a set of large, bat-like wings unfolded from Mr. Lordi's back. During the whole performance, the band members remained relatively stationary, with the exception of guitarist Amen, who hopped back and forth energetically. Drummer Kita and keyboard player Awa generally remained behind their instruments, bassist OX stayed by his microphone, and Mr. Lordi wore very large platform shoes.\n\nThe song had frequent use of pyrotechnics, starting with flames bursting from the stage during the song's introduction, and bursts of sparks, particularly during the chorus. The final chorus of the song had an extended pyrotechnic display, with the whole stage covered in sparks, including jets shooting from the ends of the guitar and the bass as they were being played, and from the two-headed axe (now detached) that Mr. Lordi held up above his head.\n\nThe encore performance after they were announced the winners was much simpler, as the pyrotechnics were obviously not available and Mr. Lordi's wings did not unfurl.\n\nOn 26 May 2006 the Guinness World Record of karaoke singing was broken when approximately 80,000 people gathered to sing &quot;Hard Rock Hallelujah&quot; in Helsinki, Finland, to celebrate victory in Eurovision.\n\nLordi is a Finnish hard rock band, which was formed in 1996 by the band's lead singer, songwriter and costume-designer, Mr. Lordi. The band is known for wearing monster masks and using pyrotechnics during concerts.\n\nLordi made history in 2006 by winning the Eurovision Song Contest with a record 292 points, becoming the first Finnish band to win the contest. Lordi was featured on the 2006 MTV Europe Music Awards in Copenhagen when the band's frontman, Mr. Lordi, presented the award for rock. They were also the closing act, playing their single &quot;Hard Rock Hallelujah&quot;. They also performed on Britain's Making Your Mind Up for the Eurovision Song Contest. Lordi performed on the main stage at Ozzfest 2007 and later that year toured with Type O Negative and Twin Method until Halloween night.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:344504195c4fb4d1ffcac545a029a970c9325fbc","amp;dn":"Lordi+-+Hard+Rock+Hallelujah+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"344504195c4fb4d1ffcac545a029a970c9325fbc","infoHashBuffer":{"type":"Buffer","data":[52,69,4,25,92,79,180,209,255,202,197,69,160,41,169,112,201,50,95,188]},"announce":[],"urlList":[]}}