{"title":"Brandon Flowers - Crossfire (2nafish)","uid":5755001,"size":117233668,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:349d953ea0bfb5e84dbf9c6b4910a3f25cd06cd3&amp;dn=Brandon+Flowers+-+Crossfire+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1281537373,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\n&quot;Crossfire&quot; is the debut solo single from singer-songwriter and frontman of The Killers, Brandon Flowers. Written by Flowers himself, and produced by Brendan O'Brien, it is the first single from his debut solo album, Flamingo.\n\n&quot;Crossfire&quot; first appeared when it was leaked online on June 11, 2010. On June 14, it was premiered in the UK on the Zane Lowe Show on BBC Radio 1, where Flowers also gave an interview,\n\nFlowers said that it is his son Ammon's favourite song on the album.\n\nThe video for the single was released on July 8, 2010 through the VEVO video service. It was directed by Nash Edgerton and features Charlize Theron.\n\nA 10 inch picture disc vinyl was released in the US on August 3rd 2010 , featuring an acoustic version of On The Floor titled 'On The Floor 2.0' as B-side.\n\nFlamingo is the debut studio album by American singer/songwriter and The Killers frontman Brandon Flowers, which is set to be released on September 6, 2010 in the UK and September 14, 2010 in the US. It was recorded in Battle Born Studios, Las Vegas, Nevada, and Henson Recording Studios, Hollywood, California.\n\nIn December 2009, rumours began to circulate about a possible Brandon Flowers solo album, although these stories were initially denied by the band's representatives and Flowers himself.  In January 2010, The Killers announced that they would go on a &quot;hiatus&quot; after the Australia and Asia leg of their world tour in support of Day &amp; Age, with guitarist Dave Keuning pointing to the fact that they've been working non-stop for six years and need &quot;a little bit of time off&quot;.  However, citing &quot;unforeseen circumstances involving a serious illness of a close family member&quot;, a number of tour dates were postponed. It later emerged that Flowers' mother died of brain cancer on February 11th 2010\n\nAfter a mysterious countdown on the Killers official website, Flowers confirmed on April 29, 2010 that he would be releasing a solo album entitled Flamingo. The album is named after the Flamingo Casino &amp; Flamingo Road (on which Sam's Town Casino can be found) which is in Brandon's hometown of Las Vegas and an area of town where Brandon spent much of his growing up years.\n\nIn an interview with NME magazine in May 2010, Flowers stated that the album was produced by Stuart Price, Daniel Lanois and Brendan O'Brien. He also said that the song &quot;Hard Enough&quot; features a duet with Rilo Kiley frontlady Jenny Lewis.\n\nOn the weekend of June 12, 2010, the song &quot;Crossfire&quot; was leaked online. On June 14 the song was premiered in the UK on the Zane Lowe Show on BBC Radio 1. Flowers told Zane Lowe that despite being joined by three producers, it felt &quot;weird&quot; without The Killers and their way of doing things, and that while he had fun making the album, recording the album was a &quot;lonely&quot; process at times. Flowers also reassured fans that this does not mean the end of The Killers, citing bandmate Ronnie Vannucci's occasional presence in the studio and drumming work on the album. &quot;Crossfire&quot; was released on June 21, 2010[ in the United States and Canada via iTunes. It will be released in the United Kingdom on August 23, 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:349d953ea0bfb5e84dbf9c6b4910a3f25cd06cd3","amp;dn":"Brandon+Flowers+-+Crossfire+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"349d953ea0bfb5e84dbf9c6b4910a3f25cd06cd3","infoHashBuffer":{"type":"Buffer","data":[52,157,149,62,160,191,181,232,77,191,156,107,73,16,163,242,92,208,108,211]},"announce":[],"urlList":[]}}