{"title":"Ray&amp;Guzzo-Environmental Overkill(expose of environmentalist agen","uid":5743495,"size":955775,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:355cfb7cd6541c54791e7ba6f4ee9df071fc3c2a&amp;dn=Ray%26Guzzo-Environmental+Overkill%28expose+of+environmentalist+agen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"red_gonzo","files":1,"time":1281111655,"description":"This is Dixie Lee Ray's and Lou Guzzo's mindblowing book Environmental Overkill - Whatever Happened to Common Sense? (1993) which challenges the environmental prophets of doom and gloom with penetrating searing truth and exposes the fraud and deceit being perpetrated against an unknowing public. Dr. Dixy Lee Ray illustrates how good stewardship of the environment, scientific honesty, and even constitutional liberties based on property rights are being consciously endangered by environmental extremists, scare-mongering journalists, media-conscious scientists, &quot;visionary&quot; politicians, power-hungry bureaucrats, big business leaders, and rapacious lawyers. Who loses? We all do, especially when we allow the people who actually live on the land - small farmers, fishermen, people who live in the open spaces - to have their livelihoods, and indeed their very towns and communities, callously prosecuted into oblivion by lawyers and bureaucrats in Washington. The authors tell you what actually happened at the Earth Summit in Rio and also take a close look at the environmentalism of former US Vice President Al Gore. Above all, this book will help you make your own informed decisions on air pollution, global warming, endangered species, wetlands, overpopulation, and other contentious environmental issues. For readers who want to understand the scientific and political realities of environmental issues, Environmental Overkill is the best and most straightforward analysis around as it exposes the hard truth that the agenda and goals of political environmentalism are antithetical to conscientiousness, responsibility, enlightenment or humanity. 250 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:355cfb7cd6541c54791e7ba6f4ee9df071fc3c2a","amp;dn":"Ray%26Guzzo-Environmental+Overkill%28expose+of+environmentalist+agen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"355cfb7cd6541c54791e7ba6f4ee9df071fc3c2a","infoHashBuffer":{"type":"Buffer","data":[53,92,251,124,214,84,28,84,121,30,123,166,244,238,157,240,113,252,60,42]},"announce":[],"urlList":[]}}