{"title":"Democracy Now - 01 oct 2010","uid":5860670,"size":453794577,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:35b51fd94fdd6ae64e1d57b6a8eb73e53c039e19&amp;dn=Democracy+Now+-+01+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1285956673,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 01, 2010\n\n- Ecuador in State of Emergency After Attack on Correa\n- NATO Tankers Set Ablaze in Pakistan\n- Video Shows Apparent Executions by Pakistani Forces\n- Report: 4 Afghan Children Killed in NATO Attack\n- Emanuel to Leave White House for Mayoral Run in Chicago\n- Obama Meets With Freed U.S. Hiker\n- Report: Israel Rejects U.S. Incentives to Extend Settlement Freeze\n- U.S. Wins Pledges From Energy Companies to Cut Iran Ties\n- 4 Iraq, Afghan War Vets Commit Suicide at Fort Hood\n- Whitman Accused of Hypocrisy on Hiring Undocumented Workers\n- Progressive Groups to Hold &quot;One Nation Working Together&quot; Rally in D.C.\n\n\nSpecial reports\n\n- Ecuador Declares State of Emergency as President Correa Escapes Attack From Rogue Armed Forces\n\nEcuadorian President Rafael Correa is denouncing what he calls an attempted coup against him by members of Ecuador's armed forces. Protesting police and armed forces stormed congress, blocked roads and took control of the airport. Correa was trapped inside a hospital for twelve hours before armed forces loyal to him stormed the building and rescued him.\n\n\n- Lenders Forced to Suspend Thousands of Foreclosures After Admitting to Faulty Review Process\n\nThe banking industry's handling of home foreclosures is coming under increasing scrutiny after revelations that employees at several lenders had approved thousands of foreclosures affidavits and other documents without proper vetting. The banking giant JPMorgan Chase has suspended some 56,000 foreclosures after admitting some may have been authorized without proper review. Last week another major lender Ally Financial, suspended evictions in 23 states. We speak to Andy Kroll of Mother Jones magazine and New York Supreme Court Justice Arthur Schack, who has made national headlines for rejecting dozens of foreclosure filings due to faulty paperwork from banks and lenders.\n\n\n- &quot;Waiting for Superman&quot;: Critics Say Much-Hyped Education Documentary Unfairly Targets Teachers Unions and Promotes Charter Schools\n\n&quot;Waiting for Superman&quot;, a new documentary by filmmaker Davis Guggenheim, has caused a stir in the education world for its sweeping endorsement of the charter school movement and attack on teachers unions. President Obama has endorsed the film describing it as &quot;heartbreaking&quot; and &quot;powerful&quot; but some teachers have called for a boycott of the film for its portrayal of teachers and the teachers union. We speak to Rick Ayers, founder of the Communication Arts and Sciences program at Berkeley High School and adjunct professor in teacher education at the University of San Francisco.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:35b51fd94fdd6ae64e1d57b6a8eb73e53c039e19","amp;dn":"Democracy+Now+-+01+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35b51fd94fdd6ae64e1d57b6a8eb73e53c039e19","infoHashBuffer":{"type":"Buffer","data":[53,181,31,217,79,221,106,230,78,29,87,182,168,235,115,229,60,3,158,25]},"announce":[],"urlList":[]}}