{"title":"Grease [Multi5]","uid":5844248,"size":67147161,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:35fec087fe807899df54a62b64398dfad14efa68&amp;dn=Grease+%5BMulti5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chusca","files":3,"time":1285095824,"description":"El High School Musical original, una historia que dio origen a innumerables fiestas de adolescentes y que cautivÃƒÂ³ a millones de fans en todo el mundo, tiene ahora un juego oficial para la consola Nintendo DS. Ã‚Â¡PrepÃƒÂ¡rate para no dejar de usar el lÃƒÂ¡piz tÃƒÂ¡ctil, porque Grease ha venido para quedarse!\nCorre el verano de 1957. Piensa en cines al aire libre, heladerÃƒÂ­as y en reinas del rock and roll adolescentes con faldas de vuelo que mascan chicle y van en patines. Danny y Sandy se han conocido durante las vacaciones y se han enamorado. Cuando el verano llega a su fin, ambos se ven obligados a separarse y volver a sus vidas normales, a miles de kilÃƒÂ³metros de distancia. En su lugar de origen, Danny es el tÃƒÂ­pico &quot;chico malo&quot; atractivo, al que solo interesan los coches, las chicas y las bravuconadas con sus amigos. Sandy, sin embargo, es una dulce &quot;niÃƒÂ±a bien&quot; que forma parte del equipo de animadoras de su colegio. Cuando el destino hace que Sandy sea la nueva alumna en el instituto al que va Danny, vuelven a saltar chispas entre ellos. Tan enamorados como durante el verano, los dos tendrÃƒÂ¡n que descubrir cÃƒÂ³mo seguir juntos a pesar de las expectativas de sus amigos y los estereotipos existentes. Grease es una clÃƒÂ¡sica historia de amor, compromiso y decisiones que pueden marcar una vida.\nEntra en el instituto Rydell, donde encontrarÃƒÂ¡s a los T-Birds, las Pink Ladies y otros grupos y pandillas de estudiantes y donde no necesitarÃƒÂ¡s llorar a la almohada si no consigues llevar el ritmo. En este enÃƒÂ©rgico y rÃƒÂ­tmico juego de acciÃƒÂ³n, podrÃƒÂ¡s ponerte en la piel de tus personajes favoritos de Grease y participar en concursos de baile en varios lugares representativos del entorno del instituto. A medida que avanzas en el juego, podrÃƒÂ¡s desbloquear nuevos trajes para Danny y Sandy y aprender las canciones y coreografÃƒÂ­as de la pelÃƒÂ­cula original. Si cuentas con una Nintendo DSi, puedes sacarte una foto y participar en el juego como uno de los personajes. En el modo Story, podrÃƒÂ¡s revivir los memorables momentos de la pelÃƒÂ­cula en orden cronolÃƒÂ³gico. En el modo Quick Play puedes acceder directamente a tus momentos favoritos. TambiÃƒÂ©n puedes jugar con un amigo, gracias al modo Multijugador.\nGrease para Nintendo DS llega de la mano de 505 Games y tiene la licencia oficial de Paramount Digital Entertainment. Contiene 10 composiciones clÃƒÂ¡sicas del musical homÃƒÂ³nimo que los fans reconocerÃƒÂ¡n y corearÃƒÂ¡n.\n-Juega solo o con un amigo utilizando el Juego multitarjeta o la modalidad Descarga DS.\n-Compite en concursos de baile en el entorno del instituto Rydell.\n-Aprende las letras y los pasos de baile de 10 famosas canciones de Grease.\n\n\n\n\n","torrent":{"xt":"urn:btih:35fec087fe807899df54a62b64398dfad14efa68","amp;dn":"Grease+%5BMulti5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35fec087fe807899df54a62b64398dfad14efa68","infoHashBuffer":{"type":"Buffer","data":[53,254,192,135,254,128,120,153,223,84,166,43,100,57,141,250,209,78,250,104]},"announce":[],"urlList":[]}}