{"title":"20101014-Stossel-[The Power to Prosper]-Fox Business.CF.avi","uid":5888384,"size":270331770,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:36514a332493fcf43f824e82c7b4be397112de61&amp;dn=20101014-Stossel-%5BThe+Power+to+Prosper%5D-Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1287138986,"description":"STOSSEL - The Power to Prosper - Fox Business Network\n2010, October 14, Thursday\n\nXvid/MP3 AVI\n\n-----\nI've archived older shows offline and am no longer root seed. If you're unable to get seeded for shows prior to mid-September, post a comment in my most recent STOSSEL listing, and I'll reseed for you! Expect a 1-2 day delay.\n\nCurrently reseeding: 20100708, 20100617\n-----\n\n[excerpted from John Stossel's blog]\n\nOctober 13, 2010 01:31 PM UTC by John Stossel\nThis Week's Show: Why is America Rich?\n\nWhy is America ... rich? That's the question I ask on this week's show (Thursday @ 9pm ET on FBN). Of course, many American don't feel particularly &quot;rich&quot; at the moment,  but if you look at the most of the world, America is rich. In fact, for most of human history, poverty has been the norm. What did America and other wealthy countries do that the rest of the world didn't?\n\nTwo things: they offered their citizens rule of law and economic freedom. Countries that leave their people free to acquire property, start businesses, and trade in a secure legal and political environment are blessed with prosperity. You can see this in the Economic Freedom Index compiled by the Heritage Foundation and the Wall Street Journal: The freest countries are invariably the most prosperous.\n\nIn my show and syndicated column this week, Bill Beach from Heritage points out that while America remains in the top 10 of  freest countries, it has not been making progress:\n\n&quot;For first time in 16 years, the United States fell from the 'totally free' to 'mostly free' group. That's a terrible development,&quot; he said. He fears that if this continues, productive people will leave the United States for freer pastures.\n\n&quot;The United States has been this magnet for three centuries. But today money and people can move quickly, and in less than a lifetime a great country can go by the wayside.&quot;\n\nWhy is the United States falling behind? &quot;Our spending has been excessive. ... We have the highest corporate tax rate in the world.\n(Government) takeovers of industries, subsidizing industries ... these are the kinds of moves that happen in Third World countries. ...&quot;\n\nBeach adds that the rule of law declined when the Obama\nadministration declared some contracts to be null and void. For example, bondholders in the auto industry were forced to the back of the creditor line during bankruptcy. And there's more regulation of business, such as the Dodd-Frank law for the financial industry and the new credit-card law. But how could the United States place behind Canada? Isn't Canada practically a socialist country?\n\n&quot;Canada might do health care the wrong way,&quot; Beach said, &quot;but by and large they do things the right way.&quot; Lately, Canada has lowered tax rates and reduced spending.\n\nFull column here.\n\nAlso on my FBN show, Sallie James of the Cato Institute will debate the recipe for prosperity and justice with Columbia University Marc Lamont Hill. Ugandan journalist Andrew Mwenda will discuss why government foreign aid to poor countries doesn't work and George Mason University law professor Karol Boudreaux will explain what does work. That's Thursday @ 9pm ET.\n","torrent":{"xt":"urn:btih:36514a332493fcf43f824e82c7b4be397112de61","amp;dn":"20101014-Stossel-%5BThe+Power+to+Prosper%5D-Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36514a332493fcf43f824e82c7b4be397112de61","infoHashBuffer":{"type":"Buffer","data":[54,81,74,51,36,147,252,244,63,130,78,130,199,180,190,57,113,18,222,97]},"announce":[],"urlList":[]}}