{"title":"Van Halen - When It's Love  (2nafish)","uid":5689524,"size":203325444,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:373257360aa48031b933d6c90a08b2337fe71a37&amp;dn=Van+Halen+-+When+It%5C%27s+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1279013593,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;When It's Love&quot; is a song recorded by Van Halen. It was released as a single from their album OU812. It was the most popular song from that album, hitting #1 on the Billboard  Album Rock Tracks charts and #5 on the Billboard Hot 100 chart. The song has been a live performance staple since it was released in 1988. The song was also included in the set list for the band's ill-fated 1998 tour with Gary Cherone. Eddie has stated that this particular guitar solo is a nod to Eric Clapton.\n\nIt was featured on a VH1 special, &quot;The Greatest: 25 Greatest Power Ballads,&quot; where it was ranked as the 24th greatest power ballad of all time.\n\nOU812 is the eighth album by American  hard rock band Van Halen, released in 1988. The album title is allegedly a joke on Van Halen's previous lead singer David Lee Roth's 1986 album Eat 'Em and Smile (OU812 translates phonetically to &quot;Oh, you ate one too?&quot;). However, &quot;OU812&quot; was also seen in the 70s sitcom Taxi written on a wall. The first person to use the phrase was Redd Foxx. Furthermore, &quot;OU812&quot; is the license plate on the red Ferrari that Cheech and Chong drive in Cheech &amp; Chong's Next Movie  (released in 1980).\n\nVan Halen started work on the album in September 1987; the album would be finished in April 1988, just one month before its release.\n\nThe original European release (as shipped in France, Germany, Italy and the UK) is missing track 10, as are all vinyl pressings of the album. The CD and some cassette versions have Track 10. The track listing on the back cover is arranged in alphabetical order, instead of in sequence.\n\nThe album is dedicated to Eddie's and Alex's father, Jan, who died in December 1986 at the age of 66. The inner linings of the album include the words, &quot;This one's for you, Pa.&quot; Jan Van Halen had previously appeared playing clarinet on one track, &quot;Big Bad Bill (Is Sweet William Now),&quot; on Van Halen's 1982 album, Diver Down.\n\nThe title of this album inspired Massachusetts hardcore punk/crossover thrash band Gang Green to name an EP I81B4U.\n\nDespite being the second track on the album, &quot;When It's Love&quot; was the very first song Van Halen worked on. Upon entering the studio, Sammy listened to the piano and drum tracks of the song by Eddie and Alex from the night before. After giving it a listen over and over again, Sammy came up with the lyrics and melodies and it fell into place.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:373257360aa48031b933d6c90a08b2337fe71a37","amp;dn":"Van+Halen+-+When+It%5C%27s+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"373257360aa48031b933d6c90a08b2337fe71a37","infoHashBuffer":{"type":"Buffer","data":[55,50,87,54,10,164,128,49,185,51,214,201,10,8,178,51,127,231,26,55]},"announce":[],"urlList":[]}}