{"title":"Hogan's Goat (TV) [1971] Faye Dunaway","uid":5887879,"size":734183454,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3736396168a06e41a3a62fe6c862393ce22f81be&amp;dn=Hogan%5C%27s+Goat+%28TV%29+%5B1971%5D+Faye+Dunaway&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1287124950,"description":" &lt;a href=&quot;http://bayimg.com/AapFOaAcN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/AapFOaAcN&lt;/a&gt;\n\nGreat Performances  \nHogan's Goat (TV) (1971) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0067207/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0067207/&lt;/a&gt;\n\nHogan's Goat is an award-winning 1965 play by William Alfred.\n\n  Philip Bosco  ...  Father Coyne  \n  Kevin Conway  ...  Peter Boyle  \n  John Devlin  ...  Confessional Priest  \n  Faye Dunaway  ...  Kathleen Stanton  \n  Robert Foxworth  ...  Matt Stanton  \n  Margaret Linn  ...  Bessie  \n  Rue McClanahan  ...  Josey Finn  \n  Biff McGuire  ...  Murphy  \n  Patrick McVey  ...  Haggerty  \n  George Rose  ...  Quinn  \n  Betty Sinclair  ...  Ann Mulcahy  \n  Margaret Sinclair  ...  Bessie Legg  \n  Dee Victor  ...  Maria  \n\n\nThe blank-verse drama concerns a mayoral contest between Irish Americans in Brooklyn, New York in 1890. The play's focus is on the personal life of Matthew Stanton, the dynamic leader of the Sixth Ward, who hopes to unseat corrupt incumbent Ned Quinn. Stanton's wife Kathleen fears campaign publicity will reveal that they never were married in the Catholic Church, a fact uncovered by Quinn, who also discovers Stanton was once the &quot;kept man&quot; (known as a &quot;goat&quot; in the lexicon of the time) of Agnes Hogan, Quinn's ex-girlfriend who is now on her deathbed. Blinded by ruthless ambition, Stanton ignores Quinn's threats to reveal his past and forges ahead with the race, ultimately destroying not only his political career, but his marriage as well.\n\nDirected by Frederick Rolf, the off-Broadway production opened on November 11, 1965 at the Theater at St. Clement's Church, then moved to the East 74th Street Theatre where it ran for 607 performances. \n\nIn 1970 Alfred  wrote the teleplay for a television movie directed by Glenn Jordan. The PBS broadcast starred Robert Foxworth as Stanton, Dunaway as Kathleen, and George Rose as Quinn, with Philip Bosco, Kevin Conway, and Rue McClanahan in supporting roles.\n\nWritten as a well developed melodrama, this play by William Albert is so magnificently acted that it ultimately achieves the power and resonance of true tragedy. Faye Dunaway, who first played the role of Kathleen Stanton in New York in 1965, reprises her role in this 1971 teleplay, and all eyes are on her for the entire play. Set in 1890, with period costuming and sets, this production, beautifully directed by Glenn Jordan, maintains the intense, almost claustrophobic feeling of the stage play.\n\nFilled with the passion of political, social, religious, and personal conflicts, the play deals with the theme of pride and the foolish sacrifices men make for it, with all the action seen as conflicting with honor, a belief in larger values. Dunaway conveys a remarkable combination of vulnerability and strength, and Foxworth, the ambiguity of a man who loves her but desperately wants power. Bosco, as the priest, reflects the hard-line morality which underlies the play, and Rose, as the mayor, is as venal as they come. \n\nThe casting is ideal, and the acting is superb, with each cast member controlling the tempo of his/her role and carefully avoiding over-acting in potentially melodramatic scenes. The full details of the relationship of Agnes Hogan and Matt Stanton are gradually revealed in a shocking conclusion. As the various characters are brought low by their pride but recognize their failings, the play achieves the status of true tragedy.\n","torrent":{"xt":"urn:btih:3736396168a06e41a3a62fe6c862393ce22f81be","amp;dn":"Hogan%5C%27s+Goat+%28TV%29+%5B1971%5D+Faye+Dunaway","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3736396168a06e41a3a62fe6c862393ce22f81be","infoHashBuffer":{"type":"Buffer","data":[55,54,57,97,104,160,110,65,163,166,47,230,200,98,57,60,226,47,129,190]},"announce":[],"urlList":[]}}