{"title":"STEVE McQUEEN The Essence of Cool (TV) (VHS) [2005]","uid":5739758,"size":876325449,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:374fd64086fd76c3a12054cbede0a1c550a93637&amp;dn=STEVE+McQUEEN+The+Essence+of+Cool+%28TV%29+%28VHS%29+%5B2005%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1280959443,"description":" &lt;a href=&quot;http://bayimg.com/NAOmcaACb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/NAOmcaACb&lt;/a&gt;\n\nSteve McQueen: The Essence of Cool (2005) (TV) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0430874/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0430874/&lt;/a&gt;\n\nHe was a legendary movie star who could move effortlessly from playing a brooding, rugged antihero to a suave, sophisticated leading man. He was also one of the most popular and highest-paid actors of his generation. And despite passing away a quarter century ago, he can still be seen in current advertising for Ford's 2005 Mustang and Tag Heuer watches, and Sheryl Crow sings about him in her GrammyÃ‚Â®-winning song &quot;Steve McQueen,&quot; currently heard in Wrangler Jeans ads. In a word, Steve McQueen was - and still is - cool. In a year that marks the 75th anniversary of his birth and the 25th anniversary of his death, Turner Classic Movies explores the life and career of this stylish tough guy in STEVE McQUEEN: THE ESSENCE OF COOL (2005). \n\nSTEVE McQUEEN: THE ESSENCE OF COOL reveals shrouded facets of the often inscrutable man who was voted &quot;the most popular male star&quot; in 1968. Written, directed and produced by Mimi Freedman of the Greif Company, the 87-minute documentary touches on his troubled childhood, family life, infidelity, drug use, thrill-seeking, self-doubt and burning desire to be good at his craft and achieve super stardom. His life story is told through first-person accounts of those who admired him and knew him best. Interviews include such co-stars as Suzanne Pleshette, LeVar Burton, Richard Attenborough, Martin Landau, Eli Wallach and Robert Culp, as well as such directors as Robert Relyea, Lawrence Kasdan, Norman Jewison and Peter Yates. Also included are interviews with family, friends and stuntmen, all of whom share their first person accounts of McQueen the man and the actor, both on and off-set. \n\nBW &amp; C-87m. Letterboxed. Closed captioning. ","torrent":{"xt":"urn:btih:374fd64086fd76c3a12054cbede0a1c550a93637","amp;dn":"STEVE+McQUEEN+The+Essence+of+Cool+%28TV%29+%28VHS%29+%5B2005%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"374fd64086fd76c3a12054cbede0a1c550a93637","infoHashBuffer":{"type":"Buffer","data":[55,79,214,64,134,253,118,195,161,32,84,203,237,224,161,197,80,169,54,55]},"announce":[],"urlList":[]}}