{"title":"Marvel - Portraits of a Universe","uid":5693757,"size":51957979,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3793b3e8d205e6d13ae6def30f5e32bec5bdf967&amp;dn=Marvel+-+Portraits+of+a+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brodahisou","files":4,"time":1279185310,"description":"Marvel: Portraits of a Universe was a four-issue mini-series from 1995 that had contemporary artists paint their renditions of classic Marvel moments, complete with narration.  The scenes were chosen not so much for their historical importance as they were for being able to convey a strong image.\n\nWritten by Stan Lee, Peter David, Walt Simonson and Scott Lobdell.  \n\nArtist include Alan Craddock, Bob Larkin, Bret Blevins, Colin MacNeil, Dave Gibbons, Dennis Calero, John Estes, John Van Fleet, Ken Steacy, Kev Walker, Lou Harrison, Mark A. Nelson, Nick Percival, Ricardo Villagran, Simon Bisley, Terese Nielsen, Mark A. Nelson, Bret Blevins, Angus McKie, Ray Lago, Michael Okamoto, Ken Steacy, Simon Bisley, Bob Wakelin, Mark Evans, Jose Pimentel, Paul Johnson, Christopher Moeller, John Watkiss, Ken Meyer Jr., Dan Brereton, Hector Gomez, Tristan Schane, Roger Vilela, Bob Fingerman, Ray Lago, Lou Harrison, Vincent Deighan, Paul Johnson, Scott Hampton, Cliff Nielsen, Dennis Calero, Kieron Dwyer, Rebecca Guay, John Higgins, Brian Ashmore, Glenn Kim, Lou Harrison, Simon Bisley, Doug Gregory, Vince Evans, Bret Blevins, Dan Lawlis, Joseph Phillips, Tony Luke, Steve Sampson, Ariel Olivetti and Christopher Moeller.\n\n\nReleased on &lt;a href=&quot; http://ComicPirates.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://ComicPirates.info&lt;/a&gt;","torrent":{"xt":"urn:btih:3793b3e8d205e6d13ae6def30f5e32bec5bdf967","amp;dn":"Marvel+-+Portraits+of+a+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3793b3e8d205e6d13ae6def30f5e32bec5bdf967","infoHashBuffer":{"type":"Buffer","data":[55,147,179,232,210,5,230,209,58,230,222,243,15,94,50,190,197,189,249,103]},"announce":[],"urlList":[]}}