{"title":"DTP Tools","uid":5877111,"size":2346991971,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:386b07f6f8809f7ddc8ef832aabd2eed4cd0c3d7&amp;dn=DTP+Tools&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmbmhs","files":13,"time":1286678881,"description":"1. Adobe pagemaker 7 - Yes, the king of text editors.\n\n2. Microsoft Office 2007 - Next to pagemaker when text editing is concerned. A minimum of \n\nXP with service pack 2 will suffice, whereas Office 2010 requires XP with Service pack 3.\n\n3. Open Office oxygen - The Poor man's office.\n\n4. Softmaker office - May not be that useful, but small and handy.\n\n5. Corel Office X4 - PDF made easy. Scan PDF files as a OCR and edit them iin text mode.\n   WORD and EXCELL are better options though.\n\n6. PDF tools :\n   1. Foxit reader - Very much lightweight. Preferable to the heavyweight, Acrobat reader.\n   2. Ghostscript - Just install.\n   3. CuteWriter - Install after Ghostscript is installed and use as a printer to save \n      text files as PDF from any text editor.\n\n7. 150 Handwriting fonts\n\n8. Fontographer - design your own fonts. Tiresome job though. We must be faithful to the \n   Font developers.\n\n9. Mathtype - Type in mathematical symbols and signs and equation etc.\n\n10. 602Pro PC SUITE - 602Pro PC Suite is an integrated office suite that is compatible \n\nwith Microsoft Office documents (types DOC/XLS), and is designed for computers running \n\nWindows 95, 98, and NT. The suite includes a word processor, spreadsheets, a graphics \n\neditor, and a visual desktop. It also includes a visual file manager that lets you preview \n\ndocuments before you open them. The suite allows users to process several types of \n\ninformation, including text, numbers, pictures, mass fax/email communication, Web pages, \n\nand labels or bar codes. 602Pro PC Suite supports creation of templates with guides. It \n\nalso offers a simple way of creating HTML documents, even if you don't have any knowledge \n\nof the language, and is designed to perform well, even on slower PCs. This version \n\nincludes increased support for DOC/XLS and HTML documents, the added ability to password-\n\nprotect documents, updated thumbnail-printing features, and a photo-album print option.\nRequires free on-line reg.\nsize: 14 MB &lt;a href=&quot;\nhttp://www.software602.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.software602.com/&lt;/a&gt;\n\n11. Adobe Illustrator - I often used this as a beautiful programme for generating single   \n\n  page presentations.\n\n12. Fonts - A huge collection of ATM and True type fonts.\n\nALL ARE REPORTED SAFE BY MY AVAST 5.0.677.\n\n\nALWAYS FIND ME SEEDING FROM 2 AM TO 8 AM iNDIAN STANDARD TIME. (FOR OTHER APRT OF THE DAY \n\n- BANDWIDTH IS REALLY DEAR.\n\nDO KEEP MAKING COMMENTS. ","torrent":{"xt":"urn:btih:386b07f6f8809f7ddc8ef832aabd2eed4cd0c3d7","amp;dn":"DTP+Tools","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"386b07f6f8809f7ddc8ef832aabd2eed4cd0c3d7","infoHashBuffer":{"type":"Buffer","data":[56,107,7,246,248,128,159,125,220,142,248,50,170,189,46,237,76,208,195,215]},"announce":[],"urlList":[]}}