{"title":"ROY BROWN-MIGHTY MIGHTY MAN","uid":5752542,"size":123684431,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:38a48b76dc32972f417edc3c2f4d3a4308298b61&amp;dn=ROY+BROWN-MIGHTY+MIGHTY+MAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jonah111","files":24,"time":1281451310,"description":"Brown was born in New Orleans, Louisiana.[1] He started singing gospel music in the church. His mother was an accomplished singer and church organist.[3] After a move to Los Angeles, California some time in the 1940s, and a brief period spent as a professional boxer in the welterweight category, he won a singing contest in 1945 at the Million Dollar Theater covering \\&quot;There\\'s No You\\&quot; by Bing Crosby. In 1946 Brown moved to Galveston, Texas, where he sang in a club called the Club Granada. His numbers included a song he wrote entitled \\&quot;Good Rocking Tonight\\&quot;. He returned to New Orleans in 1947, where he performed at The Dew Drop Inn.[4]\n\nBrown was a big fan of a blues singer named Wynonie Harris. When Harris made an appearance in town, Brown tried but failed to interest Harris in recording \\&quot;Good Rocking Tonight.\\&quot; Dejected, Brown went down the street to where another blues singer named Cecil Gant was appearing. Brown introduced his song, and Gant had Brown to sing it over the phone to the president of De Luxe Records Jules Braun at 4am, who signed him immediately. Brown recorded the song in a jump blues style with a swing beat. It was released in 1947 and reached #13 on the Billboard R&amp;B charts. Ironically, Harris quickly covered it and hit the top of Billboard\\'s R&amp;B chart in 1948.[5] Elvis Presley also covered the song for Sun Records in 1954; later re-released on RCA Victor when his recording contract was sold to that record label in 1956.[citation needed]\n\nBrown continued to make his mark on the R&amp;B charts, scoring 15 hits from mid-1948 to late 1951 with DeLuxe, ranging from the emotionally wracked crying blues of \\&quot;Hard Luck Blues\\&quot; (his biggest seller of all in 1950) to the party-time rockers \\&quot;Love Don\\'t Love Nobody\\&quot;, \\&quot;Rockin\\' at Midnight,\\&quot; \\&quot;Boogie at Midnight,\\&quot; \\&quot;Miss Fanny Brown,\\&quot; and \\&quot;Cadillac Baby.\\&quot; Strangely, his sales slumped badly from 1952 on, even though his frantic \\&quot;Hurry Hurry Baby,\\&quot; \\&quot;Ain\\'t No Rockin\\' No More,\\&quot; \\&quot;Black Diamond,\\&quot; and \\&quot;Gal From Kokomo\\&quot; for Cincinnati\\'s King Records rate among his hottest house rockers. Brown is arguably the original king of R&amp;B.[5]\n\nThe decline of his fortunes coincided with his successfully winning a lawsuit against King Records for unpaid royalties in 1952, one of the few African American musicians to do so in the 1950s. This has led some, such as author Nick Tosches (in his book Unsung Heroes of Rock \\'n\\' Roll, which contains a chapter on Brown) to believe that Brown may have been blacklisted. Brown\\'s misfortunes also included prison time for tax evasion. When his popularity ebbed in the rock and roll era, he tried teen-slanted songs like \\&quot;School Bell Rock\\&quot;, but had little success and more or less retired.[6]\n\nBrown did not experience commercial success during the mid-1950s rise of rock and roll, although he had a brief comeback through Imperial Records in 1957. Work with New Orleans producer Dave Bartholomew, who was experiencing success at the time with Fats Domino, Brown returned to the charts with the original version of \\&quot;Let the Four Winds Blow\\&quot; (co-written by Domino), which would become a hit later for Domino. He also released a few other notable rockers, such as \\&quot;Diddy-Y-Diddy-O,\\&quot; \\&quot;Saturday Night,\\&quot; and \\&quot;Ain\\'t Gonna Do It\\&quot;.[5]\n\nHe returned to King Records where his popularity ground down to a low by 1959, but he sporadically managed to find work and do some recording through the 1960s, making appearances where ever he was wanted.[5] To supplement his income, Brown sold the rights to \\&quot;Good Rocking Tonight.\\&quot; He also worked as an encyclopedia salesman.[7]\n\nIn 1970, Brown closed The Johnny Otis Show at the Monterey Jazz Festival. As a result of the crowd reaction he recorded \\&quot;Love for Sale\\&quot;, which became a hit for Mercury Records.[3]\n\nIn the late 1970s a compilation album of his old work brought about a minor revival of interest. In 1978 he had a successful tour in Scandinavia following the release of Laughing But Crying and before the release of Good Rocking Tonight. Shortly before his death he performed at the Whisky A Go-Go in West Hollywood, California and headlined the New Orleans Jazz and Heritage Festival during the spring of 1981.\n\nHe died of a heart attack, in San Fernando, California at the age of 55, in May 1981.[1][8] The Reverend Johnny Otis conducted the funeral. He was posthumously inducted into the Blues Hall of Fame the same year.\n\nMr. Hound Dog\\'s in Town\nBootleggin\\' Baby\nTrouble at Midnight\nEverything\\'s Alright\nThis Is My Last Goodbye\nDon\\'t Let It Rain\nUp Jumped the Devil\nNo Love at All\nAin\\'t It a Shame\nAin\\'t No Rockin\\' No More\nQueen of Diamonds\nGal From Kokomo\nFannie Brown Got Married\nWorried Life Blues\nBlack Diamond\nLetter to Baby\nShake \\'Em Up Baby\nRinky Dinky Doo\nAdorable One\nSchool Bell Rock\nAin\\'t Got No Blues Today\nGood Looking and Foxy Too","torrent":{"xt":"urn:btih:38a48b76dc32972f417edc3c2f4d3a4308298b61","amp;dn":"ROY+BROWN-MIGHTY+MIGHTY+MAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38a48b76dc32972f417edc3c2f4d3a4308298b61","infoHashBuffer":{"type":"Buffer","data":[56,164,139,118,220,50,151,47,65,126,220,60,47,77,58,67,8,41,139,97]},"announce":[],"urlList":[]}}