{"title":"Blood Night The Legend Of Mary Hatchet 2009 BRRip Xvid LKRG ","uid":5886097,"size":1201139325,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3c320a163d19f78fbd531460b6fbff583fbc36e0&amp;dn=Blood+Night+The+Legend+Of+Mary+Hatchet+2009+BRRip+Xvid+LKRG+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neon","files":-1,"time":1287057216,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1161404/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1161404/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.youtube.com/watch?v=e6MO54GYZSY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.youtube.com/watch?v=e6MO54GYZSY&lt;/a&gt;\n\nA group of teenagers celebrating the anniversary of the death of a local axe murderer suddenly find themselves face to face with the realities of this haunting urban legend.\n\nLong Island, 1978: A young girl named Mary Mattock gruesomely murders her family with a hatchet and is locked away for life in Long Island's notorious Kings Park Psychiatric Center. Ten years later, Mary escapes from the asylum, leaving a grizzly trail of bodies and blood in her wake. Gunned down by the police, Mary meets her own demise outside the sanitarium walls. This incident gave birth to the legend of Mary Hatchet's walking ghost and the mischievous night named in honor of her death, BLOOD NIGHT!\n\nStemming from the real life Long Island legend of Mary Hatchet, Blood Night: The Legend of Mary Hatchet tells the tale of a group of teenagers enjoying their annual Blood Night festivities, when they come face to face with the reality of this haunting legend. One by one, the teens begin to disappear and meet their fate. As the body count rises, so do the unanswered questions about their missing friends and the secrets of Mary's horrifying past. Is there more to this legend than the vengeful ghost of Mary Hatchet? And if so, who will survive to tell the terrifying tale?\n\nFueled by intense and energetic performances from Nate Dushku, Bill Moseley, Danielle Harris, and Samantha Facchi as Mary Hatchet, audiences are in for a non-stop splatter fest filled with sex, guts, and heads that roll! Blood Night puts a neck-breaking spin on the gory and gut-wrenching &quot;slasher&quot; pieces from the legendary decade of 1980's horror!\n\nThanks to Xclusive666 :)","torrent":{"xt":"urn:btih:3c320a163d19f78fbd531460b6fbff583fbc36e0","amp;dn":"Blood+Night+The+Legend+Of+Mary+Hatchet+2009+BRRip+Xvid+LKRG+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c320a163d19f78fbd531460b6fbff583fbc36e0","infoHashBuffer":{"type":"Buffer","data":[60,50,10,22,61,25,247,143,189,83,20,96,182,251,255,88,63,188,54,224]},"announce":[],"urlList":[]}}