{"title":"Democracy Now - 20 oct 2010","uid":5898590,"size":457295249,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3cd6c2e2937ac2a0d5dbc8d777a4d7baa5be48de&amp;dn=Democracy+Now+-+20+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1287594872,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 20, 2010\n\n- Pentagon Stops Enforcing Gay, Lesbian Military Ban\n- Federal Investigators Probe Banks for Foreclosure Fraud\n- Chicago-Area Sheriff Suspends Foreclosures\n- CIA Officer Ignored Warnings Before Afghan Base Attack\n- US Allowing Key Taliban Factions to Attend Peace Talks\n- US Soldier Detained for Death of Prisoner\n- UN Convoy Attacked in Iraq\n- Iran to Prosecute 2 Jailed Americans\n- Britain Unveils Massive Spending Cuts\n- O'Donnell Questions Separation of Church and State in Constitution\n- Report: Drug Companies Fund Over 17,000 Doctors\n- US, Native American Farmers Settle Discrimination Case\n\n\nSpecial reports\n\n- Nobel Laureate Joseph Stiglitz: Foreclosure Moratorium, Government Stimulus Needed to Revive US Economy\n\nAs the Obama administration rejects a foreclosure moratorium and austerity protests grip Europe, we assess the state of the US and global economy with Nobel Prize-winning economist Joseph Stiglitz, author of Freefall: America, Free Markets, and the Sinking of the World Economy. Stiglitz backs calls for a foreclosure moratorium and says opponents of a new government stimulus &quot;don't understand basic economics.&quot; On war, Stiglitz says Iraq and Afghanistan are &quot;the first wars in America's history financed totally on the credit card.&quot;\n\n\n- NAACP Report Ties Tea Party to Militia and Racist Groups\n\nLess than two weeks before the midterms elections, the NAACP has published a new report that exposes what is calls links between various Tea Party organizations and racist hate groups in the United States. The report, Tea Party Nationalism, analyzes each of the six most active Tea Party organizations in the country and describes links between Tea Party factions and various white supremacist groups, anti-immigrant organizations and militias. We speak with Benjamin Todd Jealous, the president and CEO of the NAACP; and one of the authors of the report, Leonard Zeskind, the president of the Institute for Research &amp; Education on Human Rights.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:3cd6c2e2937ac2a0d5dbc8d777a4d7baa5be48de","amp;dn":"Democracy+Now+-+20+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cd6c2e2937ac2a0d5dbc8d777a4d7baa5be48de","infoHashBuffer":{"type":"Buffer","data":[60,214,194,226,147,122,194,160,213,219,200,215,119,164,215,186,165,190,72,222]},"announce":[],"urlList":[]}}