{"title":"Teleac Buitenbeentjes - Autisme (DVD ISO)NLT-Release (2)","uid":5904038,"size":1687846656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3d20cbde6461e23c592b93a6e513b06afea6bee3&amp;dn=Teleac+Buitenbeentjes+-+Autisme+%28DVD+ISO%29NLT-Release+%282%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NLT-Release-Linday","files":-1,"time":1287782638,"description":"\n7% van de kinderen van 8 tot 11 jaar heeft gedragsproblemen. Ongeveer 250.000 jongeren, in de leeftijd van 13 tot 18 jaar, hebben psychische problemen. Veel voorkomende problemen zijn angst- en dwangstoornissen, eetstoornissen (anorexia en bulimia), depressie, agressieve gedragsstoornissen, ADHD, autisme en aanverwante stoornissen.\nPortretten van kinderen en ouders\n\nHet programma Buitenbeentjes geeft informatie over de aard, de oorzaken en de behandeling van zes veelvoorkomende, vaak ernstige psychische aandoeningen bij kinderen en jongeren. Het gaat om portretten van kinderen en ouders die problemen hebben. Samen met de hulpverlening zoeken zij een manier om de situatie hanteerbaar te maken en te houden. Naast informatie over aandoeningen besteden we aandacht aan actueel onderzoek naar de achtergronden van psychiatrische stoornissen. Meer kennis over deze zaken kan leiden tot meer begrip en openheid voor 'buitenbeentjes' en hun ouders.\n\nAan kinderen met een autistische stoornis is zo op het eerste gezicht niets bijzonders te zien. Maar in de omgang blijkt al snel dat zij anders zijn. Kinderen met een autistische stoornis maken slecht persoonlijk contact. Zij kunnen overstuur raken van veranderingen of onverwachte voorvallen. Zij kunnen moeite hebben om de wereld om zich heen goed te interpreteren. Wat gaat er mis? Autisme is niet te genezen. Maar wat hebben deze kinderen en hun ouders nodig om zo goed mogelijk te kunnen leren functioneren?\n\nMieke Roijmans en Peter Roest hebben vijf kinderen: Auke, Frie, Hugin en de tweeling Sjef en Hilde van 9 jaar. Zij wonen op een boerderij in een rustig deel van Noord-Brabant. Sjef heeft PDD-NOS, een aan autisme verwante contactstoornis. Zo op het eerste gezicht is aan hem niets bijzonders te zien, maar in de omgang blijkt Sjef al snel anders. Hij maakt moeilijk contact met anderen, blijft hardnekkig vasthouden aan bepaalde routines en het is voor hem moeilijk de gevoelens van anderen in te schatten. Wat betekent dit voor zijn ouders en het gezinsleven en kan de school daarop inspelen?\n\nFormaat : DVD5 ISO\nBron : TV\nSubs: Nederlands Gesproken\n\nUnieke  hashcode voor deze film:\n3D20CBDE6461E23C592B93A6E513B06AFEA6BEE3\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:3d20cbde6461e23c592b93a6e513b06afea6bee3","amp;dn":"Teleac+Buitenbeentjes+-+Autisme+%28DVD+ISO%29NLT-Release+%282%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d20cbde6461e23c592b93a6e513b06afea6bee3","infoHashBuffer":{"type":"Buffer","data":[61,32,203,222,100,97,226,60,89,43,147,166,229,19,176,106,254,166,190,227]},"announce":[],"urlList":[]}}