{"title":"Bundle of Hiss - Sessions: 1986 - 1988","uid":5738912,"size":65641811,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3d9a5a5042bc11e24761b125f39adcabcec409fa&amp;dn=Bundle+of+Hiss+-+Sessions%3A+1986+-+1988&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Katkwaraye","files":17,"time":1280882865,"description":"Bundle of Hiss were a grunge band formed in 1980 in Stanwood, Washington by pre-Tad member Kurt Danielson, guitarist Jeff Hopper, vocalist Kurt Schonberg and drummer Russ Bartlett. Schonberg left the band after they had recorded a couple of demo tapes. Russ Bartlett then moved from drums to vocals. They featured various drummers before finding Dan Peters. Hopper later left the band and was replaced by Jamie Lane, whom met Kurt Danielson at the University of Washington. In 1986, Russ Bartlett left the band to pursue a solo career. Jamie Lane then took up vocals and guitar. The band recorded demo tapes and passed them on to fans at their shows and fellow Seattle bands, such as Soundgarden, Mudhoney, and The Melvins. In 1988, the band split up to go separate ways. Kurt Danielson formed his new band Tad with former drummer Tad Doyle. Dan Peters became drummer in a somewhat-short lived local band project called Feast, which disbanded shortly after he joined. After Feast broke up, Peters met up with Mark Arm and Steve Turner to form Mudhoney. In 2000, Bundle of Hiss re-released an old demo tape on Loveless Records called Sessions-1986-88.\n\nFormat: mp3\nBit rate: 128kbps\t\t","torrent":{"xt":"urn:btih:3d9a5a5042bc11e24761b125f39adcabcec409fa","amp;dn":"Bundle+of+Hiss+-+Sessions%3A+1986+-+1988","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d9a5a5042bc11e24761b125f39adcabcec409fa","infoHashBuffer":{"type":"Buffer","data":[61,154,90,80,66,188,17,226,71,97,177,37,243,154,220,171,206,196,9,250]},"announce":[],"urlList":[]}}