{"title":"Haunted History - Haunted Histories Collection 2006 DVDRip Xvid ","uid":5915301,"size":1688543833,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3df1c156c703d3bb4a65405c7ccb4365ae68cdb3&amp;dn=Haunted+History+-+Haunted+Histories+Collection+2006+DVDRip+Xvid+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"deffjam555","files":5,"time":1288199355,"description":"The HAUNTED HISTORIES COLLECTION takes viewers on a spine-tingling tour of truly frightening phenomena. Uncover the real stories behind the Salem Witch Trials, vampires, demon spirits, and haunted houses. From interviews with victims who have been attacked by evil spirits to eyewitness accounts of corpses with pulses and graves where nothing will grow, you don't have to believe in ghosts to be spooked by these chilling tales.\n\n\n\nFeaturing in-depth profiles of the world s scariest stories:\n# Hauntings\n# The Haunted History of Halloween:\n# Poltergeist (The Unexplained)\n# Salem Witch Trials (In Search of History)\n# Vampire Secrets\n\nDescription\nExperience horrors too fantastic to be believed and too terrible to ignore in this mesmerizing five-program illumination of the terrible, dark shadows at the edge of the natural world.\n\n*Revealing new science and analysis is applied to persistent human fears.\n\n*Five complete programs from the authoritative library of THE HISTORY CHANNEL.\n\n*Examine history's most famous manifestations of supernatural evil.\n\nNightmares come alive in these five specially selected, ghoulish DVDs from the most evil corner of THE HISTORY Channels\narchives. In these definitive programs, the inexplicable is explained, the unknown is revealed and misconceptions are laid to rest forever.\n\nYou will learn, through informative and entertaining documentaries, the truth and persistent mysteries behind such horrors as the haunting in Amityville, NY, the Salem witches and vampires. You will relive the delights of childhood Trick-or-Treat excursions and discover the dark, millennia-old history of this seemingly harmless tradition. You will face poltergeists and tempt the supernatural.\n\nEach show combines dramatic reenactments, interviews with experts from every relevant field and riveting personal accounts of those who have survived encounters with the paranormal. The result is riveting and will leave you questioning your grasp of reality\ncover &lt;a href=&quot;\nhttp://shup.com/Shup/430533/ScreenHunter_01-Oct.-28-00.49.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://shup.com/Shup/430533/ScreenHunter_01-Oct.-28-00.49.png&lt;/a&gt;\n\nscreens &lt;a href=&quot;\nhttp://shup.com/Shup/430542/Hauntings.mp4_thumbs_%5B2010.10.28_01.37.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://shup.com/Shup/430542/Hauntings.mp4_thumbs_%5B2010.10.28_01.37.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3df1c156c703d3bb4a65405c7ccb4365ae68cdb3","amp;dn":"Haunted+History+-+Haunted+Histories+Collection+2006+DVDRip+Xvid+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3df1c156c703d3bb4a65405c7ccb4365ae68cdb3","infoHashBuffer":{"type":"Buffer","data":[61,241,193,86,199,3,211,187,74,101,64,92,124,203,67,101,174,104,205,179]},"announce":[],"urlList":[]}}