{"title":"Sean Deason - Allegory and Metaphor (2000) (MP3 320kbps)","uid":5859794,"size":177756631,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3fe7ff8d9942f1fa5f2a49b7fe393295cf4431db&amp;dn=Sean+Deason+-+Allegory+and+Metaphor+%282000%29+%28MP3+320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":13,"time":1285924651,"description":"Sean Deason takes Detroit techno into extreme down-tempo territory where emotive subtleties lurk within the tranquil mist of this synth-heavy album. The Detroit artist seems more interested in the bedroom than the dancefloor on Allegory &amp; Metaphor; while there are plenty of funky beats on songs such as &quot;Ambience&quot; and &quot;Hiphoptrak,&quot; these rhythms are dramatically eclipsed by the thick layers of serene synth tones that hover throughout the entirety of this record like the mammoth darkness of a bedroom's four corners blanketing the faint light of a flickering candle. For an idea of Deason's gifted ability to transform synth tones into heartfelt poetry, think back to the atmospheric tones of Derrick May's &quot;Icon&quot; or Plastikman's Consumed album. The modulating strings of Allegory &amp; Metaphor  aren't used as background decoration but rather as the most prominent sound on the album. For example, the album's centerpiece, &quot;Zig,&quot; carries on for over ten minutes as a synth riff wiggles and worms in a zigzagging manner with heavy layers of phasing until a slow fade into silence. The title track and its album-concluding reprise stand as the album's other noteworthy moments where music surpasses its status as art and enters the domain of sheer beauty. Following the epic nature of &quot;Zig,&quot; some may be caught off guard by Deason's lone drum'n'bass track, &quot;Psybadek One,&quot; yet for as out of place as one might assume drum'n'bass might sound on a ambient techno album, it surprisingly fits in rather well with the continuity of the album; the song's dense sheets of synth tones and subdued percussion make this possible. In the end, Deason's synth-heavy, bassline-light album challenges Richie Hawtin's synth-light, bassline-heavy Consumed album as the best ambient techno album to come from Detroit's long tradition of exceptional techno releases. \n\n4.5/5\n\n-Jason Birchmeier, Allmusic\n\n1 Creation\n2 Phunk\n3 Allegory &amp; Metaphor\n4 2030 AD \n5 Ambience\n6 Interlude\n7 Zig \n8 Psybadek One \n9 My World\n10 Hiphoptrak\n11 Another Interlude\n12 Allegory &amp; Metaphor (Revisited)","torrent":{"xt":"urn:btih:3fe7ff8d9942f1fa5f2a49b7fe393295cf4431db","amp;dn":"Sean+Deason+-+Allegory+and+Metaphor+%282000%29+%28MP3+320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fe7ff8d9942f1fa5f2a49b7fe393295cf4431db","infoHashBuffer":{"type":"Buffer","data":[63,231,255,141,153,66,241,250,95,42,73,183,254,57,50,149,207,68,49,219]},"announce":[],"urlList":[]}}