{"title":"Every Mothers' Son - Every Mothers' Son's Back (1967 US Pop-R","uid":5698730,"size":52708731,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4039770a6fb4441c01664ef2d2ee71033bc4a6f4&amp;dn=Every+Mothers%5C%27+Son+-+Every+Mothers%5C%27+Son%5C%27s+Back+%281967+US+Pop-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iron_Horse","files":15,"time":1279410819,"description":"Every Mothers' Son - Every Mothers' Son's Back (1967 US Pop-Rock)\nLp To MP3 256 Kbit/s.\nIncluded LP Covers &amp; This Info.\n\nFrom Wikipedia, the free encyclopedia\nEvery Mothers' Son was a rock band formed in New York City in 1967. Brothers Dennis (born 22 November 1948) and Lary Larden (born 10 August 1945) had originally performed as a folk  duo. In the formation of Every Mothers' Son, they were joined by pianist/organist  Bruce Milner (born 9 May 1943), drummer Christopher Augustine (born 25 August 1941) and bassist Schuyler Larsen (born 19 February 1947).\n\nOne-hit wonder\nIn early 1967, the group was signed to the MGM Records label (supposedly because management saw the band's clean-cut image as an antidote to the hippie influx) and recorded a self-titled, eleven-song LP. The album contained the Wes Farrell-Jerry Goldstein composition &quot;Come On Down To My Boat&quot; (listed on the album as &quot;Come And Take A Ride In My Boat&quot;), which shot to #6 on the Billboard charts in July 1967. The song had first been recorded by another group (The Rare Breed) with the same producer. (Twenty years later, the tune was the first played by pirate station Radio Newyork International, which broadcast from a ship just off Long Island.) Because the group was signed to MGM Records, MGM Television (by way of Arena Productions) decided to feature the group in a two-part episode of The Man From U.N.C.L.E., The Five Daughters Affair, singing the song in a nightclub as a fight breaks out.\n\nAlthough the debut single was a hit, the group could not sustain its initial success. MGM quickly released a second album in the fall of 1967, Every Mothers' Son's Back, which spawned three more singles that managed to make the charts, but at increasingly lower positions: &quot;Put Your Mind At Ease&quot; (#46), &quot;Pony With The Golden Mane&quot; (#93) and &quot;No One Knows&quot; (#96). Larsen left the band shortly after Every Mothers' Son's Back was completed, and the group disbanded in 1968; a compilation on Collectible Records would emerge three decades later. Dennis Larden later joined Ricky Nelson's Stone Canyon Band.\n\nIn the late '80s, VH1 dusted off the video for &quot;Come on Down to My Boat&quot; and added it to its regular rotation as part of a move to attract more baby-boomer viewers. The song has since become a fixture on oldies radio stations.\n\nBiography\tby Michael Sutton   Allmusic.com\nSince the Beatles spawned a league of imitators, it shouldn't be a surprise that the Beatles' most successful clone, the Monkees, would inspire a doppelganger of its own. Formed in 1967 in New York City, NY, Every Mother's Son attempted to Xerox the Monkees' innocuous bubblegum pop. Consisting of brothers Dennis Larden (vocals, guitar) and Larry Larden (guitar, vocals), Schuyler Larsen (bass), Bruce Milner (keyboards), and Christopher Augustine (drums), Every Mother's Son was signed to MGM and released their debut LP in 1967. The catchy &quot;Come on Down to My Boat&quot; was a Top Ten hit in the U.S., but the group wasn't able recapture its success. The band released another album, Every Mother's Son's Back; however, their appeal had already started to dissipate. &quot;Come on Down to My Boat&quot; may have acquired Every Mother's Son a slice of fame, but a career cannot be propelled by one song, and the group folded in 1969. Dennis Larden joined Rick Nelson's Stone Canyon Band. In the late '80s, VH1 dusted off the video for &quot;Come on Down to My Boat&quot; and added it to regular rotation, aiming to attract baby boomers who had a fond recollection for the forgotten classic. The track has since become a fixture on oldies radio stations. \n\nTracklist:\nA01. Rain Flowers\nA02. Another Day, Another Song\nA03. Dolls In The Clock\nA04. I May Be Right\nA05. Only Child\nA06. I'd Rather Be Right Than Wrong\nB07. Sally\nB08. Pony With The Golden Mane\nB09. The Proper Four Leaf Clover\nB10. Put Your Mind At Ease\nB11. Lary's Birthday Party\n\nLineup:\nDennis Larden - Vocals, Guitar\nLary Larden - Guitar, Vocals\nSchuyler Larsen - Bass\nChristopher Augustine - Drums\n\nSee my other Torrents: &lt;a href=&quot; http://thepiratebay.se/user/Iron_Horse/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/Iron_Horse/&lt;/a&gt;","torrent":{"xt":"urn:btih:4039770a6fb4441c01664ef2d2ee71033bc4a6f4","amp;dn":"Every+Mothers%5C%27+Son+-+Every+Mothers%5C%27+Son%5C%27s+Back+%281967+US+Pop-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4039770a6fb4441c01664ef2d2ee71033bc4a6f4","infoHashBuffer":{"type":"Buffer","data":[64,57,119,10,111,180,68,28,1,102,78,242,210,238,113,3,59,196,166,244]},"announce":[],"urlList":[]}}