{"title":"BS Player Pro v2.56 Build 1043 Final by CORE Carter67","uid":5727750,"size":10804974,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:404a0bcd751d70fe8b92a4a0a647849faf4d5d27&amp;dn=BS+Player+Pro+v2.56+Build+1043+Final+by+CORE+Carter67&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"carter67","files":1,"time":1280524770,"description":"Big Thanks to DM999\n\nInstalled, Tested and Working on Win 7 - 7600 RTM x86 + x64\n\n &lt;a href=&quot;\nhttp://bayimg.com/daOHGaACA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/daOHGaACA&lt;/a&gt;\n\nBS Player PRO\nBS.Player - the best multimedia player (DivX, HD and AVC video, movie,  audio, DVD) in the world! Ever since the very beginning in the year 2000, the BS.Player has been one of the world's most popular multimedia players. It is popular for many reasons, one however should be pointed out: BS.Player is the first player ever to enable its users to focus on watching the movie instead of dealing with poor computer capabilities or running around looking for a proper setting and codec.BS.Player is used by more than 70 millions of multi media users throughout the world and it has been translated into more than 90 world languages. All downloaded versions of our FREE version exceed the sum of all downloads of competitive media players and payable DivX or  DVD players. Because it does not use much of the CPU processing resources for multimedia playback it is suitable for all those who use slightly less capable computers.\nNow, you can finally enjoy the playback of HD DVD and AVCHD movies of the highest quality with minimal system requirements. BS.Player can playback anymovie directly from the internet and save it to local disk.\nMost importantly, BS.Player, a free media movie player, is a product for the world multi media market and is therefore equipped with a advanced subtitle options which enable the users to watch video content with subtitles from many popular subtitle formats (MicroDVD .sub, VobSub .sub + .idx, SubViewer .sub, (Advanced) SubStation Alpha .ssa or .ass, SubRip .srt, VPlayer .txt...). BS.Player is also a AVCHD player and enables you to display AVCHD video format movies (Advanced Video Codec High Definition) used in digital tapeless camcorders.\nBS.Player  is the software movie and media player that supports all popular video and audio media file types, containers and formats such as: DivX, Xvid, avi, mpg, mpeg-1, mpeg-2, mpeg-4, 3ivx,streaming video, AVC HD (avchd player), QT QuickTime mov, RM Real media, OGM, Matroska , mkv, asf, wmv, DV, m1v, m2v, mp4, mpv, swf, vob and wav, mpa, mp1, mp2, mp3, Ogg, aac, DTS, Dolby Surround,  Dolby digital DD 5.1 - AC3, aif, ram, wma, flv (Flash andVideo) and much more!\n\nMain features of BS.Player are:\n- Sound Equalizer\n- Fully skinnable windows (Media list, Play list, Equalizer)\n- Bookmarks support (add, edit)\n- Chapters support (create, move to, skip)\n- Custom aspect ratios\n- Multiple audio stream switching\n- Frame capture (video to picture)\n- Plugin support (Winamp DSP plugins and others)\n- Multilingual interface\n- Fast forward and Fast rewind option\n- Frame stepping (playback video one frame at a time)\n- WinLIRC support (user defineable  remote controllers)\n- Support switching between multiple (different language) subtitles\n- Pan-scan and  custom pan-scan option\n- Support for multiple audio streams and switching between them\n- Every action can also be assigned to WinLIRC button\n- Playback of incomplete AVI files and locked files (files in use, files still downloading or recording)\n- Command line support (for example &quot;bsplayer.exe movie.avi -fs&quot; will start playback of movie in full screen mode)\n- Support a lot of subtitles formats (MicroDVD, SubRip, Subviewer...), custom subtitles position, color, font, transparency...\n- BSI/INI files support and dynamic DirectShow filters loading (so everything can be burned on CD and played without installing anything)\n- Almost every action can be assigned to user selected key (even two keys) and different keys can be assigned for full screen and windowed mode\n- Support for all popular media formats (audio and video): divx, avi, mpeg 1, mpeg 2, xvid, 3ivx, ogm, matroska, asf, wmv, DV, m1v, m2v, Quicktime mov, mp4, mpv, QT,\n\nReal rm, SWF, vob, wav, mpa, mp1, mp2, mp3, ogg, aac, ac3, aif, ram, wma...\nWhat does the BS.Player 2.4 PRO have to offer:\n* Playback of AVCHD video new. (Advanced Video Codec High Definition) format used in Canon, JVC, Panasonic, and Sony digital tapeless camcorders.\n* Support for global multimedia keys\n* Playstreaming including HD,  High Quality and Normal resolution videonew\n* Savestreaming video to local diskdownloader)new\n* Customizable Equalizer\n* Support for Capture/Tuner devices (and Teletext support)\n* Capture Video to file\n* Integrated subtitle editor\n* Network file buffering\n* Support for Flash playback\n* Technical e-mail support\n* DVD support\n* Text &quot;Only for Non-Commercial use&quot; is removed in PRO version\n\n\nchange Log:\nVersion 2.56.1043\n- fixed and improvedplayback\nVersion 2.55.1042\n- with some files there was no audio, fixed\n- rared subtitles will now be loaded only if subtitle file name is the same as movie name\n- fixed problem with playlist and moving items\n- if mouse button was set for some actions it didn't work, fixed\n- fixed problem with 'Always add all files in current directory to playlist' option when 'Sort files' was enabled\n- sometimes DXVA was not used with EVR renderer, fixed\n- some other bug fixes\n+ added subtitle upload support for opensubtitles.org and getsubtitles.com\n+ subtitles background color alpha can now be set\n\nInstallation Notes:\n1. UnRAR and Install BS.Player Pro\n2. Close BS.Player\n3. Run CORE Keygen and Enter name ... Press Generate\n4. Start BS.Player\n5. Cut and Paste Name and Serial from Serial.txt or Keygen into Popup Window in BS.Player to Register.\n6. Close BS.Player when Prompted\n7. Start BS.Player\nEnjoy !!!! \nDO NOT UPDATE THIS PROGRAM","torrent":{"xt":"urn:btih:404a0bcd751d70fe8b92a4a0a647849faf4d5d27","amp;dn":"BS+Player+Pro+v2.56+Build+1043+Final+by+CORE+Carter67","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"404a0bcd751d70fe8b92a4a0a647849faf4d5d27","infoHashBuffer":{"type":"Buffer","data":[64,74,11,205,117,29,112,254,139,146,164,160,166,71,132,159,175,77,93,39]},"announce":[],"urlList":[]}}