{"title":"Super Hide IP 2.1.1.6 + Patch {ThumperTM}","uid":5737180,"size":1717038,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:41873ac7424e6a509fa2998c848b082b2158492e&amp;dn=Super+Hide+IP+2.1.1.6+%2B+Patch+%7BThumperTM%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"19900606","files":3,"time":1280858480,"description":"More AT:\n\nDo you know what your IP address means? Are you aware that your IP address is exposed every time you visit a website? Many websites and hackers use IP address to monitor your home address and other personal information. Your IP address is your online identity and could be used by hackers to break into your computer, steal personal information, or commit other crimes against you. Super Hide IP allows you to surf anonymously, keep your IP address hidden, protect your personal information against hackers and provide full encryption of your online activity, all with a simple click of a button.\n\nKey Features\n\n* Anonymous Web Surfing\nClick Hide IP button and you will be assigned fake IP addresses, preventing others from getting your true IP when surfing the Internet.\n* Protect Your Identity\nSurf anonymously to prevent hackers or identity thieves from monitoring your web activity or intercepting your personal information such as your financial information.\n* Choose IP Country\nYou can select to use fake IP from different countries via &quot;Choose IP Country&quot; option and can Check IP directly.\n* Send Anonymous E-mails\nHide your IP in E-mail headers. Be protected while sending e-mails via Yahoo!, Hotmail, GMail.\n* Un-ban Yourself from Forums and Restricted Websites\nUse Super Hide IP to change your IP which allows you to access any forums or websites that has ever banned you.\n\nHome Page - http://www.superhideip.com/\n\n\nMore AT:","torrent":{"xt":"urn:btih:41873ac7424e6a509fa2998c848b082b2158492e","amp;dn":"Super+Hide+IP+2.1.1.6+%2B+Patch+%7BThumperTM%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41873ac7424e6a509fa2998c848b082b2158492e","infoHashBuffer":{"type":"Buffer","data":[65,135,58,199,66,78,106,80,159,162,153,140,132,139,8,43,33,88,73,46]},"announce":[],"urlList":[]}}