{"title":"Democracy Now - 01 nov 2010","uid":5926784,"size":449919708,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4225fc38d301da8868a7c9a6ff0deef1227eb7de&amp;dn=Democracy+Now+-+01+nov+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1288625838,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 01, 2010\n\n- US Considers Sending Hunter-Killer Teams to Yemen\n- Dilma Rousseff Becomes First Female Brazilian President\n- Right-Wing Indian Protesters Storm Home of Arundhati Roy\n- Reid and Angle Battle in Close Nevada Race\n- Rand Paul Volunteer Charged with Assault\n- McDonald's Owner Warns Workers: No Raises If Dems Win\n- TV Stations Benefit from Record Campaign Spending\n- 52 Die in Iraq as Security Forces Raid Church to Free Hostages\n- UN Agrees to Moratorium on Geoengineering Experiments\n- Study: Alcohol Is More Dangerous than Crack and Heroin\n\n\nSpecial reports\n\n- Jon Stewart and Stephen Colbert Lead Massive Rally to &quot;Restore Sanity and/or Fear&quot; in DC\n\nAs many as 250,000 people flooded the National Mall in Washington, DC, Saturday for a rally that billed itself as the &quot;Million Moderate March.&quot; The Rally to Restore Sanity and/or Fear was organized by the hosts of Comedy Central programs The Daily Show and The Colbert Report. We air parts of Jon Stewart's keynote speech on fearmongering and the corporate media, as well as an exchange with basketball legend Kareem Abdul-Jabbar on Islamophobia. Actor Sam Waterson also reads a poem by Stephen Colbert.\n\n\n- Rep. Keith Ellison on Tea Party Anti-Muslim Bigotry, US-backed Assassinations in Yemen, and the Firing of Juan Williams\n\nA prominent leader of the Tea Party movement recently said he was working to unseat Minnesota Democrat Rep. Keith Ellison in part because he is a Muslim. Judson Phillips, the founder of the Tea Party Nation, urged Minnesota voters to elect Ellison's independent challenger, Lynn Torgerson, on Tuesday. &quot;A majority of Tea Party members, I suspect, are not fans of Islam,&quot; Phillips said. Rep. Ellison, the first Muslim congressman, responds to these comments and ongoing attacks against Muslim and Arab communities.\n\n\n- Legalizing Pot, Tax Reform, Healthcare and Climate Change Ballot Initiatives to be Decided on Tuesday\n\nOn Tuesday, voters in thirty-seven states will confront 160 ballot initiatives on issues ranging from healthcare reform to reproductive rights, to rights to unionize, to climate change legislation. For a summary of these initiatives, we talk with Justine Sarver, the executive director of the Ballot Initiative Strategy Center.\n\n\n- Brazil Elects Dilma Rousseff, First Female President\n\nBrazil has reached a new milestone with the election of its first-ever female president. On Sunday, Dilma Rousseff defeated rival JosÃƒÂ© Serra with 55 percent in a runoff vote. Rousseff was outgoing Brazilian President Luiz InÃƒÂ¡cio Lula da Silva's chosen successor after serving the last five years as his chief of staff. During the 1960s and 1970s, she was involved in the armed struggle against Brazil's military dictatorship. She was imprisoned for nearly three years and tortured. Among her pledges, Rousseff vowed to eradicate chronic poverty in Brazil affecting 20 million people. We talk with Michael Fox, an independent journalist and documentary filmmaker based outside Porto Alegre. &quot;She's a fighter,&quot; Fox says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4225fc38d301da8868a7c9a6ff0deef1227eb7de","amp;dn":"Democracy+Now+-+01+nov+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4225fc38d301da8868a7c9a6ff0deef1227eb7de","infoHashBuffer":{"type":"Buffer","data":[66,37,252,56,211,1,218,136,104,167,201,166,255,13,238,241,34,126,183,222]},"announce":[],"urlList":[]}}