{"title":"CQC: Close Quarters Conflict (Groove Games) (Army FPS) (RUS)","uid":5840446,"size":630654038,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:44c658a3035838d7412706b00bf0b1320be0e7e4&amp;dn=CQC%3A+Close+Quarters+Conflict+%28Groove+Games%29+%28Army+FPS%29+%28RUS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FuCtUpPuNk","files":5,"time":1284932468,"description":"Private Military Corporations (PMCs) have become big business, as small governments and large multi-national corporations have increasingly come to rely on the flexibility, value and discretion that PMCs provide in their security schemes. One PMC, the Darkrock Corp, has been contracted by Lubriconn International to secure the release of oil crews held hostage by the Venezuelan government, beginning a series of events that led to the overthrow of the Venezuelan government, leaving the country in the stewardship of Lubiconn. As Lubriconn's grip on the global oil market tightens, EurOil, the second largest oil company in the world, retains the services of Force Objective International, Darkrock's principal competitor, to regain control of those oil facilities and other energy producing assets.\n\nNow, these two corporations, staffed with the cream of the Specwar crop (Navy SEALs, US Army Recon Rangers, SAS, GIGN, SPEZNAZ), square off in squad combat around the world, the ultimate mercenaries. Where governments can't or won't get involved, when lobbying fails, the PMCs will answer the call... if the price is right.\n\nThis game was first made available via gameplay on the SkillGround community play service.\n\nINSTALLATION:\nExtract\nMount or Burn\nInstall (the setup is in russian sadly)\nselect the top option on the install menu, it will look like a bunch of question marks\nafter the installation finishes\npress the bottom button to close it\nuse the shortcut on your desktop to run the game\n\nNOTE: sadly, the game is in russian.\n\nTHE MAIN MENU OPTIONS\n1. join online game\n2. host a online game\n3. single player\n4. OPTIONS\n5. CREDITS\n6. leave game\n\nTHROUGH THE REST OF THE MENUS (which aren't many) you must guid yourself.\nit's not hard, just press the top button usually, if that don't work try again.\n\nNO ONLINE SERVERS POP UP BUT YOU CAN PLAY LAN IF YOU WANT!!! MIGHT EVEN BE ABLE TO CONNECT BY IP\n\n\nENJOY AND SEED PLEASE!!!!!!!!!\n\n\n\n\n-----------------------------------------------------------------------------------\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:44c658a3035838d7412706b00bf0b1320be0e7e4","amp;dn":"CQC%3A+Close+Quarters+Conflict+%28Groove+Games%29+%28Army+FPS%29+%28RUS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44c658a3035838d7412706b00bf0b1320be0e7e4","infoHashBuffer":{"type":"Buffer","data":[68,198,88,163,3,88,56,215,65,39,6,176,11,240,177,50,11,224,231,228]},"announce":[],"urlList":[]}}