{"title":"Ingebrigt Haker Flaten Quintet - The Year Of The Boar (2008)","uid":5851917,"size":814450086,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:46177f06981f6d00958e4cbbed07b4626b70a3c1&amp;dn=Ingebrigt+Haker+Flaten+Quintet+-+The+Year+Of+The+Boar+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mariorg","files":-1,"time":1285420113,"description":"Jazzland &lt;a href=&quot;\nhttp://www.jazzlandrec.com/index.php?option=com_digistore&amp;task=show_product&amp;pid=58&amp;catid=6%3E&amp;Itemid=454&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jazzlandrec.com/index.php?option=com_digistore&amp;task=show_product&amp;pid=58&amp;catid=6%3E&amp;Itemid=454&lt;/a&gt;\n\nHomepage:\n~~~~~~~~ &lt;a href=&quot;\nhttp://www.ingebrigtflaten.com/groups/ihf_quintet.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ingebrigtflaten.com/groups/ihf_quintet.php&lt;/a&gt;\n\nReview\n~~~~~ &lt;a href=&quot;\nhttp://www.gubemusic.com/album_724&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gubemusic.com/album_724&lt;/a&gt;\n\nThe Year of the Boar introduces the powerhouse bassist's new band, a five-piece\nthat reflects his adopted home in the American prairie (he's lived in Chicago\nsince late 2006) as well as his deep roots in the bustling Norwegian jazz\nscene. The result is nothing short of a full marshaling of trans-Atlantic\ncreative music forces, a roundhouse punch in the face of complacent listening.\n\nOf course, parallels between the improvised music communities in Chicago and\nOslo have been made frequently, fueling repeated exchanges between the\nmetropoles. Top pan-Scandanavian ensembles like Atomic and The Thing, both of\nwhich feature Flaten on bass, have toured the U.S. regularly over the last\nhalf-decade, prying open the door to a fruitful musical give-and-take. This\ngroup is the next chapter in this ongoing saga.\n\nThe quintet's debut CD feels natural in Chicago, with a pugilistic rock element\n(listen to Parker's white-hot guitar soloing and the band's raucous ostinati\nriffing) and sectional, episodic compositions. But as with any important record,\nit adds something distinctly personal and original to the mix, which might be\nsummarized by placing the band in a great lineage of Norwegian progressive\njazz. With a constructive approach to the integration of fusion charts and\npost-Miles electric collage, significant points on that line include Jan\nGarbarek's classic, sometimes unfairly neglected early bands with guitarist\nTerje Rypdal, which perhaps set the aesthetic table for Flaten's ensemble, and\nthe George Russell ensembles out of which Garbarek's group emerged, as well as\nthe less well-known trio led by pianist Svein Finnerud.\n\nIn fact, Flaten makes his awareness of this tradition clear at the end of the\ndisc, utilizing a line by Finnerud's bassist (and Flaten's good friend), BjÃƒÂ¸rnar\nAndresen in the composition &quot;George,&quot; which he dedicates to Russell. Other\npieces have appeared in very different versions elsewhere, showing how Flaten\nlikes to rework and reinterpret material. Indeed, the blazing opener, &quot;Maxwell's\nSilver Demon,&quot; also appeared as the first track on Flaten's Jazzland release\nQuintet, but the bassist was confident that the differences in the two versions\nwould be evident, maybe even instructive. From one of the first trips to\nChicago, Flaten's piece &quot;Green Wood&quot; appeared on the 2003 Okka Disk release\nNuclear Assemblyhall, performed by the combined forces of Atomic and School\nDays. Here, on a rolling groove that builds to a volcanic explosion, Rosaly\nshows off his polyrhythmic imagination.\n\nDedications to Flaten's parents constitute two tracks. &quot;Praying,&quot; a track that\nhas appeared on an early Atomic release (Feet Music) and uncredited on Zim\nNqguana's Ingoma, a South African CD, is a dedication to Flaten's father, who\ndied when the bassist was 20. &quot;Ceremony,&quot; a new piece with a beautiful pocket\nand Art Ensemble-like rhythmic breakdowns, dedicated to Flaten's mother (soon to\nbe revisited on a new AtomicSchooldays release), was debuted on the tour for The\nYear of the Boar, during which Flaten played in his home village, Oppdal, for\nthe first time since leaving in 1988. His 77-year-old mom was in the first\nrow. At the end of the concert, one of the 500 in attendance, an old farmer who\nhad never heard live jazz, said to Ingebrigt: &quot;Man, this music went straight to\nmy guts.&quot;\n\nNo wonder. It takes little expertise to feel the strength and sensitivity of the\nIngebrigt Haker Flaten Quintet. Here they are in the city that works, helping\nbuild a new Chicago.\n\nWelcome!\n\nJohn Corbett,\n\nChicago, Dec 2007\n\nReleased 2008\n\n\nPersonnel:\n~~~~~~~~~\n* Dave Rempis - Alto, Tenor &amp; Baritone Saxophones\n\n* Jeff Parker - Guitar &amp; Assorted Pedals\n* Ola Kvernberg - Violin\n* Ingebrigt HÃƒÂ¥ker Flaten - Double Bass, Electronics on George\n* Frank Rosaly - Drums, Electronics on Audrey &amp; George\n","torrent":{"xt":"urn:btih:46177f06981f6d00958e4cbbed07b4626b70a3c1","amp;dn":"Ingebrigt+Haker+Flaten+Quintet+-+The+Year+Of+The+Boar+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46177f06981f6d00958e4cbbed07b4626b70a3c1","infoHashBuffer":{"type":"Buffer","data":[70,23,127,6,152,31,109,0,149,142,76,187,237,7,180,98,107,112,163,193]},"announce":[],"urlList":[]}}