{"title":"Cheri[DVDRip][Spanish].avi","uid":5929067,"size":1155858432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46f36419e7903ca70fcc3f78ea3da05859f7f2fc&amp;dn=Cheri%5BDVDRip%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sonyds","files":1,"time":1288708803,"description":"Titulo: Cheri\nAÃƒÂ±o: 2010\nCategoria: Romantica\nCalidad: DVDRip, (Muy Buena)\nPeso: 1 GB\nIdioma del audio: Espanol\n\nA principios del siglo XX, Paris es el centro del mundo. Los artistas, la moda, el teatro, la musica%u2026 y las cortesanas, esas mujeres tan bellas y experimentadas en el arte del amor que llegan a ser mantenidas con gran confort por los hombres poderosos de la epoca. Lea de Lonval (Michelle Pfeiffer) es una cortesana que ha conseguido llevar una vida agradable y ya no ejerce como tal. Una manana va a desayunar con su antigua companera Madame Peloux (Kathy Bates), que acude acompanada por un joven que resulta ser su hijo, Cheri (Rupert Friend), como ella le llama. Madame Peloux tiene grandes proyectos para el, pero Cheri debe convertirse primero en un hombre. Le pide a Lea que le ensene, ella acepta y lo que comienza siendo un travieso flirteo se convierte en un apasionado amor que dura seis anos. Pero la madre, Madame Peloux, planifica en secreto el matrimonio de Cheri con Edmee (Felicity Jones), la hija de otra cortesana rica, Marie-Laure (Iben Hjejle).\n\nAl acercarse la inevitable separacion, Lea y Cheri intentan afrontar lo mejor posible la dificil situacion, pero cuanto mas tiempo pasa mas conscientes son de que el amor que les une tiene unas raices muy profundas. \n","torrent":{"xt":"urn:btih:46f36419e7903ca70fcc3f78ea3da05859f7f2fc","amp;dn":"Cheri%5BDVDRip%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46f36419e7903ca70fcc3f78ea3da05859f7f2fc","infoHashBuffer":{"type":"Buffer","data":[70,243,100,25,231,144,60,167,15,204,63,120,234,61,160,88,89,247,242,252]},"announce":[],"urlList":[]}}