{"title":"MapPoint 2010 North American Maps (x86 and x64) - DVD (English)","uid":5753599,"size":1912006656,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4838559f20f28e0fdebce8eadfbd7ccd8d2aee99&amp;dn=MapPoint+2010+North+American+Maps+%28x86+and+x64%29+-+DVD+%28English%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kklasen","files":1,"time":1281483870,"description":"This is an untouched MSDN download.\nRAW Filename: en_mappoint_2010_european_maps_x86_x64_dvd_458242.iso\n\n\nPLS SEED AND COMMENT AFTER DOWNLOAD!!!\n\n------------------------------------------\n\nExplore the Features of MapPoint 2010\n\nNew features include map settings to choose what details to display on your maps, plus expanded and improved pushpins.\n\nTap into existing data sources. Create maps from data stored in current versions of Microsoft Office Excel, Office Access, SQL Server, or other database sources.\nTell a story, visually. Insert maps into Word documents and PowerPoint presentations to illustrate everything from sales performance to customer locations.\nExtend your business. Take advantage of the extensible MapPoint object model to build custom business solutions such as fleet tracking and business intelligence.\nTo use MapPoint 2010, you need:\n\nPC with 300-MHz or faster processor clock speed\nWindows VistaÃ‚Â® with 1 GB RAM, Windows XP with 256 MB RAM, Windows ServerÃ‚Â® 2008 with 512 MB RAM or Windows Server 2003 with 256 MB RAM (64-bit versions of Windows XP and Windows Server excluded); service packs for operating systems recommended\nAvailable hard-disk space: 1.9 GB (some users may require up to an extra 300 MB)\nFor installation of software: DVD drive or high speed Internet access\nSuper VGA (1024 x 768) or higher resolution monitor\nMicrosoft Mouse, Microsoft IntelliMouseÃ‚Â® or compatible pointing device\nAdditional items or services required to use certain features:\n\nFor Voice Output: any of the operating systems listed in the system requirements and a compatible soundcard\nMicrosoft compatible email software such as Microsoft Office OutlookÃ‚Â® required to use Send to Mobile and Send To as attachment; Office Outlook 2003 or Office Outlook 2007 required to use Send To as picture\nBroadband Internet service recommended for certain features, which may require payment of a separate fee to an Internet service provider; local and/or long-distance telephone toll charges may apply\nGPS functionality requires a GPS device that supports NMEA 2.0 or later and an available USB port.\nCertain features require Internet ExplorerÃ‚Â®. If not present, Internet Explorer will be installed but will not displace your primary browser\n","torrent":{"xt":"urn:btih:4838559f20f28e0fdebce8eadfbd7ccd8d2aee99","amp;dn":"MapPoint+2010+North+American+Maps+%28x86+and+x64%29+-+DVD+%28English%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4838559f20f28e0fdebce8eadfbd7ccd8d2aee99","infoHashBuffer":{"type":"Buffer","data":[72,56,85,159,32,242,142,15,222,188,232,234,223,189,124,205,141,42,238,153]},"announce":[],"urlList":[]}}