{"title":"Alien.Breed.2.Assault-SKIDROW","uid":5848355,"size":925154153,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:48d84ce81ced7e07dce30188cbbd6c7e906ab98c&amp;dn=Alien.Breed.2.Assault-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"MAFIAA.","files":21,"time":1285283778,"description":"RELEASE DATE : 23-09-2010              PROTECTION : Steam\nGAME TYPE    : Action                  DISKS      : 1 DVD\n\nOn with the game release information:\n\nAlien Breed 2: Assault is the second chapter in the Alien\nBreed series, and is an explosive science fiction\narcade-shooter with an epic story, swarms of highly\nintelligent alien enemies, high-impact weaponry, highly\ndetailed and rich environments, developed using Epic Games'\nUnreal Engine 3. Take control of the hero, Conrad, the ship's\nChief Engineer, and continue your fight for survival across\nthe fatally damaged space vessel, against a ruthless assault\nby an alien horde. Your only hope relies on reigniting the\nalien space craft's monstrous engines to rescue you from\nimpending annihilation. Deep inside the bowels of the\nunfamiliar craft, and with time rapidly running out, ready\nyour weapons and begin to claw your way through the darkness\nin a fight for survival. But you are not alone. The ship is\nhome to the carnivorous alien horde and something else ...\nsomething yet to reveal its true intentions ... something\nbiding its time. In addition to the thrilling single-player\ncampaign and all new survivor modes, the game also offers\nrelentless, action-packed, two-player online co-operative\nbattle modes.\n\nSurvive the assault - An action-packed mix of arcade-shooter,\nsurvival-horror and tactical weapons upgrades and\ncustomisation.\n\nNEW - set pieces - fight the breed through the new vertical\nclimb section and the mounted gun battle.\n\nNEW - fight the alien horde with new hardened armour and new\nweaponry: Hyper Blaster - a destructive chain-gun. Rocket\nLauncher - blow the horde away.\n\nNEW - take on new alien enemies - the &quot;webber&quot; alien and\nendure dramatic encounters with new shocking bosses.\n\nEpic single-player story mode - The single-player campaign\nmode that follows the narrative of the game through five\nhuge and challenging environments.\n\nNEW - single-player &quot;survivor&quot; mode: - Resist endless waves of\nintense alien horde attacks in three specifically designed\narena environments.\n\nSingle-player free-play mode - A single-player challenge mode\n- beat your high score on a previously completed campaign\nmission.\n\nTwo-player co-operative play mode - Work together to defeat\nthe alien horde across three specially customised assault maps\nfor two players, over Steam.\n\nNEW - two-player co-operative &quot;survivor&quot; mode - Join forces\nand try to survive three specifically designed arena\nenvironments, over Steam. Get competitive and challenge others\nto beat your survivor abilities on the extensive\nLeader-boards.\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on the DVD to your\ninstallation directory and overwrite\n5. Play the game\n\nAdditional Notes:\n\nWe included a Language Selector Launcher with the cracked\ncontent. Be sure to run the game at least one time, if you\nwant to use our Language Selector Launcher to choose another\nlanguage than english.\n\nSupport the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:48d84ce81ced7e07dce30188cbbd6c7e906ab98c","amp;dn":"Alien.Breed.2.Assault-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d84ce81ced7e07dce30188cbbd6c7e906ab98c","infoHashBuffer":{"type":"Buffer","data":[72,216,76,232,28,237,126,7,220,227,1,136,203,189,108,126,144,106,185,140]},"announce":[],"urlList":[]}}