{"title":"POV Junkie 3 (2010) ","uid":5853487,"size":2193418240,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:48e76fc8b656c4772517eac48f360720d0d1f7dd&amp;dn=POV+Junkie+3+%282010%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":-1,"time":1285508382,"description":"POV Junkie 3 (2010) \n &lt;a href=&quot;\nhttp://www.tlavideo.com/raw-pov-junkie-3/p-313149-4?sn=263&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tlavideo.com/raw-pov-junkie-3/p-313149-4?sn=263&lt;/a&gt; &lt;a href=&quot;\nhttp://www.adultdvdnow.com/dvd/POV_Junkie_3_89843.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.adultdvdnow.com/dvd/POV_Junkie_3_89843.html&lt;/a&gt;\n\nStudio \tVince Vouyer\nRelease Date Sep 21, 2010\nCategory All Sex, Anal, HD - Shot In High Def, P.O.V. - Point of View\nDirector Vince Vouyer \nStarring Marie Luv, Christina Aguchi, Alexia Rae, Eve Evans, Bethany Benz\n\nAfter a 3 year hiatus, CHRISTINA AGUCHI has returned for one more scene! She has returned as a well known International award winning feature dancer and ELITE Circuit Performer. As for a performance on camera Christina brought it. Christina takes you right into the VIP room for the ultimate Private Dance. And yes she does her Very First ANAL Scene to boot! I'm talkin a serious ASS pounding and ATM's with a smile.\n\nNew Cummer 18 Year old EVE EVANS, the Brooklyn Teen, shows up to set braggin about getting Butt fucked all night the night before. So i ask: ya wanna do anal today?? and in her New York Accent she replies LETS DO IT you fuck me! She begs me to cum in her butt after a thorough ASS fuckin but I just had to blow the man milk on that cute ASS 18 year old Face.\n\nHave you Driven a BETHANY BENZ Lately?? you should get to your local dealer and drive one today!! This 20 year old Russian and Black mixed BUSTY beauty is sure to make you cheese ball after just a few strokes in that dark tan Fun Hole of hers. She's not much for words but when she looks at you while sucking your man hood you will forgot about the english language all together.\n\nMARIE LUV needs no introduction, this EBONY seasoned pro brings her fuck to set all the time every time. Hard body and sexual appetite sets the stage for an all out Anal Assault on her Black Cheeks and plenty of ATM's Included.\n\nThe self acclaimed 34 DDD Busty NYMPH ALEXIA RAE, wastes no time getting right down to buisness suckin and fuckin in true Nymph Fashion. Ending in some BIG Titty Fuckin and BIG Titty Load dropping.\n\n","torrent":{"xt":"urn:btih:48e76fc8b656c4772517eac48f360720d0d1f7dd","amp;dn":"POV+Junkie+3+%282010%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48e76fc8b656c4772517eac48f360720d0d1f7dd","infoHashBuffer":{"type":"Buffer","data":[72,231,111,200,182,86,196,119,37,23,234,196,143,54,7,32,208,209,247,221]},"announce":[],"urlList":[]}}