{"title":"Democracy Now - 23 sep 2010","uid":5847782,"size":456112052,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4a07f2f577ea4292204f154d5e47b089a851d020&amp;dn=Democracy+Now+-+23+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1285264792,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 23, 2010\n\n- Military: All 9 NATO Crash Victims Were US Troops\n- US to Maintain Prison, Rendition Flights in Afghanistan\n- AIDS Activists Heckle Obama at Fundraiser\n- Vowing Foreign Aid Reform, Obama Pushes Foreign Investment\n- FAO Chief: Corporate Influence Undermining Development\n- UN Probe Recommends Prosecution of Israel for Attack on Gaza Flotilla\n- Clashes Erupt After Settler Guard Kills Palestinian in East Jerusalem\n- Factory Egg Owners Appear Before House Panel\n- Ex-NOLA Officer Sentenced for Cover-Up of Danziger Shootings\n- Study: Majority of U.S. Tax Breaks, Incentives Benefit the Wealthy\n- U.S.: Militant Plots Harder to Detect\n- Florida Court Overturns Gay Adoption Ban\n\n\nSpecial reports\n\n- &quot;Explain to Us What You Want From Us&quot;-Juarez Newspaper Publishes Editorial Addressing Cartels After Another Reporter Gunned Down\n\nIn Mexico, the editors of a local newspaper in the town of Ciudad Juarez have set off a national debate after they published a front-page editorial directly addressing the drug cartels that have terrorized the city. El Diario de Juarez published the piece after a young photographer at the paper was shot dead. &quot;Explain to us what you want from us, so we know what to abide by,&quot; they wrote. &quot;You are at this time the de facto authorities in this city because the legal authorities have not been able to stop our colleagues from falling.&quot;\n\n\n- Former Mexican Foreign Minister Jorge CastaÃƒÂ±eda on the Drug War, Legalization, Immigration and Free Trade\n\nJorge CastaÃƒÂ±eda, one of Mexico's best known public intellectuals and the country's former Foreign Minister, joins us to discuss Mexico's drug war, the debate on legalization of drugs in Mexico, immigration, free trade and more. CastaÃƒÂ±eda was Mexico's foreign minister between 2000 and 2003. He's long supported the legalization of drugs in Mexico and has publicly called the so-called war on drugs a dead-end war and a war of choice.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4a07f2f577ea4292204f154d5e47b089a851d020","amp;dn":"Democracy+Now+-+23+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a07f2f577ea4292204f154d5e47b089a851d020","infoHashBuffer":{"type":"Buffer","data":[74,7,242,245,119,234,66,146,32,79,21,77,94,71,176,137,168,81,208,32]},"announce":[],"urlList":[]}}