{"title":"PC Ã‚Â» MEDAL OF HONOR directplay by globe@","uid":5896872,"size":2031931932,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4a28da00778d83c56af9bf6a577810b80967c3cc&amp;dn=PC+%C3%82%C2%BB+MEDAL+OF+HONOR+directplay+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1287528935,"description":"* Hello PC games fans ...\n\n* Play the new Medal of Honor\n\n* The freeware FREEARC is needed to extract the arc file\n\n* FILE INFO : Fantastic work on this pratical : FULL GAME less the multiplayer that needs a valid key and about 10 videos with no sound but with perfect subtitles sinchronization (the videos type of this game not so common and have really big size for a pratical file , so it was possible the work but without keeping the audio but all the action of the videos still perfectly understandable and they pass a kind of quick anyway , thank you for understand) , MULTI-3 (eng , pol and rus)\n\nTORRENT REPORT :  for the users that might think that maybe it is some problem with the file because the really well worked size for this game beside that is a kind of common in my files , i get the report already from a few users saying that already finished the game with this file .\n\n* GAMEPLAY : *\n\n* As a first-person shooter, Medal of Honor features modern military combat, primarily from the perspective of infantry soldiers. The player will be armed with various authentic modern military small arms and placed in combat designed to simulate modern warfare.\n The gameplay is designed to be realistic, and to this end EA has hired several consultants from the United States military. Typical in-game objectives are expected to be similar to those issued in real life such as raiding terrorist hideouts, hostage rescues and undercover operations. The single player is set to include drivable vehicles such as helicopters, jeeps, bikes, and ATV\\'s.\n The gameplay uses recharging health, rather than fixed health points. If the player is wounded, the screen turns red, and the player must avoid taking damage for several seconds to return to full health.\n The game features iron sights as well as red dot sights and other aiming accessories. The player will shoot much more accurately while using the weapon\\'s sights than when firing from the hip. *\n\n\nMinimum  PC Configurations\n--------------------------------------------\nMedal of Honor requires at the following minimum configuration:\nOperating System\tWindows XP (SP3), Windows Vista (SP2), Windows 7\nProcessor\t\tPentium D, 3.2GHz / Core 2 Duo, 2.0GHz / Athlon 64 X2\nMemory\t\t\t2GB RAM\nVideo Card \t\tVideo card must be 256MB or more and contain these chipsets or better: NVIDIA GeForce 7800 GT ; ATI X1900. Laptop versions of these chipsets may work but are not supported. Updates to your video and sound card drivers may be required.\nHDD Space\t\t9GB\nSoundcard \t \tSoundcard with DirectX 9.0c compatibility\nDirectX \t \tDirectX 9.0c\nDisc Drive\t\t8x or faster CD/DVD Drive\n\n\n\n* enjoy ... *","torrent":{"xt":"urn:btih:4a28da00778d83c56af9bf6a577810b80967c3cc","amp;dn":"PC+%C3%82%C2%BB+MEDAL+OF+HONOR+directplay+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a28da00778d83c56af9bf6a577810b80967c3cc","infoHashBuffer":{"type":"Buffer","data":[74,40,218,0,119,141,131,197,106,249,191,106,87,120,16,184,9,103,195,204]},"announce":[],"urlList":[]}}