{"title":"Motty - 40 Years in the Commentary Box","uid":5790715,"size":86670431,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4b42a5f27748170de481c9abd2825f3526b4d2ff&amp;dn=Motty+-+40+Years+in+the+Commentary+Box&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seedybob","files":1,"time":1282838396,"description":"For everyone in Britain, Motty, like Pele and Maradona, needs no other introduction. As the nation's best-known football commentator, he has had an unparalleled insight into sports broadcasting and the ups and downs of the game. With a career spanning over 40 years and 2,000 matches, including commentating on six World Cup Finals, Motson's time in the commentary box delivers some unforgettable anecdotes. \n\nFrom his remarkable BBC years, the friendly rivalry between him and other talent, and the football legends he has met along the way (including icons such as Matt Busby, Brian Clough and Bill Shankly), through to the darker times of Hillsborough and hooliganism, this is the story of an incredible career. Between 1979 and 2008, Motson was the BBC's main TV commentator for major cup finals and he has commentated on a spectacular 50 major finals, including the FA Cup, World Cup and European Championships. \n\nIn 2001 he received an OBE for services to sports broadcasting. From grass roots to the highest level, his passion and knowledge for the national sport are unrivalled as he shares all for the first time and guides us through his career with insight, humour and honesty. \n\nReader: John Motson\nRunning Time: 2h 46m 26s","torrent":{"xt":"urn:btih:4b42a5f27748170de481c9abd2825f3526b4d2ff","amp;dn":"Motty+-+40+Years+in+the+Commentary+Box","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b42a5f27748170de481c9abd2825f3526b4d2ff","infoHashBuffer":{"type":"Buffer","data":[75,66,165,242,119,72,23,13,228,129,201,171,210,130,95,53,38,180,210,255]},"announce":[],"urlList":[]}}