{"title":"Alex Jones Show - 2010 July 22 TH [sebaygo1]","uid":5709709,"size":88889172,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4c42ee8eaee528e3dc3ac28d16f3fc9913715b6f&amp;dn=Alex+Jones+Show+-+2010+July+22+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":14,"time":1279839284,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 22 July 2010\n\n\n[sebaygo1]\n\n\nScheduled Guests\n................\n\nNOTE :: Today's 4 HOUR show consists entirely of previously broadcast material.  The Infowars web site describes the show this way:\n\nAlex welcomes talks with English writer, public speaker, and former media personality David Icke. Additional guests include the producer of the landmark documentary The Money Masters, Bill Still, and Gerald Celente, trend forecaster, publisher of the Trends Journal, business consultant, and author who makes predictions about the global financial markets and other events. Rocker, former guitarist for The Amboy Dukes, and advocate of the Second Amendment and hunting rights, Ted Nugent, also talks with Alex.\n\nThe only live portion of the broadcast is when Ted Anderson [owner of the GCN radio network] comes on to plug his gold business, Midas Resources.\n\n\n----------\n\nThe David Icke interview is from July 8.\nThe Bill Stills interview is from July 2.\nThe Gerald Celente interview is also from July 2.\nAnd the Ted Nugent interview is from July 9.\n\n\n\nIn the closing seconds of yesterday's [Wednesday, July 21] show, Alex said: &quot;Powerful broadcasts coming up tomorrow and on Friday and back live on Sunday, 4:00 to 6:00 p.m..&quot;\nSo I think it is likely that tomorrow's show will also be repeat material.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_torrents_info_PLEASE-READ.txt\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........","torrent":{"xt":"urn:btih:4c42ee8eaee528e3dc3ac28d16f3fc9913715b6f","amp;dn":"Alex+Jones+Show+-+2010+July+22+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c42ee8eaee528e3dc3ac28d16f3fc9913715b6f","infoHashBuffer":{"type":"Buffer","data":[76,66,238,142,174,229,40,227,220,58,194,141,22,243,252,153,19,113,91,111]},"announce":[],"urlList":[]}}