{"title":"LITTLE WILLIE LITTLEFIELD","uid":5730264,"size":122822731,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4c6a81480668668f1dd7cb953048ad9aa7812797&amp;dn=LITTLE+WILLIE+LITTLEFIELD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":27,"time":1280612440,"description":"1.\tAin't a Better Story Told\n\t2.\tLife of Trouble\n\t3.\tYou Never Miss a Good Woman till She's Gone\n\t4.\tNakite Stomp - (TRUE instrumental)\n\t5.\tCheerful Baby\n\t6.\tHappy Pay Day\n\t7.\tI've Been Lost\n\t8.\tLove Me Tonight\n\t9.\tTrouble Around Me\n\t10.\tMoney Hustlin' Woman\n\t11.\tReal Fine Mama\n\t12.\tToo Late For Me\n\t13.\tMean Mean Woman\n\t14.\tLump in My Throat\n\t15.\tI Like It\n\t16.\tYour Love Wasn't So\n\t17.\tRockin' Chair\n\t18.\tNights Are So Long, The\n\t19.\tHit the Road\n\t20.\tTrain Whistle Blues\n\t21.\tSun Is Shining in Your Front Door, The\n\t22.\tLong About Midnight\n\t23.\tTil We Meet Again\n\t24.\tIt's Midnight\n\n\n\nThis is a 25-song compilation drawn from Littlefield's output for Modern between 1949 and 1952, including the sole hit he scored for that label, &quot;It's Midnight (No Place to Go).&quot; Littlefield is somewhat more obscure than many other artists mining a similar blues/R&amp;B crossover field in Los Angeles studios in the early 1950s, such as Charles Brown, Amos Milburn, and Floyd Dixon. On the basis of the music here, Littlefield deserves to be in the same echelon as the aforementioned performers. He was a fine pianist who was skilled in the boogie woogie style and tempered for the times with a modern R&amp;B influence. His use of triplets, according to the liner notes, influenced Fats Domino. He was also more versatile than some piano bluesmen of the era, and was comfortable with slow and melancholy-tinged ballads as well as jumping uptempo R&amp;B tunes (the boasting &quot;I Like It&quot; is a standout). His singing was more easygoing than distinctive, but still had a relaxed charm. Many of the sides here were cut with some of the Los Angeles studio musicians -- horn player Maxwell Davis, guitarist Johnny Moore, and others -- that were instrumental in setting the paces for the jazzy, urbane R&amp;B music of the early 1950s in L.A. The sound is very good, and is mastered from the original acetate lacquers, with only occasional (and slight) surface noise peeping through. The disc includes five previously unissued cuts (three of which are alternate takes). A second volume of Littlefield's Modern sides was in the works from Ace as of the 1999 issue of this collection. \n\n25 tracks from one of the great Texas blues men, who popularized the &quot;triplet&quot; piano in R&amp;B - compiled &amp; annotated by Ray Topping, this features tracks made for the Modern label, inc. his hit from 1949, &quot;It's Midnight,&quot; and 2 tracks with Little Lora Wigg","torrent":{"xt":"urn:btih:4c6a81480668668f1dd7cb953048ad9aa7812797","amp;dn":"LITTLE+WILLIE+LITTLEFIELD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c6a81480668668f1dd7cb953048ad9aa7812797","infoHashBuffer":{"type":"Buffer","data":[76,106,129,72,6,104,102,143,29,215,203,149,48,72,173,154,167,129,39,151]},"announce":[],"urlList":[]}}