{"title":"Ken Il Guerriero s01e67-72 [DVD5 - AC3 - ITA] DVD 12 di 26[TNT V","uid":5882657,"size":4405866496,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4e9ef8be23f29066d6f0778dc4bbe839bcc85dc7&amp;dn=Ken+Il+Guerriero+s01e67-72+%5BDVD5+-+AC3+-+ITA%5D+DVD+12+di+26%5BTNT+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tangolino","files":11,"time":1286844830,"description":"Visit this link for more info: http://forum.tntvillage.scambioetico.org/tntforum/?showtopic=153928\n\nKEN IL GUERRIERO - Stagione 1 - Episodi 67-72 - DVD 12/26\nIn Collaborazione con il Gruppo S.P.G.\n &lt;a href=&quot;\nhttp://uptiki.com/images/7xj2dyax0get1zxm2ba.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uptiki.com/images/7xj2dyax0get1zxm2ba.jpg&lt;/a&gt;\n\n.: Info Anime :.\nTitolo originale: Sekimatsu Kyuuseishu Densetsu - Hokuto no Ken\nRegia: Ashida Toyoo\nCharacter Design: Suda Masaki\nMusiche: Kodomo band, Crystal King\nEpisodi: da 67 a 72 \nDoppiaggio IT: CRC Compagnia Realizzazioni Cinetelevisive\nDistribuzione: Toei Animation\n\n.: Plot :.\n\n- Italiano\n\nUn conflitto mondiale alla fine del XX secolo ha comportato il collasso della moderna civiltÃƒÂ  e la piÃƒÂ¹ totale devastazione ambientale. I sopravvissuti all'olocausto nucleare si sono ridotti a vivere in piccoli assembramenti urbani in oasi in mezzo al deserto, assediati da bande di predoni, che saccheggiano e distruggono tutto ciÃƒÂ² che incontrano. In questo scenario si muove Kenshiro, 64Ã‚Â° successore della scuola di arti marziali &quot;Divina Scuola di Hokuto&quot;, l'Hokuto Shinken. Questa tecnica di combattimento si ispira vagamente ai principi dell'agopuntura e sortisce effetti devastanti, o, al caso, di controllo sul corpo e/o guarigione, convogliando l'&quot;energia&quot; del praticante in particolari &quot;punti di pressione&quot; dell'avversario (detti tsubo). Se inizialmente lo scopo di Kenshiro sembra solo la lotta per potersi ricongiungere con la propria fidanzata rapita, ben presto verrÃƒÂ  rivelato che il ragazzo ha nelle sue mani il destino di coloro che sono scampati alla catastrofe.\n\n- English\n\nNear the end of the 20th century, a nuclear flame engulfed most of the Earth's surface, reducing most of the world into a vast desert wasteland. The survivors of mankind banded together in tribes in order to fight over the few supply of uncontaminated food and water still left in the world, with the strong often preying on the weak. Kenshiro, the successor of the assassination art known as Hokuto Shinken, wanders the wasteland after being separated from his fiancee by a rival martial artist. Accompanied by two young children, Bat and Lin, Ken becomes a savior to the weak and innocent from the various gangs threatening their survival. Throughout the course of his journey, Kenshiro encounters various formidable rivals and adversaries, ultimately culminating with Kenshiro's eldest adoptive brother Raoh, an oppressive tyrant who challenges Ken for the right of the Hokuto Shinken succession.[2]\nSeveral years afterward, Kenshiro reunites with the now grown Bat and Lin in order to stand up against a corrupt Imperial Army. The three, with the help of other rebels, manage to expose a conspiracy within the Imperial Army to keep the Heavenly Empress (Lin's estranged twin sister, Lui) imprisoned. The Empress is saved, only for Lin to be taken to the &quot;Land of Asura&quot;, a country of warriors where only the mightiest survive. Kenshiro crosses to Asura in pursuit of her, only to find himself fighting against the three generals who rule over the land. Kenshiro finds himself fighting not only against his own blood brother Hyou, but also Kaioh, Raoh's own brother. After defeating Kaioh, Kenshiro goes on a few further adventures with Raoh's orphaned son, Ryu.\n\n.: Lista episodi :.\n\n67. Vittima dell'amore\n68. L'ultimo volo della fenice\n69. Sete di dominio\n70. Un re solitario\n71. La morte e' di scena\n72. Le ultime lacrime\n\n.: Dati file :.\n\n[INFO VIDEO]\n\n\nVideo: VOB Mpeg 2\nLarghezza: 720 pixel\nAltezza: 576 pixel\nAspectRatio: 4/3\nFrameRate: 25,000 fps\nStandard: PAL\nMenÃƒÂ¹: Si\n\n\n[INFO AUDIO]\n\n\nFormato: AC-3\nFormato/Informazioni: Audio Coding 3\nCanali: 2 canali\nSamplingRate: 48,0 KHz\nLingua: Italiano\n","torrent":{"xt":"urn:btih:4e9ef8be23f29066d6f0778dc4bbe839bcc85dc7","amp;dn":"Ken+Il+Guerriero+s01e67-72+%5BDVD5+-+AC3+-+ITA%5D+DVD+12+di+26%5BTNT+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e9ef8be23f29066d6f0778dc4bbe839bcc85dc7","infoHashBuffer":{"type":"Buffer","data":[78,158,248,190,35,242,144,102,214,240,119,141,196,187,232,57,188,200,93,199]},"announce":[],"urlList":[]}}