{"title":"Fantasia 2000(Multi-Subs)(Multi-Audio)2Lions-Team)","uid":5886047,"size":4591829633,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4fc513aaabc1a25b309172e20639217fd55799f2&amp;dn=Fantasia+2000%28Multi-Subs%29%28Multi-Audio%292Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"juutje","files":12,"time":1287055554,"description":"Fantasia/2000 (1999) \n\nVerenigde Staten\nMuziek / Animatie\n75 minuten\n\ngeregisseerd door James Algar, GaÃƒÂ«tan Brizzi, Hendel Butoy, Francis Glebas, Eric Goldberg, Pixote Hunt, Don Hahn en Paul Brizzi\nmet Steve Martin, Itzhak Perlman en James Earl Jones\n\nFladderende driehoekjes binden de strijd aan op de bekende noten van Beethovens Vijfde Symfonie. Een school walvissen kiest het luchtruim tijdens Ottorino Respighi's 'Pini di Roma' en even later wordt onder de klanken van Gershwins 'Rhapsody in Blue' het leven in het New York van de jaren dertig getoond. Vervolgens beleeft een tinnen soldaatje met slechts ÃƒÂ©ÃƒÂ©n been een bloedstollend avontuur op Sjostakovitsj' Pianoconcert No. 2 en haalt een excentrieke flamingo stunts uit met een jojo gedurende de finale van Saint-SaÃƒÂ«ns' 'Le Carnival des Animaux'. Mickey Mouse ziet zijn kunsten uit de hand lopen terwijl 'l'Apprenti-sorcier' van Dukas klinkt en Disney-collega Donald Duck helpt de oude Noach een handje op de wat pompeuze tonen van Elgars 'Pomp and Circumstance'. Tenslotte verrijst de natuur miraculeus uit de as wanneer het orkest de laatste maten van Igor Stravinksky's 'Vuurvogel Suite' inzet.\n\nEngels\n\nIn this update of Disney's masterpiece film mixture of animation and music, new interpretations of great works of music are presented. It begins with an abstract battle of light and darkness set to the music of Beethoveen's Fifth Symphony. Then we see the adventures of a Humpback Whale calf and his pod set to &quot;The Pines of Rome.&quot; Next is the humourous story of several lives in 1930's New York City, scored with &quot;Rhapsody in Blue.&quot; Following is a musical telling of the fairy tale, &quot;The Steadfast Tin Soldier&quot; set to Dmitri Shostakovich's Piano Concerto No. 2. Then a goofy Flamingo causes havoc in his flock with his yo-yo to the tune of the finale of &quot;Carnival of the Animals.&quot; This is followed by the classic sequence from the original film, &quot;The Sorcerer's Apprentice&quot; starring Mickey Mouse and followed by &quot;Pomp and Circumstance&quot; starring Donald Duck as a harried assistant to Noah on his Ark..\n\nWeblink http://www.imdb.com/title/tt0120910/\nWeblink http://www.moviemeter.nl/film/8395\n\nFormaat          : DVD5  Bron : Retail\nGenre            : Animatie muziek\nBestandsgrootte  : 4,28 GiB\nAudio            - Nederlands DD5.1, Engels DD5.1, Vlaams DD5.1 Frans DD5.1 - Pools DD5.1-Czech DD5.1en Hungarian DD5.1\nSubs             - Nederlands, Engels,Vlaams, Frans,Pools,-Czech,Hungarian\nDisplay aspect ratio  : 16/9\nStandaard             : PAL\nMenu  - Yes\nCover+label-Yes\n\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl/index.php&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\nPlease check our site !!!\nNEW SITE &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt; \n\n*****************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n","torrent":{"xt":"urn:btih:4fc513aaabc1a25b309172e20639217fd55799f2","amp;dn":"Fantasia+2000%28Multi-Subs%29%28Multi-Audio%292Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fc513aaabc1a25b309172e20639217fd55799f2","infoHashBuffer":{"type":"Buffer","data":[79,197,19,170,171,193,162,91,48,145,114,226,6,57,33,127,213,87,153,242]},"announce":[],"urlList":[]}}