{"title":"Wordplay RPG Core Edition","uid":5869233,"size":1184694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fe47966c4808b38fd11703131d0af7042055e5d&amp;dn=Wordplay+RPG+Core+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"legalpenguin","files":-1,"time":1286395139,"description":"About the Wordplay Roleplaying Game\n\nWordplay is a rules light roleplaying game that uses descriptive phrases and applies them directly into the action by giving the phrase a value, which is converted into a number of six sided dice to throw. Wordplay is very easy to play and is designed to be used in any genre that you wish to explore.\n\nWordplay features the following:\n\n    * Free flowing character creation using descriptive phrases and words called 'traits' which are then split between Body, Mind and Soul categories.\n    * A fun dice building mechanic. Describe what your character is doing and make use of as many advantages as possible to build your hand of dice.\n    * Roll your dice and get as many successes as possible - highest wins. Only the dice that land on the table count!\n    * Create goals for your characters and drive them forward to succeed.\n    * Pre-designed 'themes' - ready made settings to inspire you to create and play straight away\n\nWordplay focuses on how descriptions of characters affect play at your gaming table. Instead of numerous mechanistic modifiers the game presents narrative opportunities which are translated into dice for your characters. It's light, open and encourages story telling and vivid descriptions around the table. Wordplay is a six sided dice paradise, so a large number of six sided dice are needed to play.\n\nThis work is licensed under the Creative Commons Attribution 2.0 UK: England &amp; Wales Licence with the additional conditions detailed below.\nYou are free:\n\nto copy, distribute, display, and perform the work.\nto make derivative works.\nUnder the following conditions:\n\t\n\nAttribution. You must give the original author credit.\n\n\t\nFor any reuse or distribution, you must make clear to others the licence\nterms of this work.\nAny of these conditions can be waived if you get permission from the\ncopyright holder.\nNothing in this license impairs or restricts the author's moral rights.\nAdditional Conditions.\n\t\nYou must place the Wordplay logo available from http://www.\nwordplaygames.co.uk on the front cover of a print product, or on the first\npage of an electronic product such as a PDF distribution.\nYou must send one copy of the work you produce in each format (hardcopy\nor electronic) to Wordplay Games. Contact details may be found at http://\nwww.wordplaygames.co.uk\nTo view a copy of this licence, visit http://creativecommons.org/licenses/by/2.0/uk/\n\n\n","torrent":{"xt":"urn:btih:4fe47966c4808b38fd11703131d0af7042055e5d","amp;dn":"Wordplay+RPG+Core+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe47966c4808b38fd11703131d0af7042055e5d","infoHashBuffer":{"type":"Buffer","data":[79,228,121,102,196,128,139,56,253,17,112,49,49,208,175,112,66,5,94,93]},"announce":[],"urlList":[]}}