{"title":"Alice In Chains - I Stay Away (2nafish)","uid":5912018,"size":149673988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5207e34556f2b70260ba42d88257d683deb6bfad&amp;dn=Alice+In+Chains+-+I+Stay+Away+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1288090028,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Stay Away&quot; is the second single from Alice in Chains' EP Jar of Flies (1994). The song was included on the compilation albums Nothing Safe: Best of the Box (1999), Music Bank (1999), Greatest Hits (2001), and The Essential Alice in Chains (2006).\n\nThe music video for &quot;I Stay Away&quot; was released in 1994 and was directed by Nick Donkin, famous for his claymation film The Junky's Christmas. The music video for &quot;I Stay Away&quot; is entirely stop-motion animation, featuring the band members in puppet form in a circus when things go awry. The video is available on the home video release Music Bank: The Videos. The puppets used in the video can now be found in the Rock and Roll Hall of Fame.\n\nIn the liner notes of 1999's Music Bank box set collection, guitarist Jerry Cantrell said of the song:\n\n    That was the first time we'd written with Mike Inez, which makes this another special song. The whole Jar of Flies EP proved to both us and the fans what a talented and valid part of the band Mike was. He plays the nastiest, darkest shit but he's got the sweetest heart in the world.\n\nThe track is notably softer than Alice in Chains's previous recordings on both Facelift and Dirt; however, despite the bright opening guitar riff and verse, the song's pre-chorus suddenly detours into dark, sludgy electric guitar and a haunting vocal harmony. The chorus then reintroduces the upbeat tones with powerfully long-drawn vocals and anxious violins. A hard rock electric guitar solo then plays amidst the bright acoustic section.\n\n&quot;I Stay Away&quot; also uses a great deal of instrumentation that Alice in Chains had previously not attempted, including horns and string instruments. It also effectively demonstrates the harmony between vocalist Layne Staley and guitarist Jerry Cantrell.\n\n&quot;I Stay Away&quot; was released as a single in 1994. &quot;I Stay Away&quot; peaked at number ten on the Billboard Mainstream Rock Tracks chart. The song was nominated for the Grammy Award for Best Hard Rock Performance in 1995.\n\nNed Raggett of Allmusic said, &quot;The seeming schizophrenia between massive rock crunch and gentle acoustic numbers was actually one of Alice in Chains' strongest traits, and on the brilliant &quot;I Stay Away&quot; the two impulses fused to create what on balance was the band's most uplifting song, sonically if not always lyrically.&quot;\n\nJar of Flies is the third studio EP by the American grunge band Alice in Chains, released on January 25, 1994 through Columbia Records. It is the first EP to be ranked number one on the Billboard 200 Chart and was well-received by critics.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5207e34556f2b70260ba42d88257d683deb6bfad","amp;dn":"Alice+In+Chains+-+I+Stay+Away+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5207e34556f2b70260ba42d88257d683deb6bfad","infoHashBuffer":{"type":"Buffer","data":[82,7,227,69,86,242,183,2,96,186,66,216,130,87,214,131,222,182,191,173]},"announce":[],"urlList":[]}}