{"title":"Messiah 2: Vengeance Is Mine 2002(ENG)(SUBS 6) 2Lions-Team","uid":5747234,"size":4692185487,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:520d5cbb8496cd47d117d2e97995485a078d27b8&amp;dn=Messiah+2%3A+Vengeance+Is+Mine+2002%28ENG%29%28SUBS+6%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1281264263,"description":"Messiah 2: Vengeance Is Mine  2002     \n\n \n  Messiah Miniseries /Collectie - Deel 2: Vengeance Is Mine (DVD 5) \n\nIn Messiah ? Vengeance Is Mine, het meeslepende vervolg op de succesvolle psychologische thriller Messiah, keert hoofdinspecteur Red Metcalfe terug voor een onderzoek naar een nog verontrustender serie wrede moorden, die in koelen bloede gepleegd zijn. En dit keer komt het gevaar wel erg dichtbij. Vier verschrikkelijke moorden uit het verleden inspireren iemand tot nieuwe moorden, maar degenen die voor die moorden veroordeeld zijn, zitten allemaal in de gevangenis. Als Metcalfe's broer het volgende slachtoffer is - hij wordt midden op de drukke Leadenhall Market afgeslacht ? wordt voor Metcalfe de jacht op de moordenaar persoonlijk, ook al was hij niet echt close met zijn broer. De moordenaar is duidelijk uit op wraak en niemand van het onderzoeksteam of hun familie is veilig. Met de tijd op zijn hielen wordt Metcalfe gedwongen om mogelijke corruptie in eigen gelederen te onderzoeken. Er wordt wellicht met bewijs geknoeid of bewijs achtergehouden, waardoor de verkeerde mensen achter de tralies terecht kunnen zijn gekomen. En terwijl het onderzoekteam al dichterbij komt, verandert de moordenaar de regels van het spel en nadert langzaam zijn ultieme en afgrijselijke doel. \n\n\nEnglish\n\nDCI Red Metcalfe's next case encroaches on his personal life, plus a sadistic serial killer is at large, with each body providing an obscure clue to the fate of the next victim. Metcalfe realises that the killer is now seeking bloody vengeance for possible miscarriages of justice. Have innocent men been convicted of murder? \n\nEnglish\n\nIn Messiah: The Promise, when a prison riot erupts into violence, injured prisoners are moved to a decrepit hospital with few doctors and less security. As inmates are picked off by an unknown killer, Red must confront an old nemisis who once turtored him to the brink of madness.\n\n\n\n\n\nTaal orig. Versie : English\nSubs : Danish, English, Dutch, Norwegian, Finnish, Swedish\nAudio : Dolby Digital 2.0\nMenu : Yes\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Misdaad\nDrama\nMysterie\nThriller\n \nWeblink : http://www.imdb.com/title/tt0323236/ \nWeblink :\n\n******************************************\n\nBrought to you by \nPioen\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n                                &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\t\n\n \n \n \n","torrent":{"xt":"urn:btih:520d5cbb8496cd47d117d2e97995485a078d27b8","amp;dn":"Messiah+2%3A+Vengeance+Is+Mine+2002%28ENG%29%28SUBS+6%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"520d5cbb8496cd47d117d2e97995485a078d27b8","infoHashBuffer":{"type":"Buffer","data":[82,13,92,187,132,150,205,71,209,23,210,233,121,149,72,90,7,141,39,184]},"announce":[],"urlList":[]}}