{"title":"Autumn Gatherings: Casual Food to Enjoy with Family and Friends","uid":5685022,"size":14375650,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:527e66ec6879e3b512defc6ba5d2800b6a8fdb83&amp;dn=Autumn+Gatherings%3A+Casual+Food+to+Enjoy+with+Family+and+Friends&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1278908465,"description":"Autumn Gatherings: Casual Food to Enjoy with Family and Friends\n\n\nWilliam Morrow Cookbooks | 2008 | ISBN: 0061438847 | 176 pages | PDF | 14 MB\n\n\nWhen the leaves start to fall and the temperature begins to drop, it's time to cozy up with comfort food that takes full advantage of the season's flavors. From squash and root vegetables to cranberries and quince to hearty, savory dishes, Autumn Gatherings will help you make the most of this season's natural bounty.\n\nAward-winning cooking instructor Rick Rodgers recipes are purposefully uncomplicated, focusing on the flavors, aromas, and colors of autumn. Warm up the dinner hour with Broccoli and Roast Garlic Soup, Baked Cardoons in Fontina Sauce, Leg of Lamb with Roasted Ratatouille, and Pumpkin Sticky Toffee Pudding. Take tailgating up a notch with Hoboken Cheesesteaks, Celery Root and Red Pepper Slaw, Warm Roasted Butternut Squash Salsa with Tortilla Chips, and Fig Bars. Sweeten a Halloween party with Carrot Apple Cupcakes with Cream Cheese Frosting. And family and friends can give thanks over Dry-Brined Roast Turkey with Cider Gravy, Cornbread Stuffing with Dried Fruits and Hazelnuts, Mashed Potatoes with Mascarpone and Roasted Garlic, and Concord Grape Pie.\n\nFrom the last golden days of August to early December evenings in front of the fire, everyone can celebrate the pleasures of the fall harvest. With delicious recipes and beautiful color photographs, Rick Rodgers and Autumn Gatherings will help inspire you to make the most of this wonderful season.","torrent":{"xt":"urn:btih:527e66ec6879e3b512defc6ba5d2800b6a8fdb83","amp;dn":"Autumn+Gatherings%3A+Casual+Food+to+Enjoy+with+Family+and+Friends","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"527e66ec6879e3b512defc6ba5d2800b6a8fdb83","infoHashBuffer":{"type":"Buffer","data":[82,126,102,236,104,121,227,181,18,222,252,107,165,210,128,11,106,143,219,131]},"announce":[],"urlList":[]}}