{"title":"The Ramones - Time Has  Come  Today (2nafish)","uid":5877486,"size":157906948,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:53c66d016de9e44bd6a39d8a50544d8920392693&amp;dn=The+Ramones+-+Time+Has++Come++Today+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1286705352,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Time Has Come Today&quot; is a song recorded by The Chambers Brothers in 1966. It spent five weeks at #11 on the Billboard Hot 100 in the fall of 1968.\n\nThis song was very much ahead of its time and used many different effects in its recording. The most notable characteristic of this work is the constant presence of the cow bell which produces a &quot;tick-tock&quot; sound throughout the entire song.\n\nPunk band the Ramones recorded a cover version of this song in 1983, which also was released as a single. This version is available on the band's album Subterranean Jungle.\n\nSubterranean Jungle is the seventh studio album by the American punk rock band The Ramones. It was released in February 1983 and peaked at position eighty-three on the Billboard album music chart. It was re-released on August 20th, 2002 on CD by Rhino Records.\n\n&quot;Time Bomb&quot; featured Dee Dee's first lead vocal on a Ramones album. &quot;Little Bit o' Soul&quot; was a cover of a song originally recorded by The Music Explosion in 1967. &quot;I Need Your Love&quot; was also a cover song, originally recorded by The Boyfriends, as was &quot;Time Has Come Today&quot;, originally recorded by The Chambers Brothers in 1968.\n\nMarky Ramone was dismissed from the band during the production of the album. He can be seen lurking almost invisibly behind the window on the front album cover. Heartbreaker Billy Rogers filled in for him on &quot;Time Has Come Today&quot;, the album also features Heartbreaker Walter Lure on guitar. In the music videos for &quot;Psycho Therapy&quot; and &quot;Time Has Come Today,&quot; Richie Ramone plays the drums.\n\n&quot;Outsider&quot; was covered by the American punk rock band Green Day on We're a Happy Family: A Tribute to the Ramones and also released on their album Shenanigans. &quot;Psycho Therapy&quot; was recorded by Skid Row as part of their album, B-Side Ourselves.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:53c66d016de9e44bd6a39d8a50544d8920392693","amp;dn":"The+Ramones+-+Time+Has++Come++Today+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53c66d016de9e44bd6a39d8a50544d8920392693","infoHashBuffer":{"type":"Buffer","data":[83,198,109,1,109,233,228,75,214,163,157,138,80,84,77,137,32,57,38,147]},"announce":[],"urlList":[]}}