{"title":"Coast to Coast AM - 07-17-10 - Radionic Technology","uid":5702779,"size":56075137,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:55f59d3b88d7115fa51ca9cce702eaea925b064b&amp;dn=Coast+to+Coast+AM+-+07-17-10+-+Radionic+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1279571142,"description":"Date:\n 07-17-10\n \nHost:\n Ian Punnett\n \nGuests:\n Duncan Laurie, Al Jardine \n \n\n\nAuthor and artist Duncan Laurie joined Ian Punnett for a discussion on the history and potential uses of radionic technology. According to Laurie, radionics encompasses a wide variety of alternative healing methodologies, and is based upon three assumptions: 1) all matter emits radiation, 2) the human body can be used to detect those radiations, and 3) the mind can influence these radiations in extraordinary ways. \n\nLaurie traced the concept's discovery to neurologist Dr. Albert Abrams (1864-1924), who built electronic devices that could purportedly determine the health of human tissue by its radiation, or resonance, as well as heal an afflicted patient's condition via energy and directed intent. Laurie outlined how he believes such radionic technology works, noting the challenges of quantifying it scientifically and pointing out that radionics actually has more in common with art and the practice of dowsing. \n\nBeach Boy Al Jardine\nIan spoke with founding member of the Beach Boys, Al Jardine, in the first hour of the program. Jardine talked about his days in the band, their appearance in the 1964 concert film, T.A.M.I. Show, and some of the songs that made them famous. Jardine said he was surprised by the success of &quot;Barbara Ann,&quot; as the band spent very little time producing it. One of the Beach Boys biggest hits, &quot;Help Me, Rhonda,&quot; features Jardine on lead vocal. A new version of the song can be found on Jardine's latest release, A Postcard From California, which also features the work of rock all-stars Steve Miller, Neil Young, David Crosby, Stephen Stills, and many others. \n\n\nWebsite(s):\nduncanlaurie.com\naljardine.com\nBook(s):\nThe Secret Art: A Brief History of Radionic Technology\nCD(s):\nA Postcard From California","torrent":{"xt":"urn:btih:55f59d3b88d7115fa51ca9cce702eaea925b064b","amp;dn":"Coast+to+Coast+AM+-+07-17-10+-+Radionic+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55f59d3b88d7115fa51ca9cce702eaea925b064b","infoHashBuffer":{"type":"Buffer","data":[85,245,157,59,136,215,17,95,165,28,169,204,231,2,234,234,146,91,6,75]},"announce":[],"urlList":[]}}