{"title":"Los Sims 3 [R.Free][Multi5][Spanish][Xbox360][www.consolasatope.","uid":5912516,"size":7838695874,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:5618fca4adf8286af6e04e5e705d10889ac67c86&amp;dn=Los+Sims+3+%5BR.Free%5D%5BMulti5%5D%5BSpanish%5D%5BXbox360%5D%5Bwww.consolasatope.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":4,"time":1288054383,"description":"Universo Sim\nLos Sims 3, como cualquier videojuego de la saga que se precie, comienza con la fase de ediciÃƒÂ³n del personaje. En Xbox 360 y PlayStation 3 la herramienta de personalizaciÃƒÂ³n de nuestros Sims es virtualmente idÃƒÂ©ntica a la de compatibles, y es que sino fuera por que su manejo se lleva a cabo con el pad, en lugar de con el combo de ratÃƒÂ³n y teclado, podrÃƒÂ­amos pensar que estamos hablando de la misma versiÃƒÂ³n.\n\nLÃƒÂ³gicamente hay algunos pequeÃƒÂ±os ajustes en los interfaces para hacerlo todo mÃƒÂ¡s cÃƒÂ³modo, pero todas las opciones de personalizaciÃƒÂ³n estÃƒÂ¡n presentes con todo lujo de detalles, y ademÃƒÂ¡s existirÃƒÂ¡ integraciÃƒÂ³n de items con la tienda on-line; asÃƒÂ­ como con pleno acceso a todas las creaciones que la comunidad de usuarios estÃƒÂ© realizando. Y es que de hecho el componente on-line persistente serÃƒÂ¡ una de las principales caracterÃƒÂ­sticas del videojuego. En Electronic Arts son conscientes de que hay una gigantesca comunidad detrÃƒÂ¡s de la saga Los Sims al completo, y pretenden explotarla de una forma tan detallada o mÃƒÂ¡s que lo que las entregas anteriores han conseguido en compatibles.\n\nUna vez desarrollado todo lo que tenga que ver con el personaje nos dispondremos a crear un lugar donde ÃƒÂ©l pueda vivir, otro paso fundamental en la saga. AquÃƒÂ­ nuevamente tendremos a nuestra disposiciÃƒÂ³n el enorme abanico de opciones de personalizaciÃƒÂ³n de construcciones y muebles, asÃƒÂ­ como con todas las posibilidades que la tienda on-line y, presumiblemente, la comunidad de usuarios vaya creando progresivamente.\n\nUna vez creada nuestra unidad familiar y erigido el lugar donde vivirÃƒÂ¡n nuestras simpÃƒÂ¡ticas criaturas, Ã‚Â¿quÃƒÂ© nos queda? Vivir, bÃƒÂ¡sicamente. Al igual que en cualquier entrega de Los Sims en PC nuestra meta es tan sencilla, y tan complicada, como la de hacer lo que queramos con nuestros personajes. Ã‚Â¿Deseamos que sean felices, adinerados, guapos e higiÃƒÂ©nicos? Hecho Ã‚Â¿Deseamos que sean horrorosos, malvivan, sean asociales, infelices y se muevan en la inmundicia? Hecho tambiÃƒÂ©n. Los Sims 3 en Xbox 360 y PlayStation 3 nos permite hacer lo mismo que en la versiÃƒÂ³n de compatibles, sÃƒÂ³lo que con algunos pequeÃƒÂ±os extras propios de esta ediciÃƒÂ³n.\n\nEn Los Sims 2, de hecho, se introdujo el sistema de las aspiraciones por el cuÃƒÂ¡l nuestros personajes tenÃƒÂ­an una serie de Quests alternativas que, de cumplirlas, tendrÃƒÂ­an suculentos beneficios para sus vidas. Este sistema se recupera de alguna manera en Los Sims 3 para consolas, y es que habrÃƒÂ¡ una serie de puntos de desafÃƒÂ­o que obtendremos por llevar a cabo diferentes acciones como, por ejemplo, recibir el primer beso en la faceta romÃƒÂ¡ntica, o protagonizar un ascenso en el trabajo.\n\n","torrent":{"xt":"urn:btih:5618fca4adf8286af6e04e5e705d10889ac67c86","amp;dn":"Los+Sims+3+%5BR.Free%5D%5BMulti5%5D%5BSpanish%5D%5BXbox360%5D%5Bwww.consolasatope.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5618fca4adf8286af6e04e5e705d10889ac67c86","infoHashBuffer":{"type":"Buffer","data":[86,24,252,164,173,248,40,106,246,224,78,94,112,93,16,136,154,198,124,134]},"announce":[],"urlList":[]}}