{"title":"MuPhobia - Mu Online - Cliente sem som","uid":5712363,"size":137610190,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:56becc8bd9d3e90062da56cbd246700b8ed52589&amp;dn=MuPhobia+-+Mu+Online+-+Cliente+sem+som&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1279950079,"description":"Cliente MuPhobia sem som, mesma fucnionalidade que o cliente completo, apenas nao tem os sons para que o cliente fique menor (130MB).\n\n\nMuPhobia - Levando a serio a sua diversao\n\n\n\nAcesse [url]muphobia.com[/url] cadastre-se e venha fazer a sua historia!\n\n\n\nHistÃƒÂ³ria\n\n\n\nHÃƒÂ¡ muito tempo, o mundo de Mu era muito fÃƒÂ©rtil e prÃƒÂ³spero. Mas este mundo se tornou caÃƒÂ³tico e caiu em desgraÃƒÂ§a devido ÃƒÂ s lutas entre os senhores feudais da regiÃƒÂ£o, que desgastaram seu poder. Apesar das tentativas, os poucos senhores feudais que resistiram nÃƒÂ£o conseguiram impedir que uma terra bela se tornasse um lugar horrivelmente manchado pelo sangue da guerra.\n\n\n\nMU online\n\n\n\nCom isso, Antonias, um terrÃƒÂ­vel homem ambicioso se entregou aos desejos de Lemulia, uma feiticeira maligna, e libertou Kundun, um demÃƒÂ´nio cuja intenÃƒÂ§ÃƒÂ£o era dominar a Terra e escravizar a humanidade. Com a ascensÃƒÂ£o de Kundun ao poder, ele trouxe ao mundo seus asseclas imundos que esconderam a ÃƒÂºnica forma de conter o demÃƒÂ´nio: o selo de Etramu, que foi dividido em oito partes e mantido guardado por criaturas detestÃƒÂ¡veis.\n\nAgora, a ÃƒÂºnica esperanÃƒÂ§a de salvaÃƒÂ§ÃƒÂ£o estÃƒÂ¡ em herÃƒÂ³is que podem aprisionar novamente Kundun com o selo de Etramu, tornando o mundo livre novamente. Escolha uma entre as quatro classes de herÃƒÂ³is e junte-se a este imenso exÃƒÂ©rcito para combater o mal. Cavaleiros Negros, Fadas, Feiticeiros Negros,  Gladiadores MÃƒÂ¡gicos e Lord das Trevas.\n\n\n\n\nMais que completo\n\n\n\n\nMu Online tambÃƒÂ©m foi um dos primeiros MMOs a trazer uma imensa variedade de opÃƒÂ§ÃƒÂµes aos jogadores. Seus desenvolvedores se preocuparam em representar desde efeitos climÃƒÂ¡ticos atÃƒÂ© detalhes do cenÃƒÂ¡rio. TambÃƒÂ©m possui um sistema inovador pelo qual os jogadores combinam itens para gerar novos, ao todo existem mais de mil combinaÃƒÂ§ÃƒÂµes diferentes para serem testadas.\n\nSuas armas, armaduras e equipamentos podem lhe fornecer poderes ÃƒÂºnicos. Alguns sÃƒÂ£o divididos em diferentes classes, caso o jogador conseguir juntar o kit completo, ÃƒÂ© bonificado. Suas magias e golpes especiais variam de acordo com cada personagem e definem as caracterÃƒÂ­sticas de batalha do seu personagem.\n\nIsso sem falar dos inÃƒÂºmeros eventos especiais em que jogadores se enfrentam, sistema de guildas, comÃƒÂ©rcio e troca entre os jogadores e tudo o que um RPG online tem de melhor. Mu Online nÃƒÂ£o abre mÃƒÂ£o da jogabilidade simples e intuitiva que atrai jogadores de todos os nÃƒÂ­veis de habilidade.","torrent":{"xt":"urn:btih:56becc8bd9d3e90062da56cbd246700b8ed52589","amp;dn":"MuPhobia+-+Mu+Online+-+Cliente+sem+som","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56becc8bd9d3e90062da56cbd246700b8ed52589","infoHashBuffer":{"type":"Buffer","data":[86,190,204,139,217,211,233,0,98,218,86,203,210,70,112,11,142,213,37,137]},"announce":[],"urlList":[]}}