{"title":"Encyclopedia of Wars - 3 Volume of Set (Fact on File Library of ","uid":5828086,"size":36116260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58fbd35a5aa9adbdeae74c4be455a60f04effb4e&amp;dn=Encyclopedia+of+Wars+-+3+Volume+of+Set+%28Fact+on+File+Library+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Djofullinn","files":1,"time":1284404213,"description":"$300 set.\n\nTargeted especially to students and teachers of history, this set on wars will also be of interest to the general public. The work focuses on details of the fighting as well as on the social and political contexts of the time of each war. Arranged alphabetically (from Abbasid Revolution to Zulu War), the more than 1,800 entries cover the rather obscure to the more well-known wars from classical times to present day, circa 8,000 B.C.E. (Jericho, Fall of) to 2003 (United States-Iraq War).\n\nEach entry includes a list of belligerents, statement of the causes, date of the declaration of war, numbers (where known) of those bearing arms and the casualties suffered, a summary of the outcome, and names and dates of treaties or documents (if any) ending the conflict. A narrative discussion capsulizes the social and political context of the period, the major battles and events of the war, and the wider significance of the conflict. The discussions range from half a page for the Afghan revolt of 699-701 to 40-plus pages for World War II, with slight emphasis given to North American conflicts. Cross-references point to related entries and from common alternate names of conflicts. Suggestions for further reading close out the entries.\n\nVolume 1 includes a list of entries and a list of the more than 60 maps that are scattered throughout the set, and volume 3 includes a chronological listing of wars, a selected bibliography, and an index. Treatment of larger conflicts is segmented. For example, World War II is discussed in a series of entries, including Historical background, Outbreak and early German conquests, Africa and the Mediterranean, Atlantic front, China-Burma-India Theater, Greece and the Balkans, Italian front, Pacific, Russian front, and Western front.\n\nThe authors, history professors who worked on this encyclopedia for 10 years, have produced a very readable and apparently well-researched book that both scholars and history buffs will enjoy. As with other Facts On File reference books, this set is easy to use and well designed. This would be an excellent purchase for high-school, college, and public libraries. kaye talley\nCopyright Ã‚Â© American Library Association. All rights reserved \n &lt;a href=&quot;\nhttp://www.amazon.com/Encyclopedia-Wars-Library-World-History/dp/0816028516/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1284396918&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Encyclopedia-Wars-Library-World-History/dp/0816028516/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1284396918&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:58fbd35a5aa9adbdeae74c4be455a60f04effb4e","amp;dn":"Encyclopedia+of+Wars+-+3+Volume+of+Set+%28Fact+on+File+Library+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58fbd35a5aa9adbdeae74c4be455a60f04effb4e","infoHashBuffer":{"type":"Buffer","data":[88,251,211,90,90,169,173,189,234,231,76,75,228,85,166,15,4,239,251,78]},"announce":[],"urlList":[]}}