{"title":"F1 2010 [PAL][PS3][Multi5][Spanish][www.consolasatope.com]","uid":5864752,"size":5104089077,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:596bff043bda6cad97ddf54cd271cec2cd8780e0&amp;dn=F1+2010+%5BPAL%5D%5BPS3%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":18,"time":1286114012,"description":"Plataforma: PS3\nGÃƒÂ©nero: Carreras F1\nRegiÃƒÂ³n: EUR\nIdiomas:EspaÃƒÂ±ol 100%\nFormato: FullBluRay\nTamaÃƒÂ±o Comprimido: 3,64 Gb\nTamaÃƒÂ±o Desomprimido: 4,75 GB\nCompresiÃƒÂ³n: Rar\nMÃƒÂ©todo de carga: Ps3key vers firm 2.1 + Open manager 1.3, mira Info mas abajo\n\nNota de carga: Bueno como ya sabiamos el juego no iba en cuanto a cuestiÃƒÂ³n de mando se refiere que no los reconocia. Pues bien ha salido un programa que te soluciona dicho percance.\n\nMetodo de carga:\n1. Borrar los datos de instalacion y todo los datos guardados del F1 2010.\n\n2. Instalar el MOD del Open Manager (v 1.13) en la PS3 visita www.consolasatope.com ahi tienes el programa en el post del juego ;).\n\n3. Una vez instalado en la PS3, se inicia el Open Manager. Al iniciarlo te dira si quieres usar el directorio &quot;LAUN12345&quot;, presionais &quot;No&quot;. SaldrÃƒÂ¡ posteriormente otro mensaje indicando si quieres usar el directorio &quot;OMAN46756&quot;, y presionais &quot;SÃƒÂ­&quot;.\n\n4. Hecho esto, copiar el backup del F1 2010 de vuestro ordenador a la PS3 con el ftp, o desde el bluray, al directorio &quot;OMAN46756&quot;. Yo lo pasÃƒÂ© primeramente los archivos del juego en un pendrive de 8 gigas y despues al disco duro de la ps3 con este mismo programa, una maravilla.\n\n5. Iniciar Open Manager, seleccionar el F1 2010, presionar R2 y comprobar que sale &quot;Patched Mode&quot; y a jugar. \n\nResumen:\nSumÃƒÂ©rgete en el glamour, el vÃƒÂ©rtigo y la emociÃƒÂ³n del deporte de motor mÃƒÂ¡s apasionante del mundo con F1 2010, que se coloca en la parrilla de salida con todos los pilotos, equipos y circuitos oficiales de la tan esperada temporada 2010 del Campeonato Mundial de F1 de la FIA.\nEnfrÃƒÂ©ntate a Campeones Mundiales de F1 de la FIA como Fernando Alonso, Michael Schumacher, Lewis Hamilton y Jenson Button en cualquiera de los circuitos. F1 2010 supone el regreso del Gran Premio de CanadÃƒÂ¡, el estreno de la alta definiciÃƒÂ³n en las espectaculares carreras nocturnas de Abu Dhabi y Singapur y la oportunidad de recorrer el flamante circuito de Corea del Sur antes incluso de que los pilotos. Gracias a la plataforma tecnolÃƒÂ³gica para juegos EGO de Codemasters, el mundo de la FÃƒÂ³rmula 1 cobra vida con unas imÃƒÂ¡genes sublimes, un control realista, la climatologÃƒÂ­a mÃƒÂ¡s variada y el mejor sistema de daÃƒÂ±os del mercado en distintos modos de juego con partidas rÃƒÂ¡pidas, trayectoria profesional y partidas multijugador en lÃƒÂ­nea.\nEntra en el corazÃƒÂ³n de la FÃƒÂ³rmula 1 como nunca con F1 2010.","torrent":{"xt":"urn:btih:596bff043bda6cad97ddf54cd271cec2cd8780e0","amp;dn":"F1+2010+%5BPAL%5D%5BPS3%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"596bff043bda6cad97ddf54cd271cec2cd8780e0","infoHashBuffer":{"type":"Buffer","data":[89,107,255,4,59,218,108,173,151,221,245,76,210,113,206,194,205,135,128,224]},"announce":[],"urlList":[]}}