{"title":"The Human League - Love Action (I Believe In Love).VOB","uid":5845343,"size":179367936,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5a4a59c6837673432acfc0ca4610dbb286939993&amp;dn=The+Human+League+-+Love+Action+%28I+Believe+In+Love%29.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1285148854,"description":"The Human League - Love Action (I Believe In Love).VOB\n\n\n\nVery HQ rare promo music video. &quot;Love Action (I Believe in Love)&quot; is a song by the British synthpop group The Human League, released as a single in the UK in July 1981. It peaked at number three in the UK Singles Chart, the band's first Top 10 success.\n\nThe song was written jointly by lead singer Philip Oakey and keyboard player Ian Burden and features lead vocal by Oakey and female backing vocals by Susanne Sulley (now Susan Ann Sulley) and Joanne Catherall, analogue synthesizers by Jo Callis, Philip Adrian Wright and Ian Burden. Drum machines, sequencing and programming were provided by producer Martin Rushent. One of the most notable synth sounds on the recording makes use of the pitch-to-voltage converter and envelope shaper on the Roland System 700 modular synth. Jo Callis' guitar strumming was fed into the synth and used to shape and trigger the sounds, producing an unusual choppy, strumming synth patch.\n\nOriginally the song was released without a promotional video. The reason was that in 1981 promotional videos were still rare, very expensive and only very high-profile bands received them. At this point the Human League were not sufficiently marketable to warrant the expense of a video.\n\nIn 1982, for the U.S. release of &quot;Love Action&quot;, a video was shot retrospectively. The storyline is loosely based on the 1968 film The Graduate. The opening scene is an exact copy of the church scene from the film with Oakey taking Dustin Hoffman's role. The majority of the video was filmed on a derelict South London council estate. Most of the female camera time goes to Joanne Catherall, in a wedding dress for the first half. Susan Ann Sulley threw a temper tantrum in her main scene throwing objects around a flat. She accidentally managed to score a direct hit on the camera and a production crew member with a flying lamp. She momentarily broke character and cringed as she realizes she had just hit one of the crew.\n(video does not have any logos)\n\n\n  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Love_Action_(I_Believe_in_Love)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Love_Action_(I_Believe_in_Love)&lt;/a&gt;\n      &lt;a href=&quot;\nhttp://bayimg.com/GABPhAAdG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/GABPhAAdG&lt;/a&gt;\n\n\n\nFile properties taken with Media Player Classic:\n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 6000kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 2 chn, 16 bit]\n   Media Length: 00:03:47\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt;\n\nSgtRlee (Sgt.R.Lee)\n\t","torrent":{"xt":"urn:btih:5a4a59c6837673432acfc0ca4610dbb286939993","amp;dn":"The+Human+League+-+Love+Action+%28I+Believe+In+Love%29.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a4a59c6837673432acfc0ca4610dbb286939993","infoHashBuffer":{"type":"Buffer","data":[90,74,89,198,131,118,115,67,42,207,192,202,70,16,219,178,134,147,153,147]},"announce":[],"urlList":[]}}