{"title":"Halo Reach [R.Free][Xbox360][Spanish.AudioyTextos][www.consolasa","uid":5829879,"size":7838695877,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:5af133dda5a9fd7c37624de45019f1b09cdb444f&amp;dn=Halo+Reach+%5BR.Free%5D%5BXbox360%5D%5BSpanish.AudioyTextos%5D%5Bwww.consolasa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":4,"time":1284470350,"description":"Halo Reach narra la trÃƒÂ¡gica y heroica historia del &quot;NobleTeam&quot;, un grupo de soldados Spartans que, con gran sacrificio y valor, han salvado infinidad de vidas a pesar de tener todo en contra. El planeta Reach es la ÃƒÂºltima lÃƒÂ­nea de defensa de la humanidad entre los terribles Covenant y su objetivo final: la destrucciÃƒÂ³n de la Tierra. Si fracasa, la humanidad caminarÃƒÂ¡ rumbo al inicio de su destrucciÃƒÂ³n.\n\nCaracterÃƒÂ­sticas:\nBienvenido al NobleTeam Halo Reach sumerge a los jugadores en una siniestra y heroica historia como integrantes del &quot;Noble Team&quot;, un ejÃƒÂ©rcito de emblemÃƒÂ¡ticos soldados Spartan, cada uno de ellos con talentos tan ÃƒÂºnicos como sus personalidades y su equipamiento customizado.\nUna campaÃƒÂ±a intensa y ÃƒÂ©pica Los jugadores vivirÃƒÂ¡n los acontecimientos que crearon el marco para la trilogÃƒÂ­a &quot;Halo&quot;, con el conflicto surgido entre la UNSC y los Covenant en plena cÃƒÂºspide de su poderÃƒÂ­o militar. Nuevas armas, vehÃƒÂ­culos y aptitudes completarÃƒÂ¡n el ya conocido arsenal de Halo en batallas de proporciones nunca vistas. Una inteligencia artificial extremadamente avanzada aÃƒÂ±ade profundidad y complejidad a cada combate, logrando que cada enfrentamiento sea una experiencia ÃƒÂºnica y desafiante, tanto en las partidas individuales como jugando con hasta tres amigos en cooperativo.\nExperiencia multijugador insuperable A la altura de la campaÃƒÂ±a mÃƒÂ¡s ÃƒÂ©pica en la historia de Halo, la batalla prosigue online, donde la variedad de opciones multijugador de Halo: Reach, espectacularmente ampliada, volverÃƒÂ¡ a redefinir el panorama de los juegos online y ofrecer una experiencia sin igual a millones de fans de Halo. Halo Reach eleva una vez mÃƒÂ¡s el listÃƒÂ³n del juego online, la personalizaciÃƒÂ³n de elementos, el matchmaking y la integraciÃƒÂ³n de la comunidad.\nCon la introducciÃƒÂ³n de nuevas configuraciones sociales, los jugadores podrÃƒÂ¡n encontrar a compaÃƒÂ±eros de equipo de ideas afines con los que jugar, votar sus mapas y tipos de juego preferidos, y mantener una lista activa. AdemÃƒÂ¡s, todas las nuevas experiencias multijugador ofrecen una mayor variedad de modos de juego para todo tipo de jugadores.\nEl modo &quot;Invasion&quot; permite a los jugadores enfrentar a Soldados Spartan contra Elites a travÃƒÂ©s de intensas batallas por objetivos. Y el modo &quot;Arena&quot;, tremendamente competitivo, permite a los jugadores poner a punto sus habilidades en una encarnizada competiciÃƒÂ³n para lograr el derecho a figurar en lo mÃƒÂ¡s alto.\nIncreÃƒÂ­bles avances tÃƒÂ©cnicos Halo Reach da un importante paso adelante con un motor grÃƒÂ¡fico completamente nuevo que permite desplegar en pantalla impresionantes grÃƒÂ¡ficos, audio, IA, animaciÃƒÂ³n y efectos especiales al mÃƒÂ¡s puro estilo Hollywood. Los jugadores podrÃƒÂ¡n desplazarse rÃƒÂ¡pidamente por enormes escenarios de combate y luchar cara a cara junto a nuevos personajes y criaturas mientras desentraÃƒÂ±an los misterios ocultos en lo mÃƒÂ¡s profundo del universo Halo.\nCustomizaciÃƒÂ³n del personaje y recompensas Halo Reach permite customizar y personalizar a los soldados Spartan con una sorprendente variedad de accesorios para la armadura que serÃƒÂ¡n visibles tanto en las partidas multijugador como en el modo campaÃƒÂ±a. En todos los modos de juego, los jugadores serÃƒÂ¡n recompensados por todo lo que hagan, por cada estilo de juego, logrando valiosos crÃƒÂ©ditos que podrÃƒÂ¡n canjear por mejoras adicionales en el Arsenal. ","torrent":{"xt":"urn:btih:5af133dda5a9fd7c37624de45019f1b09cdb444f","amp;dn":"Halo+Reach+%5BR.Free%5D%5BXbox360%5D%5BSpanish.AudioyTextos%5D%5Bwww.consolasa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5af133dda5a9fd7c37624de45019f1b09cdb444f","infoHashBuffer":{"type":"Buffer","data":[90,241,51,221,165,169,253,124,55,98,77,228,80,25,241,176,156,219,68,79]},"announce":[],"urlList":[]}}