{"title":"Luther Vandross -  Stop  To   Love   (2nafish)","uid":5826119,"size":160878596,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5b4812060a9a6dfe489fd1ad607432e8abe7c3cf&amp;dn=Luther+Vandross+-++Stop++To+++Love+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284288234,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Stop to Love&quot; is a 1986 single by Luther Vandross. It was his first number-one single on the R&amp;B chart since &quot;Never Too Much&quot; in 1981. The upbeat single was also a crossover hit, peaking at number fifteen on the Billboard Hot 100. \n\nThe music video for the song features Vandross, along with models lip syncing, &quot;Stop!&quot;, while riding around in the streets of Los Angeles.\n\nGive Me the Reason is the fifth studio album by American R&amp;B/soul singer Luther Vandross, released on September 19, 1986. The album earned Vandross an American Music Award for &quot;Favorite Soul/R&amp;B Male Artist&quot; and a nomination for &quot;Favorite Soul/R&amp;B Album&quot; in 1988, while the title track &quot;Give Me the Reason&quot; was nominated for &quot;Best R&amp;B Vocal Performance, Male&quot; and &quot;Best R&amp;B Song&quot; in 1987.\n\nLuther Vandross finally made his long desired career breakthrough as a featured singer with the vaunted pop-dance act Change, a studio concept created by French-Italian businessman Jacques Fred Petrus. Their 1980 hits, &quot;A Lover's Holiday&quot; (by Romani and Willoughby), &quot;The Glow of Love&quot; (by Romani, Malavasi and Garfield) and &quot;Searching&quot; (by Malavasi), of which Vandross sang on all three, opened up the world for Vandross. And there was no doubt about whether Vandross liked the song &quot;The Glow of Love&quot;. In an interview that Vibe Magazine did with him in 2001 Vandross said, &quot;This is the most beautiful song I've ever sung in my life.&quot; Vandross was also originally intended to perform on the second and highly successful Change  album &quot;Miracles&quot; in 1981, but declined the offer as Petrus didn't pay enough money. Vandross' decision rapidly led to a recording contract with Epic Records  that same year but didn't stop him from doing some background vocals on &quot;Miracles&quot; and on the new Petrus created act, NYC band, The B. B. &amp; Q. band in 1981. During that hectic year Vandross jump-started his second attempt at a solo career with his debut album, Never Too Much. In addition to the hit title track it contained a version of the Burt Bacharach / Hal David song &quot;A House Is Not a Home&quot;. The song &quot;Never Too Much&quot;, written by himself, reaching number-one on the R&amp;B charts. This period also marked the beginning of frequent songwriting collaboration with bassist Marcus Miller, who played on many of the tracks and would also produce or co-produce a number of tracks for Vandross. The Never Too Much album was arranged by high school classmate Nat Adderley, Jr., a collaboration that would last through Vandross's career.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5b4812060a9a6dfe489fd1ad607432e8abe7c3cf","amp;dn":"Luther+Vandross+-++Stop++To+++Love+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b4812060a9a6dfe489fd1ad607432e8abe7c3cf","infoHashBuffer":{"type":"Buffer","data":[91,72,18,6,10,154,109,254,72,159,209,173,96,116,50,232,171,231,195,207]},"announce":[],"urlList":[]}}