{"title":"Democracy Now - 29 sep 2010","uid":5858371,"size":455813969,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5c3c58ef1a37f49fcdd2ae01c48a77d431fa2bf5&amp;dn=Democracy+Now+-+29+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1285876394,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 29, 2010\n\n- Court Exempts Corporations from Alien Tort Law\n- Judge Restores Stem Cell Funding Pending Appeal\n- US Soldier Held for Killing 2 Troops in Iraq\n- Passengers of Jewish Aid Boat to Gaza Allege Israeli Mistreatment\n- Aid Convoy Arrives in Turkey en Route to Gaza\n- Pakistan Threatens to End Protection of NATO Supply Routes\n- Thousands Protest Siddiqui Sentencing in Pakistan\n- Sen. Coburn Stalls Over $900M in Haiti Aid\n- Ousted Colombian Senator Vows to Continue Mediation Efforts\n- Study: 22% of Plant Species Face Extinction\n- Protests Continue Against FBI Raids, Subpoenas of Antiwar Activists\n\n\nSpecial reports\n\n- 1st US Soldier of Alleged &quot;Kill Team&quot; Targeting Afghan Civilians Faces Military Tribunal for War Crimes\n\nArmy Specialist Jeremy Morlock is the first of twelve US soldiers accused of forming a secret &quot;kill team&quot; in Afghanistan that murdered unarmed Afghan civilians at random and collected body parts, such as fingers, for trophies. They are also accused of using hashish, dismembering and photographing corpses, and possessing human bones such as a skull and leg bones. The Army is attempting to prevent the release of dozens of photographs that reportedly show Morlock and other soldiers posing with the murdered Afghan civilians. [includes rush transcript]\n\n\n- Mudslide Buries Scores of Homes in Indigenous Mexican Town, But Massive Toll Said to Be Averted\n\nAn indigenous town in the southern Mexican state of Oaxaca has been buried in mud and stones after incessant rain triggered a landslide early Tuesday morning. Access to the remote and impoverished town of Santa MarÃƒÂ­a Tlahuitoltepec has been restricted, with roads and bridges washed out by the rain or blocked by the landslide. Initial estimates suggested hundreds of people could be dead and up to a 1,000 people trapped in their homes, but Mexican authorities now say only eleven people have been confirmed missing. We go to Oaxaca to speak with filmmaker David Riker.\n\n\n- &quot;The Warmth of Other Suns: The Epic Story of America's Great Migration&quot;: Isabel Wilkerson Tracks Exodus of Blacks from US South\n\nWe turn now to a pivotal but largely overlooked event in US history, the mass migration of millions of African Americans from the South during the period of the Great Migration, which began in the 1910s and continued to the 1970s. Award-winning journalist and professor Isabel Wilkerson has spent the last decade researching why millions of African Americans decided to leave the towns and farms of the South on such a large scale for her new book, The Warmth of Other Suns: The Epic Story of America's Great Migration.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5c3c58ef1a37f49fcdd2ae01c48a77d431fa2bf5","amp;dn":"Democracy+Now+-+29+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c3c58ef1a37f49fcdd2ae01c48a77d431fa2bf5","infoHashBuffer":{"type":"Buffer","data":[92,60,88,239,26,55,244,159,205,210,174,1,196,138,119,212,49,250,43,245]},"announce":[],"urlList":[]}}