{"title":"MIDway 2.8 and PST","uid":5710280,"size":13071200,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5c968e72e4ffc62d0f2a5f4bf703a4a10530a9e3&amp;dn=MIDway+2.8+and+PST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":4,"time":1279868159,"description":"Comprehensive MIDway Walkthrough/Guide as seen on:\n\n &lt;a href=&quot; http://www.howardforums.com/showthread.php/473506-Comprehensive-MIDway-Walkthrough-Guide&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.howardforums.com/showthread.php/473506-Comprehensive-MIDway-Walkthrough-Guide&lt;/a&gt;\n\n---------------------------------------------------------------------\n\n    Ok guys &amp; gals, here's my attempt at a MIDway walkthrough.\n\n    Note: MIDway is a Windows application used to transfer Java games and apps to Motorola GSM phones using a serial or USB data cable.\n\n    - This walkthrough makes several assumptions.\n\n    1. That you have a Motorola phone with the Java App Loader enabled in your Java Settings Menu.\n    (If not, then you need to STOP and use PST, or P2KMAN + seem editing to enable it)\n    Note: SEEM 0032_0001 - Offset 43 - Bit 0 value=1 to enable, 0 to disable)--&gt;See HERE and HERE for more information.\n\n    2. You have a USB data cable designed specifically for Motorola phones and have successfully used it to connect to Motorola Phone tools, p2kman or PST. In other words, the USB drivers should be installed and working properly. (Serial cable users: This walkthrough was written specifically for USB cable owners but the steps to use MIDway with your cable are nearly identical)\n\n    3. You should be running Windows XP or 2000, and know how to use it. While the steps for older versions of Windows are VERY similar, I intend to have screenshots below &amp; I do not have screens for those operating systems, but the similarities should be close enough for you to find the necessary information.\n\n    4. You have the MIDway program downloaded and ready to execute. (Version 2.8 in this case)\n\n\n    --------------------------------------------------------------------------------------------\n\n    Before beginning, your PC and phone should be powered on, and your data cable should be connected to your phone only, but\n    DO NOT , I REPEAT DO NOT connect the usb cable to the PC at this time. Only connect the larger end to the phone.\n\n    STEP 1:\n    On your phone press the Menu button, and navigate to Settings, then Java Settings, then highlight the Java App Loader option(should be at the top)\n    and select it. You should then see a screen that says Insert cable Now\n\n    Insert the other end of the USB cable into your pc now. After you do this, you should see a brief screen on the phone that says 'Jal link is active...',\n    then it should return back to the Java Settings Screen. If not, then you have USB driver issues that need to be resolved before proceeding.\n\n    STEP 2:\n    On your PC, open the control panel, then open the Phone and Modem options applet and click the Modems Tab at the top.\n\n    At this point your screen should look something like this:\n    .\n\n\n    IMPORTANT: Take note of the Com port number listed (COM 3 in this example). This information is also located in the device manager under\n    Motorola USB modem properties, Advanced tab, Advanced Port settings button.\n\n    Once you've made a note (mental or otherwise) of the com port number, close the control panel and the Phone &amp; Modem options applet.\n\n    STEP 3:\n\n    At this point you should run the Midway program from wherever you have it stored on your particular pc.\n    Once opened, your screen should look like the one below:\n\n    .\n\n    Note: If you receive an error that states &quot;Cannot open serial port! Would you like to change MIDway settings,&quot;click 'YES' and skip ahead to STEP 5\n\n\n    STEP 4:\n\n    Click on File, then Settings as I did in the screen capture below.\n\n\n    STEP 5:\n\n    Once done that will bring you to the screen below:\n    At this point you should change the COM port to match what was listed earlier in the control panel.\n    Hopefully you remember it or wrote it down. In addition, the baud rate should be set to 115200 and the AT command\n    box should be left blank. Once you've confirmed these settings click the 'OK' button and move along to STEP 6:\n    .\n\n\n    STEP 6:\n\n    Click on the 'Open JAD' button on the program, circled in red below:\n\n\n    Browse to the location on your PC where you have your JAVA game or App stored. (MIDway is designed to only look for files\n    with an extension of .JAD, so if you only have files with a .JAR extention then you need a program such as jadmaker\n    or jadgen to make a JAD file in order for MIDway to recognize it )\n\n    Once you've highlighted the one you want to transfer to the phone, click on the Open button as shown below.\n\n\n    STEP 7:\n\n    Once you've done that, you will see the screen below, click on the 'Send JAD' button that's circled in red.\n\n\n    After you click this button, the screen on your PHONE should then change and show details on the game/app\n    you chose (Name, Size, Version &amp; Vendor).\n    NOTE: If you receive a TIMED OUT error ,then verify your COM port is set correctly by returning to STEP 4\n\n    Assuming that the communications between the phone &amp; pc are normal, your options at the bottom of the phone's screen\n    should be CANCEL or DOWNLD. Press Download and the transfer should begin.\n    This may take some time depending on the size of the game/app in question, but the phone should show a download progress meter.\n\n    Once the transfer is done you should see a screen that says &quot;Download Complete&quot;, then another that says &quot;installing..&quot;\n\n    At this point, the game or app will either install successfully, fail or give an error message stating &quot;Application installed but may have limited functionality&quot;\n    In those cases the game should still run, but parts of game may not function, such as sound or the controls (This varies depending entirely on the game/app in question)\n\n    The phone should then prompt if you want to run the game/app or not.\n    If you DO, I recommend you close MIDway on the PC first, then disconnect the cable from phone &amp; pc and enjoy your new game.\n\n    ----------\n    Personal Note: For some bizarre &amp; paranoid reason, I always feel the need to shut the phone off, and restart it at this point.\n    I probably have Microsoft to thank for this superstition, but restarting make me feel like everything is saved &amp; configured properly and the universe is back in balance.\n    ----------\n\n    If you choose not to play the game and select 'NO,' you can then select another game or app to transfer by going back to step STEP 6\n\n\n    I hope this walkthrough turns out to be useful for someone, because it took a long time and its WAY past my bedtime\n\n    Enjoy, Peace and keep the to a minimum.\n\n    Remember, we were all newbies at one point. \n-------------------------------------------------------------------\n\nThis torrent also includes PST which enables the Java Menu on the phone in order to use Midway.","torrent":{"xt":"urn:btih:5c968e72e4ffc62d0f2a5f4bf703a4a10530a9e3","amp;dn":"MIDway+2.8+and+PST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c968e72e4ffc62d0f2a5f4bf703a4a10530a9e3","infoHashBuffer":{"type":"Buffer","data":[92,150,142,114,228,255,198,45,15,42,95,75,247,3,164,161,5,48,169,227]},"announce":[],"urlList":[]}}