{"title":"HISTORY OF POP AND ROCK MUSIC - part 269","uid":5891798,"size":744223046,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5ce18c5bd03ddeedf9d227faf01bf3b3e1fc3041&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+269&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1287283130,"description":"  \n\n\n                     PART  269 \n\n\n               HIM  -  Wicked Game  (1998)\n               HIM  -  Pretending  (2001)\n               HIM  -  Buried Alive By Love (2003)\n               HIM  -  Wings of a Butterfly  (2005)\n\n\n\n\n         &quot;Wicked Game&quot; is a 1989 song by Chris Isaak.The Finnish band HIM remade this song, first using it in their demo &quot;This is Only the Beginning&quot;, then in their EP &quot;666 Ways To Love: Prologue&quot;, then another recording on their first album &quot;Greatest Love Songs Vol. 666&quot;, and lastly on the British and American versions of their second album &quot;Razorblade Romance&quot;. The last recording they made of it then reappeared on their compilation album &quot;And Love Said No - The Greatest Hits 1997-2004&quot;. With &quot;Wicked Game&quot; on their EP and first album, HIM gained fame in their native Finland. \n       &quot;Pretending&quot; is a song by  HIM, released in 2001 as the fifth track from their album &quot;Deep Shadows and Brilliant Highlights&quot;.In 2006, &quot;Pretending&quot; (acoustic version) was released as a double-single along with &quot;In Joy and Sorrow&quot; (string version) on the album &quot;Uneasy Listening Vol. 1&quot;. &quot;In Joy and Sorrow&quot; (string version) is the fifth track on Uneasy Listening Vol. 1 while &quot;Pretending&quot; (acoustic version) was an exclusive sixteenth track only available by buying the album from Best Buy. &quot;In Joy and Sorrow&quot;/&quot;Pretending&quot; reached #1 in Finland.\n        &quot;Buried Alive By Love&quot; is a song by HIM, released in 2003. It is the first track and second single from the album &quot;Love Metal&quot;. The music video was directed by Bam Margera. Margera has also directed music videos for 3 other songs including, &quot;The Sacrament&quot;, &quot;Solitary Man&quot; and &quot;And Love Said No&quot;. The music video features actress and singer Juliette Lewis.  \n       &quot;Wings of a Butterfly&quot;, also released as &quot;Rip Out the Wings of a Butterfly&quot;, is a song by HIM. It is the second track on the 2005 album &quot;Dark Light&quot; and was released as the album's first single that year. The song reached #1 on the Finnish charts, #10 in Germany and the UK, and #87 in the U.S., making it the biggest single from &quot;Dark Light&quot;. The music video, filmed at Union Station in Los Angeles, was #1 on the Rock Countdown on MTV2 in late 2005 for five weeks until it retired.\n                 ","torrent":{"xt":"urn:btih:5ce18c5bd03ddeedf9d227faf01bf3b3e1fc3041","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+269","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce18c5bd03ddeedf9d227faf01bf3b3e1fc3041","infoHashBuffer":{"type":"Buffer","data":[92,225,140,91,208,61,222,237,249,210,39,250,240,27,243,179,225,252,48,65]},"announce":[],"urlList":[]}}