{"title":"Democracy Now - 22 oct 2010","uid":5903594,"size":456082014,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5d0a1deda4cdfd17be17d439e361ded85c2a969a&amp;dn=Democracy+Now+-+22+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1287765043,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 22, 2010\n\n- Nearly 140 Dead in Feared Haitian Cholera Outbreak\n- Official: U.S. Claims of Afghan Peace Talks a &quot;Psychological Operation&quot;\n- U.S. to Unveil $2B in Pakistani Military Aid; Training Denied to Units Linked to Killings\n- &quot;Viva Palestinia&quot; Aid Convoy Enters Gaza\n- Bulldozer Driver Testifies at Corrie Wrongful Death Trial\n- Koch Brothers Convened Right-Wing Meeting in June\n- 45 Donors Account for Half of Chamber's Funding\n- Swift Boat Donor Spending $13M on Midterm Elections\n- Obama Campaigns for Sen. Murray in Washington\n- Alleged &quot;Kill Team&quot; Ringleader Refuses to Testify\n- Pentagon Hosted Awlaki After 9/11\n- Freed Iranian-American Returns to U.S.\n- Rep. Grijalva Closes Office over Suspicious Package\n\n\nSpecial reports\n\n- WikiLeaks Prepares Largest Intel Leak in U.S. History With Release of 400,000 Iraq War Docs\n\nThe whistleblowing group WikiLeaks is preparing to release up to 400,000 US intelligence reports on the Iraq war. The disclosure would comprise the biggest leak in US history, far more than the 91,000 Afghanistan war logs WikiLeaks released this summer. We speak to the nation's most famous whistleblower, Daniel Ellsberg, who leaked the secret history of the Vietnam War in 1971.\n\n\n- Juan Gonzalez: Controversial Evaluations System Will Unfairly Target New York Teachers\n\nIn his latest column, Democracy Now! co-host Juan Gonzalez says New York Schools Chancellor Joel Klein's plan to release 12,000 teacher data reports will unfairly tarnish city teachers.\nKlein's ratings system, Gonzalez writes, &quot;is one dimensional, the raw data is unverified, and even the people who designed it warned against using it as a sole barometer of teacher performance.&quot;\n\n\n- With New Limits, U.S. Military Reinstates &quot;Don't Ask, Don't Tell&quot;\n\nThe military's 17-year old on ban openly gay, lebsian, bisexual, and transgender people from joining the US military is back on the books. But based on a new directive only five senior military officials will be able to discharge service members for violating the policy. The change makes it harder for the military to remove openly gay troops. We speak to one of the most vocal critics of Don't Ask, Don't Tell, Lt. Dan Choi, who this week filed papers to re-enlist after being discharged earlier this year.\n\n\n- Does Opposing &quot;Don't Ask, Don't Tell&quot; Bolster U.S. Militarism? A Debate With Lt. Dan Choi and Queer Activist Mattilda Bernstein Sycamore\n\nWe host a debate on whether the queer rights movement should be focused on repealing the Don't Ask Don't Tell law between Lt. Dan Choi and queer anti-war activist and writer Mattilda Bernstein Sycamore. Celebrating the repeal of Don't Ask Don't Tell, Sycamore says, only makes progressive movements in the U.S. complicit with American wars in Iraq, Afghanistan and Pakistan.\n\n\n- &quot;Lawless Courts&quot;: Lack of Accountability Allows Immigration Judges to Violate Laws, Deport U.S. Citizens\n\nA new report in the Nation magazine suggests that immigration judges who are supposed to give immigrants in deportation proceedings a fair hearing have been violating the law and even deporting US citizens. The article documents serious misconduct by immigration judges in Georgia which has the country's third-largest docket. According to the report, judges here appear more concerned about deportation quotas rather than immigrants-and citizens'-rights.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:5d0a1deda4cdfd17be17d439e361ded85c2a969a","amp;dn":"Democracy+Now+-+22+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0a1deda4cdfd17be17d439e361ded85c2a969a","infoHashBuffer":{"type":"Buffer","data":[93,10,29,237,164,205,253,23,190,23,212,57,227,97,222,216,92,42,150,154]},"announce":[],"urlList":[]}}