{"title":"Democracy Now - 07 oct 2010","uid":5871728,"size":452804056,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5db60d7d72651157ab48cef59d9c49443de668fc&amp;dn=Democracy+Now+-+07+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1286479557,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 07, 2010\n\n- NATO Convoy Torched in Pakistan as US Apologizes for Fatal Attack\n- Panel: Admin Censored Disclosure of Spill Size\n- Citing Coerced Testimony, Judge Bars Witness at Gitmo Trial\n- Ohio AG Sues Ally Financial for Foreclosure Fraud\n- Wells Fargo Reaches $770M Settlement for Deceptive Loans\n- JPMorgan Chase Agent Breaks into Home of Borrower\n- US Deportations Hit Record 392,000\n- FBI Arrests 133 in Puerto Rico Corruption Probe\n- Clinton Vows Delivery of Stalled US Aid to Haiti\n- Cuba Commemorates 1976 Airliner Bombing\n- Poll: Two-Thirds Back Minimum Wage Hike\n- Students to Hold National Day of Action to Defend Public Education\n\n\nSpecial reports\n\n- Campaign Cash: The Independent Fundraising Gold Rush Since Citizens United Ruling\n\nA pair of campaign finance watchdog groups have called for a probe of a new nonprofit formed by Karl Rove to spend over $50 million this election cycle to help elect Republican candidates. The Center for Public Integrity reports Republicans and Democrats each now boast ten or so deep-pocketed independent groups with plans to spend collectively some $500 million or more. The groups are all taking advantage of this year's Supreme Court ruling in the Citizens United case that cleared the way for unlimited spending by corporations, unions and other interest groups on election ads. We speak to journalist and author Peter Stone of the Center for Public Integrity.\n\n\n- &quot;Operation Recovery&quot;: On 9th Anniversary of Afghan War, Veteran-Led Campaign Seeks to End Deployment of Traumatized Soldiers\n\nTo mark the ninth anniversary of the Afghanistan war, Iraq and Afghanistan Veterans Against the War are marching in Washington, DC today to launch the first veteran-led campaign to stop the deployment of soldiers traumatized by multiple tours of duty.\n\n\n- Iraq War Veteran Who Rescued Wounded Children in 2007 Apache Attack Describes Emotional Toll of Witnessing Infamous Killings\n\nIraq war veteran Ethan McCord was one of three US soldiers who were on the ground during the Apache helicopter assault on twelve civilians in Baghdad in 2007 that was captured in a video released by WikiLeaks. McCord is seen on the video carrying one of the wounded children in his arms to get medical help.\n\n\n- &quot;American Hypocrite&quot;: The Nation Exposes Lou Dobbs's Reliance on Undocumented Labor\n\nA new expose in The Nation magazine has revealed that Lou Dobbs has relied for years on undocumented labor for the upkeep of his multimillion-dollar estates and the horses he keeps for his daughter. Over the past year, investigative journalist Isabel Macdonald has tracked down and interviewed several workers who have done projects for Dobbs. Dobbs has been called the most influential spokesperson for the anti-immigration movement, and Dobbs has often used his TV and radio shows to criticize employers who break US law by hiring undocumented workers.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5db60d7d72651157ab48cef59d9c49443de668fc","amp;dn":"Democracy+Now+-+07+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db60d7d72651157ab48cef59d9c49443de668fc","infoHashBuffer":{"type":"Buffer","data":[93,182,13,125,114,101,17,87,171,72,206,245,157,156,73,68,61,230,104,252]},"announce":[],"urlList":[]}}