{"title":"Democracy Now - 28 oct 2010","uid":5922434,"size":456894909,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5eaa3e2c3f4371454a75208c0f69ed0eac4a9c3e&amp;dn=Democracy+Now+-+28+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1288475396,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 28, 2010\n\n- Report: Election Spending to Hit Record $4B \n- Obama Defends Record, Urges Patience \n- Angle Criticized for Anti-Immigrant TV Ad \n- Wells Fargo to Modify 55,000 Foreclosure Documents \n- Afghanistan Delays Ban on Private Military Firms \n- Obama Issues Waiver to Send Military Aid to Countries Using Child Soldiers \n- Virginia Resident Charged with Plotting to Bomb DC Metro Stations \n- Computer Malfunction Knocked US Nukes Offline \n- Arkansas School Official Facebook Post Urges Gay Youths to Commit Suicide \n- Chicago Parents End Elementary School Sit-In \n- Arizona Executes Prisoner after Supreme Court Lifts Stay \n- Fmr. Argentine President Kirchner Dies of Heart Attack\n\n\nSpecial reports\n\n- At $4 Billion, Midterm Elections Poised to Become Most Expensive Non-Presidential Vote in US History\n\nA new report says spending for the 2010 elections will break the previous record for a midterm vote by around $1 billion. According to the Center for Responsive Politics, total spending could reach as much as $4 billion this year. The report also says right-wing groups are spending more than double on advertisements than liberal organizations. We speak to the president of Common Cause, former Pennsylvania Congressman Bob Edgar. Common Cause is a nonprofit citizen's lobby promoting an accountable and transparent government.\n\n \n- &quot;Free Speech for People&quot; Coalition Calls for Constitutional Amendment to Overturn Citizens United Decision Allowing Unlimited Corporate Spending on Elections\n\nPart of the reason for the record-high campaign spending in this year's midterm elections is the Supreme Court's January ruling in Citizens United v. Federal Election Commission. In a 5-4 decision, the Court ruled corporations have First Amendment rights and that the government cannot impose restrictions on their political speech, which cleared the way for corporations and other special interest groups to spend unlimited amounts of money on elections. Earlier this month, a group of more than fifty law professors and prominent attorneys issued a letter calling on Congress to consider a constitutional amendment to overturn the decision. We speak with two people involved with Free Speech for People, a coalition of public interest organizations that formed after the Citizens United ruling.\n\n\n- The Right to Food: Corporate, Foreign Gov't Land Grab Causing Hunger in Poor Countries\n\nThe United Nations Special Rapporteur on the Right to Food, Olivier De Schutter, joins us to discuss his recent warning that some 500 million small farmers in poor countries are suffering from hunger, partly because foreign countries and corporations have bought up large tracts of land. We're also joined by Smita Narula, author of a new study suggesting that many of the land deals in Africa and South Asia lack transparency and could threaten local communities with eviction, undermine their livelihoods, and endanger their access to food.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:5eaa3e2c3f4371454a75208c0f69ed0eac4a9c3e","amp;dn":"Democracy+Now+-+28+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eaa3e2c3f4371454a75208c0f69ed0eac4a9c3e","infoHashBuffer":{"type":"Buffer","data":[94,170,62,44,63,67,113,69,74,117,32,140,15,105,237,14,172,74,156,62]},"announce":[],"urlList":[]}}