{"title":"Coast To Coast Am - 08-03-10 - Practicing Magic","uid":5742359,"size":56334062,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:61a73f3dd3dec532a713449837b2fcd03f817080&amp;dn=Coast+To+Coast+Am+-+08-03-10+-+Practicing+Magic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lyrian","files":5,"time":1281078641,"description":"Date:\n 08-03-10\n \nHost:\n George Noory\n \nGuests:\n Donald Michael Kraig, Mitch Battros \n \n\n\nAuthor and practicing magician Donald Michael Kraig discussed the history of magick, why some people have been fearful of magicians and witches, and how simple ideas can help people manifest powerful changes. He differentiated magick from stage magic, as something that enables you to make a change in your life or environment rather than just entertain. A lot of people come to magick seeking power over others, but the more they get into it, they realize the most important thing is to gain power over oneself, as this is the path to achievement, he detailed. \n\nVarious aspects of magick that can be incorporated into a practice include Tarot, Kabbalah, astral travel, concentration, and meditation, he shared. There are different types of conjuring, Kraig noted-- an invocation is something that is done by a medium, for example, when they communicate internally with a spirit. Whereas, an evocation can be an external communication or vision, such as by scrying with a magick mirror, which is black rather than silver. \n\nHe gave tips on how to use the Law of Attraction (popularized in The Secret) but with a Kabbalah twist: Figure out exactly what you want, a car for instance. Then cut out or make a picture of the car, and put your own photo in the picture. Look at this picture for about five minutes a day, imagining yourself in the car. By first creating something on the astral plane, it can then manifest on the physical plane, he explained. Kraig also talked about the lives of famous practitioners of magick, such as Aleister Crowley, and shared exercises in how to teach yourself astral projection, as well as build up a protective aura around yourself. \n\nSolar Flare Update\nAppearing during the first half-hour, Earth changes expert Mitch Battros talked about a solar flare hitting the Earth on Tuesday. This C-class flare erupted from a sunspot and mixed with a rare form of magnetic filament. The combination of this produced a coronal mass ejection, he explained. We should expect to see some unusual weather patterns, such as aurora borealis from the charged particles, he noted. \n\n\nWebsite(s):\n-modernmagick.com\n-earthchangesmedia.com\nBook(s):\n-Modern Magick: Twelve Lessons in the High Magickal Arts\n-Solar Rain","torrent":{"xt":"urn:btih:61a73f3dd3dec532a713449837b2fcd03f817080","amp;dn":"Coast+To+Coast+Am+-+08-03-10+-+Practicing+Magic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a73f3dd3dec532a713449837b2fcd03f817080","infoHashBuffer":{"type":"Buffer","data":[97,167,63,61,211,222,197,50,167,19,68,152,55,178,252,208,63,129,112,128]},"announce":[],"urlList":[]}}