{"title":"Judas Priest - Parental Guidance (2nafish)","uid":5835880,"size":118142980,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:61f3a87c893ba8adbb5c2616bd95b7538a0f94e3&amp;dn=Judas+Priest+-+Parental+Guidance+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284722826,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Parental Guidance&quot; is the fourth song from the album Turbo by the British Heavy Metal band Judas Priest that was released on April 14, 1986. The song was released as a single in 1987.\n\nIt was written and recorded in response to Tipper Gore's attack on the band. Her organization, the Parents Music Resource Center (PMRC), placed &quot;Eat Me Alive&quot; (from Defenders of the Faith) at #3 on their list of offensive songs (a.k.a. the &quot;Filthy Fifteen&quot;), as it allegedly was about performing oral sex at gunpoint.\n\nTurbo is the 10th studio album by British heavy metal band Judas Priest.\n\nThe album was recorded June - November 1985 at Compass Point Studios in Nassau, Bahamas and mixed January - February 1986 at Record Plant Studios in Los Angeles, California. This album was first released on April 15, 1986. A remastered CD was released in 2002, adding two bonus tracks. The album marked the band's first use of guitar synthesizers.\n\nFollowing the success of their previous album, Defenders of the Faith, Judas Priest initially recorded a double album called &quot;Twin Turbos&quot;, which was never released. Instead, the material was split, with the more commercial songs appearing on Turbo. While it sold well initially, going Gold (RIAA) on June 10, 1986 and Platinum on July 24, 1987 and reaching #33 in the UK and #17 on Billboard 200, the reaction from fans was negative. Sales tapered off and the live album from the subsequent tour tanked.\n\n&quot;Reckless&quot; was asked to be on the Top Gun soundtrack, but Judas Priest declined, both because they thought the film would flop and because it would have meant leaving the song off Turbo. However, their next album, 'Ram It Down', contained a cover of Johnny B. Goode that was featured in the soundtrack for the movie of the same title.\n\n&quot;Parental Guidance&quot; was written and recorded in response to Tipper Gore's attack on the band. Her organization, the Parents Music Resource Center (PMRC), placed &quot;Eat Me Alive&quot; (from Defenders of the Faith) at #3 on their list of offensive songs (a.k.a. the &quot;Filthy Fifteen&quot;), as it allegedly was about performing oral sex at gunpoint.\n\n&quot;Turbo Lover&quot; was featured as one of the songs in the U.S. release of the 2001 PlayStation 2 game Gran Turismo 3.\n\nThe album was ranked #39 on Metal-Rules.com list over the 50 greatest glam metal albums.\n\nThe line at the end of &quot;Parental Guidance&quot;, One life I'm gonna live it up!, is a nod to the earlier Judas Priest song &quot;You've Got Another Thing Comin'&quot;.\n\nJudas Priest are an English heavy metal band from Birmingham, formed in 1968. Judas Priest's core line-up consists of vocalist Rob Halford, guitarists Glenn Tipton, K.K. Downing, and bassist Ian Hill. The band has gone through several drummers over the years, though Scott Travis  has held the position since 1989. They have been cited as an influence on many heavy metal musicians and bands. Their popularity and status as one of the definitive heavy metal bands has earned them the nickname &quot;Metal Gods&quot; from their song of the same name. They have sold over 35 million albums worldwide.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:61f3a87c893ba8adbb5c2616bd95b7538a0f94e3","amp;dn":"Judas+Priest+-+Parental+Guidance+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61f3a87c893ba8adbb5c2616bd95b7538a0f94e3","infoHashBuffer":{"type":"Buffer","data":[97,243,168,124,137,59,168,173,187,92,38,22,189,149,183,83,138,15,148,227]},"announce":[],"urlList":[]}}