{"title":"JustAnother Saturday 1975DvdRip","uid":5836600,"size":730608291,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:625c247af73c1da19a9b030f9c387581747e8f99&amp;dn=JustAnother+Saturday+1975DvdRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"madhairyscotsman","files":2,"time":1284740664,"description":"  \n \nCourtesy of BBC Television\n \n \n \n    \nFor Play for Today, BBC, tx. 7/11/1975, colour, 75 mins \n  \nDirector John Mackenzie \nProduction Company BBC \nProducer Graeme McDonald \nScript Peter McDougall \nPhotography Philip Meheux \n \n \nCast: John Morrison (John); Eileen McCallum (Lizzie); Bill Henderson (Dan); Ken Hutchison (Rab); Billy Connolly (Paddy)\n\nShow full cast and credits  \n \nOne young man's long day as participant and bystander in the Protestant Orange day parades of Glasgow 1975.\n\nShow full synopsis  \nJust Another Saturday was first broadcast on 7 November 1975, as part of BBC2's Play For Today. Britain, then as now, was a place of great inequality. Sectarian troubles in Northern Ireland were at their height. Issues of Scottish independence/devolution were in the spotlight, with the collapse of traditional industries such as shipbuilding on the Clyde, and the associated poverty, mirrored by vast wealth promised from North Sea oil in Scottish waters.\n\nThe script, screenplay, direction, film stock, lighting, photography, sound recording and editing of Just Another Saturday combine to give an understated, real-life appearance; making the emotional impact of picture and dialogue all the more intense. The use of brief close-ups of very human details add hugely to the emotional effect; faces in the crowds tell, evocatively, of Scotland's pride and sadness. Outdoor shots especially show powerful visual imagery. The Duncan Street violence is that much more disturbing because much of it is hidden from view.\n\nThe play is about beliefs and innocence, and the desire to escape. As Lizzie tells John, &quot;at least you believe in something&quot;; Dan despises all &quot;the organisations&quot; on both sides of the Glasgow Protestant/Catholic divide: he ridicules what he sees their moral hypocrisies, like &quot;suffering for the cause&quot;. There is pointed irony in the fact that the only injury John incurs over the whole day is from a confused drunk. Dan points out the divisions that the organisations cause and the many contradictions from Scottish history that make their positions absurd. His quiet socialist conviction is delivered with great pathos.\n\nJust Another Saturday portrays a genuinely warm and respectful relationship between young and old in Glasgow. Its apparently dispassionate portrayal of some of Glasgow's ills of the time - unemployment, poverty, drink, violence, history, religion, politics - only increases its power. At the same time it represents youth and hope for the future.\n\nInterestingly, the script contains several allusions to how much more violent Glasgow was during the Second World War. Dan's friend Joe mentions &quot;the razor gangs&quot; of this period. The characters' across-the-board fear of the Glasgow police is also worthy of note.\n\nThe play ends calmly, as if this is just another Saturday. Lizzie says to John, &quot;you're better off with your own, son&quot;. We are left wondering whether John will leave or whether his only real escape is the skill and adrenalin rush of the mace throwing.\n \n \n ","torrent":{"xt":"urn:btih:625c247af73c1da19a9b030f9c387581747e8f99","amp;dn":"JustAnother+Saturday+1975DvdRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"625c247af73c1da19a9b030f9c387581747e8f99","infoHashBuffer":{"type":"Buffer","data":[98,92,36,122,247,60,29,161,154,155,3,15,156,56,117,129,116,126,143,153]},"announce":[],"urlList":[]}}