{"title":"DVDFab 8.0.2.1 Final Retail -[HB]","uid":5859410,"size":15963869,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:628c3a49cbef0dca396b220f1054302cf80fc3bb&amp;dn=DVDFab+8.0.2.1+Final+Retail+-%5BHB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"[HB]","files":-1,"time":1285905067,"description":"+---------------------------------+\n|DVDFab 8.0.2.1 Final Retail -[HB]|\n+---------------------------------+\n\nDDVDFab is the most powerful and flexible DVD copying/burning software. With 8 copy modes, you can back up any DVD  to DVDR in just a few clicks. DVDFab is brand new, is completely rewritten, is based on more than 8 years of DVD copy software development. DVDFab is simply the easiest way to copy a DVD movie. Just insert the movie and a blank DVD then press Start. Your entire movie - including menus, trailers and special features - is copied to a single DVD with just one click, and everything happens automatically. Backup your entire DVD - including menus, trailers, and special features - onto one or multiple discs.\n\nDVDFab includes: &quot;DVD to DVD&quot;, &quot;Blu-ray to Blu-ray&quot;, &quot;DVD to Mobile&quot;, &quot;File to Mobile&quot; and &quot;File Mover&quot;.\nDVDFab &quot;DVD to DVD&quot; is the most powerful and flexible DVD copying/burning software. With 8 copy modes, you can backup any DVD to DVDR or hard drive in just one or a few clicks.\n\nDVDFab &quot;Blu-ray to Blu-ray&quot; is the first full-featured Blu-ray copying/burning software. With 4 copy modes, you can backup Blu-ray to BD-R or hard drive in just one or a few clicks.\n\nDVDFab &quot;DVD to Mobile&quot; converts DVD title to AVI/MP4/WMV/MKV files which can be played on mobile devices like iPod, PSP, ZUNE, cell phone, etc.\n\nDVDFab &quot;File to Mobile&quot; converts source video file on your PC to next generation console like PS3 and Xbox 360, or mobile devices like iPod, PSP, ZUNE, cell phone, etc.\n\nDVDFab &quot;File Mover&quot; option transfers converted files to mobile devices like iPod, PSP, ZUNE, etc.\n\n\n+--------+\n|Features|\n+--------+\n\n+-------------+\n|A. DVD to DVD|\n+-------------+\n\n1. 8 DVD to DVD copy mode available: Full Disc, Main Movie, Split, Customize, \n   Customize Split, Clone, Merge and Write Data.\n2. Full Disc: All movies, menus and trailers, is copied to a DVD with just one \n   click.\n3. Main Movie: Just copy the movie, with specific audio/subpicture.\n4. Split: Copy a DVD-9 onto two DVD-5 discs with 100% quality, and preserve \n   original menus on both discs.\n   Ideal for episodic/season DVD movies, TV series, etc.\n5. Customize: Personalize your DVDs! Want to make a DVD with only your favorite \n   titles? How about cutting out those annoying commercials? Or selecting specific \n   audio/subpicture? No problem! You can select just your favorite titles, specify \n   the title playback order, with or without original menus, to create a DVD with \n   only the stuff you want!\n6. Customize Split: Copy a DVD-9 onto two DVD-5 discs using &quot;Customize&quot; way. Ideal \n   for episode/season DVD.\n7. Clone: Make perfect 1:1 bit-to-bit copy of DVDs:\n   Make perfect dual layer DVD copy by using the original layer break position.\n   Copy data DVD disc, like PS2 DVD.\n8. Merge: Combine several titles of several sources into one DVD:\n   Combine two DVD-9 like &quot;The Lord of the Rings&quot; into one DVD-9.\n   Merge season DVDs to fewer discs.\n   Create your own special features collection disc.\n9. Write data: Burn existing DVD folder or ISO image file to DVD writer, or   \n   convert DVD folder to ISO image file.\n10. Very fast copying speed, normally it's about 10 - 20 minutes.\n11. Burn to any blank DVD Disc (DVD+R/RW, DVD-R/RW, DVD+R DL, DVD-R DL).\n12. Constantly updated to support latest DVD burners and blank DVD discs.\n\n\n+-----------+\n|B. Benefits|\n+-----------+\n\n1. Remove all DVD copy protections, like CSS, CPPM, RC, RCE, APS, UOPs, ARccOS, \n   RipGuard, FluxDVD, CORE X2, etc.\n2. Constantly updated to support latest DVD copy protections.\n3. Compress DVD-9 to single DVD-5.\n4. Open DVD from disc, ISO image file or folder.\n5. Backup scratched/dirty disc:\n   Even if some information (IFO) cannot be read, you can still copy Main Movie or \n   customize.Recovery from DVD reading (VOB) error.\n6. Support both NTSC and PAL DVD.\n7. Preview title like real DVD player.\n\n\n+------------------+\n|Features Highlight|\n+------------------+\n\n*  10 DVD to Mobile copy mode available: Generic, iPod, PSP, ZUNE, NDS, Xbox 360, PS3, Cell Phone, PVP and PDA. More devices support can be added manually.\n*  Generic: Convert DVD title to MPEG-4/DivX/XVID/H.264 AVI/MP4 file, which can be played on PC. It also supports all other devices which are not listed in navigation bar.\n*  iPod: Convert DVD title to MPEG-4/H.264 MP4 file, which can be played on Apple iPod.\n*  PSP: Convert DVD title to MPEG-4/H.264 MP4 file, which can be played on Sony PSP.\n*  ZUNE: Convert DVD title to WMV file, which can be played on Microsoft ZUNE.\n*  NDS: Convert DVD title to DPG file, which can be played on Nintendo DS.\n*  Xbox 360: Convert DVD title to WMV file, which can be played on Microsoft Xbox 360.\n*  PS3: Convert DVD title to MPEG-4/H.264 MP4 file, which can be played on Sony Play Station 3.\n*  Convert DVD title to specific format which is supported by Cell Phone, PVP (Portable Video Player) and PDA (Personal Digital Assistant).\n*  Crop automatically to remove the black bar on many widescreen movies.\n*  Allow user to resize output from letterbox to pan&amp;scan.\n\n\n+-------------------+\n|System Requirements|\n+-------------------+\n\n-Windows Vista/XP/2000/98/ME\n-Pentium II 500 MHz\n-256 MB of RAM\n-10 GB of Free Hard Disk Space\n-A DVD-R(W) or DVD+R(W) Drive\n\n\nDVDFab 8.0.2.1 (September 30, 2010)\n\n* Fix: A &quot;0xc015002&quot; error at DVDFab startup in certain cases.\n\nDVD Copy:\n\n* Fix: A crash problem when cloning a data DVD disc.","torrent":{"xt":"urn:btih:628c3a49cbef0dca396b220f1054302cf80fc3bb","amp;dn":"DVDFab+8.0.2.1+Final+Retail+-%5BHB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"628c3a49cbef0dca396b220f1054302cf80fc3bb","infoHashBuffer":{"type":"Buffer","data":[98,140,58,73,203,239,13,202,57,107,34,15,16,84,48,44,248,15,195,187]},"announce":[],"urlList":[]}}