{"title":"Coast To Coast Am - 09-14-10 - Timelines &amp; Forecasts","uid":5835149,"size":55564328,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:62dcc34e6091b7971f722d3d13b8db397d85b5f2&amp;dn=Coast+To+Coast+Am+-+09-14-10+-+Timelines+%26+Forecasts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1284702180,"description":"Date: 09-14-10 \n\nHost: George Noory \n\nGuests: Paul Guercio, Glynis McCants  \n\nFuturist Paul Guercio discussed predictions and timelines derived from the Merlin Project, a software-based forecasting technology, he developed with Dr. George Hart. The program is based on the idea that there are repeated pattern changes that occur in 7-year cycles within a person's life, he explained. Interestingly, &quot;timetraks&quot; (Merlin's timelines) depict changes even after people die, such as in the case of Michael Jackson, who shows peaks in 2013, which might reflect a boost in music sales during that year, he noted. \n\nHe discussed the timetrak (PDF file) for Tiger Woods, who shows a huge spike over a four year period between 2010 and 2014, which possibly indicates some type of extreme behavior, such as quitting golf. Hillary Clinton's timetrak spikes in 2012, and Guercio suggested she may take Biden's place as the VP, to set herself up for a presidential run in 2016. He foresees Obama being elected to a second term, and it being comparatively uneventful to his first four years in office. \n\nGuercio highlighted some of the points in his 25 page report How the Future Happens (a free read on his website). For instance, the date that is exactly opposite your birthday-- six months later on the calendar, this is a higher time of vulnerability, and &quot;in certain years, you're going to find more of the big stuff happens around those dates,&quot; he said. \n\nNumerology Update\nFirst hour guest, numerologist Glynis McCants talked about the numbers of Pres. Obama, and shared insights about politics, and celebrities like Lady Gaga. She believes her prediction that August was going to be a difficult time for Obama turned out to be quite accurate, as he was dogged by controversies, and economic problems during that month. \n\nWebsite(s): \n-projectmerlin.com\n-numberslady.com\nBook(s): \n-Love by the Numbers\n-Glynis Has Your Number","torrent":{"xt":"urn:btih:62dcc34e6091b7971f722d3d13b8db397d85b5f2","amp;dn":"Coast+To+Coast+Am+-+09-14-10+-+Timelines+%26+Forecasts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62dcc34e6091b7971f722d3d13b8db397d85b5f2","infoHashBuffer":{"type":"Buffer","data":[98,220,195,78,96,145,183,151,31,114,45,61,19,184,219,57,125,133,181,242]},"announce":[],"urlList":[]}}