{"title":"Jordin Sparks - Beauty And The Beast (2nafish)","uid":5867304,"size":72048644,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:633ef419cf1596bfa428a63edfc5f0d51d8d2ded&amp;dn=Jordin+Sparks+-+Beauty+And+The+Beast+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1286260334,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Beauty and the Beast&quot; is the leading single from the Academy Award Best Picture nominated animated film Beauty and the Beast film and the first hit single from CÃƒÂ©line Dion's eponymous album. It was performed in the movie by Angela Lansbury and sung over the movie's closing credits by CÃƒÂ©line Dion and Peabo Bryson. The Dion-Bryson single was released on November 16, 1991 in Canada, on December 30, 1991 in the United States and the next year in the rest of the world.\n\nThe song is a ballad about the love developing between Belle and the Beast. It was written by composer Alan Menken and late lyricist Howard Ashman. It was one of Ashman's last works before he died of AIDS in 1991.\n\nIn 2010 Jordin Sparks  recorded her cover version of the theme song &quot;Beauty and the Beast&quot; and filmed an accompanying music video with director Philip Andelman. To support the 2010 DVD/Blu-Ray re-release of the Disney animated favorite movie\n\nJordin Brianna Sparks (born December 22, 1989) is an American pop/R&amp;B singer, songwriter, humanitarian, and actress from Glendale, Arizona who rose to fame as the winner of the sixth season of American Idol. Sparks won when she was 17 years old, making her the youngest winner. She followed her American Idol victory with the release of her self-titled debut album in 2007, which has gone platinum and has sold over 2 million copies worldwide. Sparks' second single, &quot;No Air&quot;, which features Chris Brown, is the song with the most paid downloads by any American Idol contestant, selling about 4 million digital copies worldwide. Due to the success of her debut album and its four top 20 singles, she has won an American Music Award in 2008 and received her first Grammy nomination in 2009.\n\nSparks' second album Battlefield was released in July 2009 worldwide and debuted at #7 in the US, three spots higher than her first album. The album's lead single, also titled &quot;Battlefield&quot;, peaked in the top 10 on the Billboard Hot 100 and has sold more than a million copies thus far. Sparks has sold about 9 million singles worldwide to date. Sparks' first five singles all peaked in the top 20 on the US Billboard Hot 100, three of them peaking in the top 10. Battlefield's second single, &quot;S.O.S. (Let the Music Play)&quot;, was her first song to top the US Billboard Hot Dance Club Play making it her first U.S. number one single.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:633ef419cf1596bfa428a63edfc5f0d51d8d2ded","amp;dn":"Jordin+Sparks+-+Beauty+And+The+Beast+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"633ef419cf1596bfa428a63edfc5f0d51d8d2ded","infoHashBuffer":{"type":"Buffer","data":[99,62,244,25,207,21,150,191,164,40,166,62,223,197,240,213,29,141,45,237]},"announce":[],"urlList":[]}}