{"title":"Orson Wells - The War Of The Worlds.mp3","uid":5749213,"size":55264073,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:640fd1be1c55b995996f6281b8d43a5116dbd713&amp;dn=Orson+Wells+-+The+War+Of+The+Worlds.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fordrest","files":1,"time":1281346581,"description":"The War of the Worlds was an episode of the American radio drama anthology series Mercury Theatre on the Air. It was performed as a Halloween episode of the series on October 30, 1938 and aired over the Columbia Broadcasting System radio network. Directed and narrated by Orson Welles, the episode was an adaptation of H. G. Wells' novel The War of the Worlds.\n\nThe first two thirds of the 60-minute broadcast were presented as a series of simulated &quot;news bulletins&quot;, which suggested to many listeners that an actual alien invasion by Martians was currently in progress. Compounding the issue was the fact that the Mercury Theatre on the Air was a 'sustaining show' (it ran without commercial breaks), thus adding to the program's verisimilitude. Although there were sensationalist accounts in the press about a supposed panic in response to the broadcast, the precise extent of listener response has been debated. In the days following the adaptation, however, there was widespread outrage. The program's news-bulletin format was decried as cruelly deceptive by some newspapers and public figures, leading to an outcry against the perpetrators of the broadcast, but the episode secured Orson Welles' fame.","torrent":{"xt":"urn:btih:640fd1be1c55b995996f6281b8d43a5116dbd713","amp;dn":"Orson+Wells+-+The+War+Of+The+Worlds.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"640fd1be1c55b995996f6281b8d43a5116dbd713","infoHashBuffer":{"type":"Buffer","data":[100,15,209,190,28,85,185,149,153,111,98,129,184,212,58,81,22,219,215,19]},"announce":[],"urlList":[]}}