{"title":"Coast To Coast Am - 07-11-10 - The Fringe Dweller","uid":5687719,"size":57049561,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:64dd5780d1532653eb871cec6ef42e5f0cb9e392&amp;dn=Coast+To+Coast+Am+-+07-11-10+-+The+Fringe+Dweller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":5,"time":1278969355,"description":"Date:\n\t\n\n07-11-10\n\nHost:\n\t\n\nIan Punnett\n\nGuests:\n\t\n\nMonica Holy\n\nMonica Holy joined Ian Punnett to talk about her second life as a 'Fringe Dweller,' where in the lucid dream state she helps people cross over into the afterlife. A spirit guide first introduced the term Fringe Dweller to her, explaining that it referred to someone who could act as a buffer between two worlds. She said that some of these dream encounters use her own home as a setting. For instance, in one case she saw a little girl crying hysterically on her back stoop, and she gave her a consoling hug. &quot;As soon as she was calm, she disappeared into a ball of twinkling lights,&quot; presumably finding peace in the spirit dimension, Holy detailed.\n\nIn another occurrence, she found herself on a harbor, and a woman pushed her into the water to find her daughter and husband. Because Holy knew she was in a dream state, she was able to remain underwater until she located the family members who had drowned in a capsized boat. They were all reunited on the shore, and then they suddenly disappeared, she recalled. One of her most surprising missions was when she was dropped into a dream in which a man was about to be electrocuted in an electric chair, and they hugged one another just before he died.\n\nBecause there are occasionally malevolent energies in her encounters, Hoy practices protection methods such as combating the feeling of fear with the emotion of joy, and imagining a box of mirrors around her that dark forces cannot penetrate. To attain lucidity in dreams, she recommended allowing oneself to remain in the limbo state between dreams and waking, and quietly being aware of the imagery, as well as reading the book Toltec Dreaming. Holy has also created evocative paintings that portray some of her lucid dream experiences.\nWebsite(s):\n# thefringedweller.com\nBook(s):\n# Fringe Dweller on the Night Shift\n","torrent":{"xt":"urn:btih:64dd5780d1532653eb871cec6ef42e5f0cb9e392","amp;dn":"Coast+To+Coast+Am+-+07-11-10+-+The+Fringe+Dweller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64dd5780d1532653eb871cec6ef42e5f0cb9e392","infoHashBuffer":{"type":"Buffer","data":[100,221,87,128,209,83,38,83,235,135,28,236,110,244,46,95,12,185,227,146]},"announce":[],"urlList":[]}}