{"title":"Motley Crue - Live Wire  (2nafish)","uid":5702009,"size":120389636,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:656d81ba8a27ed2504195ad529bc6603f7d8e1d0&amp;dn=Motley+Crue+-+Live+Wire++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1279499372,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Live Wire&quot; is the debut single by the American hard rock band MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e released from their 1981 debut album Too Fast for Love. The video was directed by MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e and during filming, Nikki Sixx's leg caught on fire. The single was released on August 16, 1982. In May 2006 it was ranked #17 on VH1's list of the 40 greatest metal songs of all time.\n\nToo Fast For Love is the debut record of American hard rock band MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e. Released in November 1981 on the band's LeathÃƒÆ’Ã‚Â¼r Records label, it is widely regarded as one of the most influential albums of its genre.[by whom?]\n\nWhile the album only reached number 77 on the Billboard 200 album chart in the US, it would ultimately reach platinum status. Musically, the album mixes elements of punk rock, glam rock, and heavy metal.\n\nThe cover is a parody of The Rolling Stones' album Sticky Fingers.\n\nMÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e is an American hard rock band formed in Los Angeles, California in 1981. The band was founded by bass guitarist Nikki Sixx and drummer Tommy Lee, who were later joined by lead guitarist Mick Mars and lead singer Vince Neil. MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e has sold more than 80 million album copies worldwide, with 25 million in the U.S.\n\nThe band members have often been noted for their hard-living lifestyles, and the persona they maintained. All members have had numerous brushes with the law, spent time in jail, suffered from alcoholism, long addictions to drugs, had countless escapades with women, and are heavily tattooed. Their ninth studio album, Saints of Los Angeles, was released on June 24, 2008, while a film adaptation of their best-selling autobiography, The Dirt, is due to be released in 2011.\n\nActs such as Papa Roach, Buckcherry, Tommy Krash, Adelitas Way, Linkin Park, Marilyn Manson, Nine Inch Nails, Moby, Murderdolls, Backyard Babies, Private Line, Slipknot, The Living End, Belladonna, Mana, and Hardcore Superstar, have all cited MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e as an influence in recent years, most notably for Too Fast for Love and Shout at the Devil. Disturbed  drummer Mike Wengren has also cited Tommy Lee as an influence to his drumming. MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e's early look in music videos has also been parodied by a variety of artists such as Bowling for Soup, Beck, Red Hot Chili Peppers, New Order, Aerosmith, and the Backstreet Boys.\n\nThe band has been featured on a number of VH1 countdown shows, &quot;Dr. Feelgood&quot; was ranked the #7 Greatest Air Guitar Song, &quot;Live Wire&quot; was ranked the #17 Greatest Metal Song Of All Time, and &quot;Home Sweet Home&quot; was ranked the #12 Greatest Power Ballad Of All Time. MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e was featured several times on VH1's 100 Most Metal Moments, the highest spot being #3. VH1 included the Tommy Lee sex tapes, The Dirt, and Ozzy Osbourne's and Nikki Sixx's pee. all featured in the countdown. MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e has also been one of the many bands featured on VH1's Behind the Music. The band was also ranked #19 on VH1's list of the most popular hard rock bands. MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e was also ranked tenth on MTV's list &quot;Top 10 Heavy Metal Bands of All-Time&quot;.\n\nBuilding on the popularity and the desire of fans to see The CrÃƒÆ’Ã‚Â¼e between World tours, a wide variety of tribute acts who celebrate and pay homage to the different eras and albums over the years has developed. Red Hot, a tribute from L.A., captures the look and feel of the Shout at the Devil era with black and red leather pants. Theatre of Pain captures the spandex and lipstick attitude of the album of the same name. And Carnival of Sins Live rounds out the tributes with a rendition of the current CrÃƒÆ’Ã‚Â¼e image that brings to mind the crÃƒÆ’Ã‚Â¼deness of the MÃƒÆ’Ã‚Â¶tley moniker. The band even has an all-female version from New York City, Girls Girls Girls, who cover all eras of the band's music without emulating the look of any specific CrÃƒÆ’Ã‚Â¼e era.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:656d81ba8a27ed2504195ad529bc6603f7d8e1d0","amp;dn":"Motley+Crue+-+Live+Wire++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"656d81ba8a27ed2504195ad529bc6603f7d8e1d0","infoHashBuffer":{"type":"Buffer","data":[101,109,129,186,138,39,237,37,4,25,90,213,41,188,102,3,247,216,225,208]},"announce":[],"urlList":[]}}