{"title":"Lou Donaldson - Alligator Bogaloo (1967) [Jazz][mp3 320][schon55","uid":5751460,"size":85643274,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:658dd6589ca05ae8ea6d88b32f74cdeed4932f2c&amp;dn=Lou+Donaldson+-+Alligator+Bogaloo+%281967%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"schon55","files":11,"time":1281414678,"description":"Lou Donaldson - Alligator Bogaloo \nLabel:  Blue Note Records\nOrig Year:  1967 \nOriginal Release Date: October 9, 1987 \nQuality: CBR 320 kbps \n\nRecorded at the Van Gelder Studio, Englewood Cliffs, New Jersey on April 17, 1967.\n\nAlligator Bogaloo is one example of Lou Donaldson's successful combinations of hard bop and soul-jazz. Of the six tunes, three are Donaldson originals, including the title hit. The excellent band, consisting of Melvin Lastin, Sr. on cornet, George Benson on guitar, Lonnie Smith on organ, and Leo Morris on drums, mixes laid-back vamps beneath driving hard bop charts. As the '60s turned into the '70s, Donaldson began shaving off hard bop invention for a more radio-friendly and 45 rpm length, leaving soulful -- yet monotonous -- vamping. At that point, Donaldson's material suffered from a lack of originality. That's not the case on Alligator Bogaloo. ~ Al Campbell, CD Universe\n\nLou Donaldson applies James Brown's teachings to the alto/organ combo and makes it funky. This is classic right here.Funky Jazz got derided and spit on in the 70s but this cd ten years earlier shows that classic trained musicians like Donaldson and Miles Davis were always making this music work for the people. It gotta good beat thanks to the legendary Leo Morris bka Idris Muhammad on the drumkit. The best tracks are the title and Rev Moses.  Love it!! ~ Chronwell (washington DC)\n\nI really dug this one, it is mellow and soulful and bluesy and funky all at the same time. Dr. Lonnie is something else on that church instrument of his and he and Lou always seem to make such a great team. And don't get me started on the performance of George Benson (just a young buck at the time) on guitar. Just listening to him on &quot;One Cylinder&quot;, it blows me away every time. \n\nThis is a fantastic recording and a whole lot of fun. I enjoyed every song and every performance on the album. Besides Donaldson, Smith, and Benson the rest of the quintet is comprised of Melvin Laste, Sr. (cornet), and Leo Morris (drums). Morris does a great job and compliments the Dr. and Lou perfectly. Most Jazz fans will enjoy this one if not love it like I did. It is not hard bop, it's not light jazz, it's somewhere in the middle and it works to perfection in my humble opinion. ~ JoeyD\n\nPersonnel:\nLou Donaldson (alto saxophone);\nMelvin Lastie (cornet);\nLonnie Smith (organ);\nGeorge Benson (guitar);\nLeo Morris (drums).\n\nLou Donaldson - Alligator Bogaloo Tracks:\n01  Alligator Bogaloo  \n02  One Cylinder\n03  The Thang\n04  Aw Shucks! \n05  Rev. Moses \n06  I Want a Little Girl \n","torrent":{"xt":"urn:btih:658dd6589ca05ae8ea6d88b32f74cdeed4932f2c","amp;dn":"Lou+Donaldson+-+Alligator+Bogaloo+%281967%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"658dd6589ca05ae8ea6d88b32f74cdeed4932f2c","infoHashBuffer":{"type":"Buffer","data":[101,141,214,88,156,160,90,232,234,109,136,179,47,116,205,238,212,147,47,44]},"announce":[],"urlList":[]}}