{"title":"Ozzy Osbourne - Gets Me Through (2nafish)","uid":5742461,"size":126279684,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:65d19fc6022a64731690045f9a166acbdf34efb1&amp;dn=Ozzy+Osbourne+-+Gets+Me+Through+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1281084178,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Gets Me Through&quot; is the first track from the 2001 album Down to Earth by heavy metal rocker Ozzy Osbourne in which he thanks his fans and attempts to set the record straight that he is not the &quot;Anti-Christ&quot; or the &quot;Iron Man&quot;.\n\nIn the first draft of the music video, pictures of flames, and destruction were featured but due to the events of 9/11, MTV said that they would not air it, so in return Ozzy sent back a cut version instead.\n\nThe single peaked at number eighteen on the UK Singles Chart and number two on Billboard's Mainstream Rock Tracks chart.\n\nDown to Earth is the eighth studio album by English heavy metal musician Ozzy Osbourne. Released on 16 October 2001, the album reached number 19 on the UK Albums Chart and number four on the US Billboard 200 albums chart. Down to Earth spawned just two singles, although both reached the top-ten of the US Hot Mainstream Rock Tracks chart and reached number 18 on the UK Singles Chart. It was the first studio album to feature bassist Robert Trujillo (Metallica) and drummer Mike Bordin (Faith No More), who joined the band in 1996 and 1997, respectively.\n\nJohn Michael &quot;Ozzy&quot; Osbourne (born 3 December 1948) is an English singer-songwriter whose career has spanned five decades.\n\nOsbourne initially rose to prominence as lead vocalist of the pioneering English heavy metal band Black Sabbath, a band whose radically different, intentionally dark, doom sound spearheaded the heavy metal genre. In his subsequent solo career Osbourne achieved a multi-platinum status in addition to the one he had earned with Black Sabbath. These things are what led Osbourne to become known as the &quot;Godfather of Heavy Metal&quot;. Osbourne is ranked 8th on Hit Parader's list of the 100 Greatest Heavy Metal Vocalists of all time. It was during his Sabbath days (because of their dark style of music, not because he was a satanist) that Osbourne became known as the &quot;Prince of Darkness.&quot; Osbourne has over 15 tattoos, the most famous of which are the letters O-Z-Z-Y across the knuckles of his left hand. This was his first tattoo, created by himself with a sewing needle and pencil lead.\n\nIn the early 2000s, Osbourne's career expanded to a new medium when he became a star in his own reality show, The Osbournes, alongside wife/manager Sharon and two of their three children, Kelly and Jack.\n\nOsbourne is currently on a worldwide tour to promote his new album Scream, released on 22 June 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:65d19fc6022a64731690045f9a166acbdf34efb1","amp;dn":"Ozzy+Osbourne+-+Gets+Me+Through+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65d19fc6022a64731690045f9a166acbdf34efb1","infoHashBuffer":{"type":"Buffer","data":[101,209,159,198,2,42,100,115,22,144,4,95,154,22,106,203,223,52,239,177]},"announce":[],"urlList":[]}}