{"title":"The Glass Menagerie (TV) [1974] Katharine Hepburn","uid":5695459,"size":735113502,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66478292bdaf7d0d6baa1882851cb0b2feda70e9&amp;dn=The+Glass+Menagerie+%28TV%29+%5B1974%5D+Katharine+Hepburn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":4,"time":1279288886,"description":" &lt;a href=&quot;http://bayimg.com/LanBcAACL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/LanBcAACL&lt;/a&gt;\n\nThe Glass Menagerie (1973) (TV) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0070115/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0070115/&lt;/a&gt;\n\nAmanda Wingfield dominates her children with her faded gentility and exaggerated tales of her Southern belle past. Her son plans escape; her daughter withdraws into a dream world. When a &quot;gentleman caller&quot; appears, things move to crisis point.\n\n Katharine Hepburn ...  Amanda Wingfield \n Sam Waterston ...  Tom Wingfield \n Joanna Miles ...  Laura Wingfield \n Michael Moriarty ...  Jim O'Connor \n\nThe Glass menagerie is a four-character memory play by Tennessee Williams. It was originally written as a screenplay for MGM, to whom Williams was contracted. Initial ideas stemmed from one of his short stories, and the screenplay originally went under the name of 'The Gentleman Caller' (Williams envisioned Ethel Barrymore and Judy Garland for the roles that eventually became Amanda and Laura Wingfield although Louis B. Mayer insisted on casting Greer Garson as Laura).\n\nThe play premiered in Chicago in 1944. It was subsequently championed by critic Claudia Cassidy and won the New York Drama Critics Circle Award in 1945. Laurette Taylor originated the role of the all-too-loving mother, Amanda Wingfield, and many who witnessed it consider that performance to be an incomparable, defining moment for American acting. In the 2010 documentary Broadway: The Golden Age, by the Legends Who Were There, Broadway veterans nearly unanimously rank Taylor's performance as the most memorable of their entire lives. The Glass Menagerie was Williams's first successful play; he went on to become one of America's most highly regarded playwrights.\n\nThe Glass Menagerie is accounted by many to be an autobiographical play about Williams's life, the characters and story mimicking his own more closely than any of his other works. Williams (whose real name is Thomas) would be Tom, his mother, Amanda, and his sickly and (supposedly) mentally ill sister Rose would be Laura (whose nickname in the play is &quot;Blue Roses&quot;, a result of an unfortunate bout of Pleurosis as a high school student). It has been suggested as well that the character of Laura is based upon Williams himself, referencing his introvert nature and obsessive focus on one part of life (writing for Williams and glass animals in Laura's case.).\n\nThe subjects and themes of the play are weighty and somewhat timeless: failures of capitalism, failures of the family structure, failures of fathers (perhaps even God), broken promises, individual failure and reconciliation. The Glass Menagerie is about tough decisions people make for themselves that affect others and adversely themselves.\n\nThis television adaptation by Anthony Harvey, which was broadcast on ABC on December 16, 1973, starring Katharine Hepburn as Amanda, Sam Waterston as Tom, Michael Moriarty as Jim, and Joanna Miles as Laura. (Tom's initial monologue, so striking onstage, is cut from this version; it opens with him walking alone in an alley, sitting on a rampart to read the newspaper and having his sister's and mother's voices conjure up the first domestic scene.) All four actors were nominated for Emmys, with Moriarty and Miles winning. \n\nWith a play this good, even a pedestrian cast would be hard pushed not to shine, but, the addition of the kind of acting calibre on offer in this superior version results in a truly moving couple of hours. Hepburn is stunningly good as a faded Southern belle, filling her performance with moments of outrageous humour and melancholic pathos. Waterston, too - best known to audiences today, along with co-star Moriarty, as a member of the Law And Order cast - excels as a man desperate for escape, but tied by duty. Moriarty and Miles both won Emmys for their performances and it's easy to see why. Miles creates tension by her every move and the scenes between her and Moriarty are perfectly poised, the tension palpable. \n\nDespite its American credentials, it is worth noting that this made-for-TV version was shot in Britain at the Rank Studios and it would be a shame not to give a measure of credit to British director Anthony Harvey, who does a fine job. Hollywood movies are peppered with tricks, designed to have you reaching for the tissue box, but there are no such snake-oil emotional highs and lows here.\n\n\nDirectors Guild of America, USA \n1974  Nominated DGA Award Outstanding Directorial Achievement in Movies for Television Anthony Harvey \n\nEmmy Awards \n1974  Won Emmy Best Supporting Actor in Drama Michael Moriarty \n1974  Won Emmy Best Supporting Actress in Drama Joanna Miles \n1974  Won Emmy Supporting Actor of the Year Michael Moriarty \n1974  Won Emmy Supporting Actress of the Year Joanna Miles  \n\n1974  Nominated Emmy Best Lead Actress in a Drama Katharine Hepburn \n1974  Nominated Emmy Best Supporting Actor in Drama Sam Waterston  \n \n","torrent":{"xt":"urn:btih:66478292bdaf7d0d6baa1882851cb0b2feda70e9","amp;dn":"The+Glass+Menagerie+%28TV%29+%5B1974%5D+Katharine+Hepburn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66478292bdaf7d0d6baa1882851cb0b2feda70e9","infoHashBuffer":{"type":"Buffer","data":[102,71,130,146,189,175,125,13,107,170,24,130,133,28,176,178,254,218,112,233]},"announce":[],"urlList":[]}}