{"title":"Islaja - Keraaminen PaÃŒË†aÃŒË†","uid":5844642,"size":84488339,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:669c0ecec2cbf67c4d9eded8286e7805a938f128&amp;dn=Islaja+-+Keraaminen+Pa%C3%8C%CB%86a%C3%8C%CB%86&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":9,"time":1285116177,"description":"Islaja is the recording alias of Merja Kokkonen, a musician and visual artist from Helsinki, currently based in Berlin. A regular contributor to the more psych/folk and improv oriented Kemialliset YstÃƒÂ¤vÃƒÂ¤t and Avarus, Islaja's recordings are by contrast almost entirely self-contained, reflecting the more personal nature of her music, and a natural affinity towards an independent/DIY aesthetic. Her fourth album for Fonal (following 2008's excursion on Ecstatic Peace for the live document Blaze Mountain Recordings), Keraaminen PÃƒÂ¤ÃƒÂ¤ (or &quot;Ceramic Head&quot;) contains many shades of black. It also bears witness to a shift in perception and execution; yet the thread that weaves its way through all Islaja's work remains resolute, visible and intact. If Islaja's previous albums for Fonal appear to exhibit a more overtly pastoral nature, this in part feels coincidental, or secondary to something much larger and more difficult to define. From the earliest Islaja recordings, Merja has made the simplest of instrumentation work to her own ends, displaying a disquieting combination of innocence and fearlessness, and a seemingly innate ability to transcend the confines of a genre. It is the same singular approach and vision that informs Keraaminen PÃƒÂ¤ÃƒÂ¤  - born largely of whatever instruments were to hand, if the sound has shifted into more electronic terrain, it remains as immersive and subtly evocative as ever. When sketching out the dimensions of Keraaminen PÃƒÂ¤ÃƒÂ¤, Islaja was clear about one thing: the album should have a soul within, preferably silky thin and translucent, like a jellyfish swimming around in the ocean. During the recording process, however, Keraaminen PÃƒÂ¤ÃƒÂ¤  turned into a heavy, robot molded disc of clay. It spins, shines, pops and crackles, all the while escaping definition. Thoughts fill the insides of PÃƒÂ¤ÃƒÂ¤ like a stern row of type letters. They reveal the artist's restlessness but also betray a desire for harmony. (Other Musi\n\n\n1\tJoku Toi Radion\n2\tSuzy Sudenkita\n3\tDadahuulet\n4\tPimeyttS Kohti\n5\tOtakun Uhkaus\n6\tRakkauden Palvelija/14. KSsky\n7\tIhmispuku\n8\tAjanlaskun Aatto\n9\tYÃƒÂ¶valo\n\n\nmp3 - 320 kbps","torrent":{"xt":"urn:btih:669c0ecec2cbf67c4d9eded8286e7805a938f128","amp;dn":"Islaja+-+Keraaminen+Pa%C3%8C%CB%86a%C3%8C%CB%86","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"669c0ecec2cbf67c4d9eded8286e7805a938f128","infoHashBuffer":{"type":"Buffer","data":[102,156,14,206,194,203,246,124,77,158,222,216,40,110,120,5,169,56,241,40]},"announce":[],"urlList":[]}}