{"title":"Enigma Discography","uid":5739534,"size":4860406678,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6750e8b5875cc80743e14576f8fe2479016994d1&amp;dn=Enigma+Discography++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ddawg","files":258,"time":1280950609,"description":"\nEnigma Discography  \nGenre: New Age\nFormat: flac\n\n\n[1990] Enigma - MCMXC A.D\n[1994] Enigma - The Cross of Changes\n[1996] Enigma - Le Roi Est Mort, Vive Le Roi!\n[2000] Enigma - The Screen Behind the Mirror\n[2003] Enigma - Voyageur\n[2006] Enigma - A Posteriori\n[2008] Enigma - Seven Lives Many Faces\n\nCompliations\n[1999] Enigma &amp; D-Emotion Project\n[2001] Enigma - LSD: Love, Sensuality and Devotion\n[2005] Enigma - The Dusted Variations\n[2009] Enigma - The Platinum Collection\n\n\nAllmusic: Biography:\nWith their 1991 hit &quot;Sadeness,&quot; Enigma brought the new age fascination with Gregorian chants and old-world culture to the clubs; the resulting single was both unique and irresistible. The rest of the album followed that pattern successfully, although without quite matching the stunning success of the hit single. On their second album, 1994's Cross of Changes, some of the old-world elements remained, but the new age angle came to the forefront in a set of slick, radio-friendly dance-pop. Enigma 3: Le Roi Est Mort, Vive le Roi followed in 1996. A side project, Trance Atlantic Airwaves, issued The Energy of Sound in 1998. The fourth Enigma record, The Screen Behind the Mirror, followed in early 2000, and in 2003 Voyageur came out. Three years later, A Posteriori was released, followed by Seven Lives Many Faces in 2008.\n\n\nAmazon Biography:\nEnigma are an electronic band who incorporate ambient, house and new age themes into their music. The driving force behind Enigma is Michael Cretu who, along with Sandra Cretu, David Fairstein and Frank Peterson, set up the project in 1990. Due to the way that Enigma build their tracks, they found themselves in court on more than one occasion in disputes over sampled sounds and music. This publicity undermined their early attempts to be an 'enigma'.\n\nThe band had huge success with their debut album, MCMXC a.D., which was promoted by the single &quot;Sadeness (Part 1)&quot;, an innovative mix of new age electronics and Gregorian chants. The single was a hit worldwide and the album went on to gain 60 platinum awards from different territories. The follow-up album, The Cross of Changes, was equally successful, with over six million copies sold. The releases seemed to sate the public appetite for their blend of music and they failed to capture the public's imagination in the same way with subsequent releases Enigma 3: Le Roi Est Mort, Vive Le Roi! and The Screen Behind the Mirror.\n\nEnigma seemed to get back on track with the release of A Posteriori, in 2006, which earned them a Best New Age Album nomination at the Grammys. Always keen to embrace technology, A Posteriori was also released as a DVD featuring 'trippy' visuals.\n\nTheir music has been in demand from TV and film producers and has appeared in numerous productions, including La Femme Nikita and The Outer Limits on TV, and films such as Charlie's Angels and Single White Female.\n\n\n \n\n","torrent":{"xt":"urn:btih:6750e8b5875cc80743e14576f8fe2479016994d1","amp;dn":"Enigma+Discography++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6750e8b5875cc80743e14576f8fe2479016994d1","infoHashBuffer":{"type":"Buffer","data":[103,80,232,181,135,92,200,7,67,225,69,118,248,254,36,121,1,105,148,209]},"announce":[],"urlList":[]}}