{"title":"Kah-En Route to Global Occupation-Secret Agenda for World Unific","uid":5743352,"size":9534223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67e3a3e4a5990cadd5597e60803d13e547e83c71&amp;dn=Kah-En+Route+to+Global+Occupation-Secret+Agenda+for+World+Unific&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"red_gonzo","files":1,"time":1281106162,"description":"This is Gary H. Kah's explosive book En Route to Global Occupation - A High Ranking Government Liaison Exposes the Secret Agenda for World Unification (1992) which exposes the political forces around the world that are cooperating to unite the people of this planet under a New World Order. High-ranking government liaison Gary Kah warns that national sovereignty will soon be a thing of the past. Political forces around the world are now cooperating in unprecedented fashion to achieve their goal of uniting the people of this planet under a New World Order. Because of his background in government, Kah was invited to join the WCPA (World Constitution and Parliament Association), overseeing the planning and implementation of the one world government. For the skeptical observer, the material in this book &quot;should serve as ample evidence that the drive to create a one world government is for real,&quot; including reproductions of the original WCPA documents. The author further demonstrates that there is an ominous cooperation between the globalists, who are promoting the one world government, and the burgeoning New Age groups, who are promoting a new religion. If people around the world do not begin to resist this global government, sovereign nations will cease to exist and a single global economic system will be established. En Route to Global Occupation has a message that is crucial to the political, economic and spiritual future of the world. It is the result of more than seven years of research and is filled with documented facts and reproductions proving that the drive toward a one-world government is for real. 220 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:67e3a3e4a5990cadd5597e60803d13e547e83c71","amp;dn":"Kah-En+Route+to+Global+Occupation-Secret+Agenda+for+World+Unific","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67e3a3e4a5990cadd5597e60803d13e547e83c71","infoHashBuffer":{"type":"Buffer","data":[103,227,163,228,165,153,12,173,213,89,126,96,128,61,19,229,71,232,60,113]},"announce":[],"urlList":[]}}