{"title":"Autosport Magazine UK 21/10/2010","uid":5904191,"size":85355187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:683004ca6747fd50ca93c40472fcecba760a18db&amp;dn=Autosport+Magazine+UK+21%2F10%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1287789496,"description":"NEWS\n10 Lotus to flower in 2011. Team claims off-track strife won't harm on-track progress\n12 Red Bull up for Korea. Vettel and Webber will set pace at new race, says team\n14 Russia in for 2014. Bernie does dealski for GP around Olympic village\n17 David Coulthard column\n18 Korean GP preview\n24 DTM rules to go global. More regions, more manufacturers expected\n26 McLaren supercar deal. British squad CRS to develop MP4-12C for GT racing\n29 Ganassi sticks at two. Team boss rules out Rahal\n31 Danica's hand-holding. IndyCar star leans on Mark Martin to helps her in NASCAR\n32 Gow: support Scotland. MSA boss calls for more entries on British IRC round\n\nREPORTS\n40 Rally of Scotland. It's Wilks, then Meeke, then Wilks... before champion Hanninen beats UK boys\n44 World of Sport. NASCAR; European Touring Car Cup; European F3 Open; Formula Nippon\n55 Euro F3 Hockenheim. Mortara wins again; Bottas fails to nab second in series\n56 DTM Hockenheim. Di Resta takes series lead after third win in a row\n\nFEATURES\n34 Webber versus Vettel. Analysing the strengths and weaknesses of Red Bull duo as we get set for title run-in\n47 AUTOSPORT Awards. Cameron? Clegg? Brown? Forget the General Election: this is the poll of 2010\n59 IndyCar: Frantastic year. Getting the lowdown from Dario Franchitti on his third title, and Indy 500 victory\n62 IndyCar: Power points. It was close, but not quite enough for the king-of-the-roads Queenslander\n\nSPORTS EXTRA\n79 Great &amp; British desertion. Mini and Radical series up sticks from BARC flagship\n80 New racers for Brit GT. Merc SLS and Ferrari 458 could join series expansion\n84 Reports. Formula Ford Festival and supports; Thruxton BARC; Donington British GT and supports; Pembrey BARC; Silverstone MSVR; Snetterton CSCC; Mallory Park 750MC; Knockhill SMRC; Oulton Park BRSCC; Algarve Classic Festival\n\nREGULARS\n101 Photo finish. Martin Brundle, Michigan IROC, 1990\n102 Race of my life. Buddy Baker, 1980 Daytona 500\n\nOCRd by PDF Converter Professional 7. Cover has links to main stories.","torrent":{"xt":"urn:btih:683004ca6747fd50ca93c40472fcecba760a18db","amp;dn":"Autosport+Magazine+UK+21%2F10%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"683004ca6747fd50ca93c40472fcecba760a18db","infoHashBuffer":{"type":"Buffer","data":[104,48,4,202,103,71,253,80,202,147,196,4,114,252,236,186,118,10,24,219]},"announce":[],"urlList":[]}}