{"title":"Impact.(Miniserie Completa.Spanish).","uid":5863135,"size":1855550562,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:697e5fc4694f64bcbeab4ce84497ffc54a4049c5&amp;dn=Impact.%28Miniserie+Completa.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cholo24","files":-1,"time":1286042026,"description":"Impact \n\n\nSINOPSIS \t\nImpact narra la catÃƒÂ¡strofe que se produce en el planeta por culpa de una fuerte lluvia de meteoritos que impacta sobre la Luna. Todo ello provoca una serie de anomalÃƒÂ­as en la Tierra: el crecimiento exagerado de las mareas, casos esporÃƒÂ¡dicos de ingravidez e incluso la interrupciÃƒÂ³n del servicio de telÃƒÂ©fonos mÃƒÂ³viles. Mientras el mundo entero observa la mayor avalancha de meteoritos de los ÃƒÂºltimos 10.000 aÃƒÂ±os, un asteroide suelto, escondido entre otros meteoritos, se estampa contra la luna, introduciÃƒÂ©ndose en ella y causando una tremenda explosiÃƒÂ³n de rocas y escombros. Alex Kinter es el astrofÃƒÂ­sico que descubre que la Luna se ha desviado de su ÃƒÂ³rbita, y que se encuentra en rumbo de colisiÃƒÂ³n contra la Tierra.\n\nFragmentos del asteroide, e incluso de la propia luna penetran en la atmÃƒÂ³sfera terrestre impactando contra ella. A pesar de que el daÃƒÂ±o inicial es mÃƒÂ­nimo, el pÃƒÂ¡nico se extiende por todo el mundo. Se ha originado un daÃƒÂ±o fÃƒÂ­sico importante en la superficie lunar, pero los expertos concluyen enseguida que no se producirÃƒÂ¡n problemas mayores. Es entonces cuando empiezan a manifestarse extraÃƒÂ±as anomalÃƒÂ­as en la Tierra. Comienzan a observarse breves interrupciones en las conexiones por telefonÃƒÂ­a mÃƒÂ³vil, cargas estÃƒÂ¡ticas inusuales y un comportamiento extraÃƒÂ±o en las mareas. Los cientÃƒÂ­ficos mÃƒÂ¡s punteros del mundo, entre ellos Kittner, Maddie Rhodes y Roland Emerson, empiezan a atar cabos y a sospechar que la luna y su ÃƒÂ³rbita han sufrido alteraciones permanentes. Estos temores se convierten en realidad cuando las anomalÃƒÂ­as crecen hasta el punto en que un experimento de gravedad simulada se ve manipulado por crecientes fuerzas electromagnÃƒÂ©ticas procedentes de la Luna. Personas, coches y otros objetos se quedan momentÃƒÂ¡neamente suspendidos en el vacÃƒÂ­o en zonas aisladas de todo el mundo.\n\nAlex, Maddie, Roland y el resto del equipo pronto descubren algo todavÃƒÂ­a peor: la nueva ÃƒÂ³rbita de la luna se ha interpuesto en el camino de la Tierra, de modo que colisionarÃƒÂ¡ con ella. A partir de ahora, el mundo tiene 39 dÃƒÂ­as para detenerla, o la Tierra y todos sus habitantes serÃƒÂ¡n aniquilados. Tras un fallido intento por parte de los Estados Unidos de destruir la Luna, nuestros hÃƒÂ©roes unen a todos los paÃƒÂ­ses del mundo en su ÃƒÂºltima esperanza para salvar a la Humanidad: una misiÃƒÂ³n internacional a la propia Luna en la que los astronautas intentarÃƒÂ¡n devolver la Luna a su ÃƒÂ³rbita original.\n","torrent":{"xt":"urn:btih:697e5fc4694f64bcbeab4ce84497ffc54a4049c5","amp;dn":"Impact.%28Miniserie+Completa.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"697e5fc4694f64bcbeab4ce84497ffc54a4049c5","infoHashBuffer":{"type":"Buffer","data":[105,126,95,196,105,79,100,188,190,171,76,232,68,151,255,197,74,64,73,197]},"announce":[],"urlList":[]}}