{"title":"Democracy Now - 27 oct 2010","uid":5915279,"size":452856668,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6a15bd8c13d05999cdf035156fc5d212cd0f5a5b&amp;dn=Democracy+Now+-+27+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1288198820,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 27, 2010\n\n- UN Calls for US Torture Probe Following WikiLeaks Revelations\n- Death Toll in Cholera Outbreak Hits 284\n- UN: Over 1,500 Dead from Cholera in Nigeria\n- 150 Dead in Indonesian Tsunami\n- Right-Wing March Sparks Clashes Between Palestinians, Israeli Police\n- Israeli Documents Outline Gaza Blockade Restrictions\n- UN Votes 187-2 for End to US Embargo of Cuba\n- GOP Candidate Killed 2 Unarmed Iraqis\n- Paul Campaign Volunteer Assaults Protester\n- Arizona Law Requiring Citizenship Proof Overturned\n\n\nSpecial reports\n\n- Pollster Nate Silver and Author Ari Berman on &quot;Third Straight Anti-Incumbent Election&quot;\n\nCandidates are entering the final few days of campaigning in what may turn out to be one of the more interesting midterm elections in recent decades. Most polls are forecasting Republicans will take control of the House, while Democrats are expected to hold on to the Senate, which would result in a rare split Congress. We speak to New York Times pollster and FiveThirtyEight.com founder Nate Silver, and Ari Berman, political correspondent for The Nation magazine and the author of the new book Herding Donkeys: The Fight to Rebuild the Democratic Party and Reshape American Politics.\n\n\n- Acclaimed Indian Author Arundhati Roy Faces Arrest for Questioning India's Claim on Kashmir\n\nThe award-winning Indian author Arundhati Roy is facing possible arrest in India on sedition charges after publicly advocating for Kashmir independence and challenging India's claim that Kashmir is an &quot;integral part of India.&quot; If charged and convicted of sedition, Roy could face up to life in prison.\n\n\n- Convicted Student Adnan Mirza Maintains Innocence in Latest Case of Alleged FBI Entrapment\n\nAdnan Mirza, a Pakistani citizen who came to the United States on a student visa, has been sentenced to 15 years in prison without parole after being convicted of conspiring to provide material support to the Taliban and for unlawfully possessing firearms. While federal officials hailed the verdict, Adnan's friends and supporters say he is innocent and that he was set up and framed by an undercover FBI informant. We spoke to Adnan last week, one day before his sentencing.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:6a15bd8c13d05999cdf035156fc5d212cd0f5a5b","amp;dn":"Democracy+Now+-+27+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a15bd8c13d05999cdf035156fc5d212cd0f5a5b","infoHashBuffer":{"type":"Buffer","data":[106,21,189,140,19,208,89,153,205,240,53,21,111,197,210,18,205,15,90,91]},"announce":[],"urlList":[]}}