{"title":"Sonny Stitt - Just in Case You Forgot How Bad He Really Was (198","uid":5745855,"size":158227395,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6a4865c2369281178ef131d36775bffe5892514f&amp;dn=Sonny+Stitt+-+Just+in+Case+You+Forgot+How+Bad+He+Really+Was+%28198&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"schon55","files":15,"time":1281210045,"description":"Sonny Stitt - Just in Case You Forgot How Bad He Really Was\nOriginal: 1981\nAudio CD: May 6, 2003 \nLabel: Savoy Jazz \nQuality: mp3 cbr 320 kbps\n\nThey probably could have come up with a better name for this album, but this 1981 live performance amply demonstrates that Stitt was still on top of his game just a few months before his death. On some tracks, he is joined by alto saxophonists Richie Cole (who demonstrates some brilliance of his own) and John Handy. Bobby Hutcherson on vibes is a great addition to the rhythm section, contributing some impressive solos, especially his interpretation of &quot;My Foolish Heart&quot; in the Ballad Medley and his fast-moving licks in &quot;Wee.&quot; \nOne track is simply labeled &quot;Solo Excerpt&quot; and consists of Stitt playing an up-tempo solo on tenor sax lasting nearly four minutes. The solo is brilliant, but it begs the question: Why wasn't the whole tune included, or even identified? Was the rest of the recording unavailable for some reason, or was time running short? If the latter, they could have made room by leaving out the final track (&quot;Outro,&quot; lasting 1:23), which is just an exit riff and introduction of the players. \nHerb Wong's liner notes include some interesting anecdotes, but more information about the tracks would have been helpful. On the tracks that feature two or three alto players, seasoned listeners will be able to recognize who is soloing, but those who are less familiar with these artists would benefit from being told the order of solos. \nDespite these minor drawbacks, this CD will please anyone who enjoys hearing classic bop and ballads played by great artists who are really putting their heart and soul into it. ~ James A. Vedda\n\nThis may not be the best album to illustrate Sonny Stitt's singular place among all saxophonists, but for a live recording session made scarely more than six months before Sonny's death, it demonstrates that this prolific and peerless player was still ready to rise to the occasion of a serious challenge. Richie Cole was considered, especially after his starring stint with the Buddy Rich big band, to be one of the real hot dogs of the alto saxophone--a player with virtually limitless technique and the complete arsenal of bebop licks. I wouldn't go so far as to say that Sonny scorches him, but he certainly takes him to school for a few valuable lessons. Listen, for example, to &quot;Star Eyes.&quot; Richie impresses with his solo, going for some familiar song quotes, a few tension-building motifs, and plenty of speed. Then it's Sonny's turn. The articulations are evened out, the phrases connect, the quotation (from &quot;Carnival of Venice&quot;) is incorporated seamlessly into the solo and, though not captured by the best audio reproduction, Sonny's majestic, open-throated sound prevails, practically making Richie sound like &quot;yakety sax&quot; in retrospective comparison. \n\nEven the title of this CD is rather sad, especially considering that Sonny no doubt recorded more albums than any other saxophone player. It should no more be necessary for the producers of this recording to remind us of Sonny's formidable musicianship than it should be a consumer's lot to have so few of Sonny's remaining in-print albums to choose from. ~ Samuel Chell\n\nSonny Stitt (alto &amp; tenor saxophones)\nJohn Handy (alto &amp; tenor saxophones)\nRichie Cole (alto saxophone)\nBobby Hutcherson (vibraphone)\nCedar Walton (piano)\nHerbie Lewis (bass)\nBilly Higgins (drums)\n\nSonny Stitt - Just in Case You Forgot How Bad He Really Was Tracks:\n01  Dig Dr. Woody\n02  Star Eyes\n03  Everything Happens to Me\n04  The Night Has a Thousand Eyes\n05  Ballad Medley\n06  Solo Excerpt\n07  Lover Man\n08  Laura\n09  Wee\n10  Outro","torrent":{"xt":"urn:btih:6a4865c2369281178ef131d36775bffe5892514f","amp;dn":"Sonny+Stitt+-+Just+in+Case+You+Forgot+How+Bad+He+Really+Was+%28198","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4865c2369281178ef131d36775bffe5892514f","infoHashBuffer":{"type":"Buffer","data":[106,72,101,194,54,146,129,23,142,241,49,211,103,117,191,254,88,146,81,79]},"announce":[],"urlList":[]}}