{"title":"Romanzo Criminale Serie 1 (3-8) (NL SUBS) 2Lions-Team","uid":5742906,"size":4534443519,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6a850b3022477434203440985ec73cb7d85d3815&amp;dn=Romanzo+Criminale+Serie+1+%283-8%29+%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pioen","files":-1,"time":1281092641,"description":"Romanzo Criminale Serie 1 - 3/8       \n\n \nEen bloedspannende Italiaanse TV-serie.\nEen must voor de liefhebbers van series als La Piovra en The Sopranos!\n\nROMANZO CRIMINALE  Serie 1\nRise and fall of a crime syndicate\n\nHet waargebeurde verhaal van de beruchte Banda della Magliana die Rome tussen 1977 en 1992 onveilig maakte.\nGebaseerd op de bestseller van Giancarlo De Cataldo.\n\nMaandenlang was heel ItaliÃƒÂ« in de ban van de TV-serie ROMANZO CRIMINALE. Een meer dan bloedspannende serie gebaseerd op de bestseller van Giancarlo De Cataldo over de beruchte Banda della Magliana die tussen 1977 en 1992 uitgroeide tot de machtigste criminele organisatie in Rome.\nVoor iedereen die films of TV-series als La Piovra of The Sopranos koestert is ROMANZO CRIMINALE een must. De kwaliteit van de serie is op alle fronten van een zeer hoog niveau. Het scenario zit ingenieus in elkaar, er wordt fantastisch geacteerd en de regie is meeslepend.\nBij ROMANZO CRIMINALE is als bonusmateriaal de film ALDO MORO  IL PRESIDENTE toegevoegd. De totale speelduur is ruim 13 uur op 8 DVD s.\n\n\n\nKorte inhoud\nItalie, 1977. Drie jonge Italiaanse criminelen staan aan de wieg van een van de machtigste en hardste misdaadorganisaties ooit. Drugshandel, ontvoeringen, terrorisme... Il Libanese (de Libanees), Il Dandi (de dandy) en Il Freddo (de kouwe) schrikken nergens voor terug en hebben maar ÃƒÂ©ÃƒÂ©n doel: heel Rome in hun macht krijgen.\n\nMet in de hoofdrollen: \n\n\n\nEXTRA S\nALDO MORO  IL PRESIDENTE\nRome, 16 maart 1978. Nadat zijn vijf bodyguards zijn neergeschoten, wordt expremier Aldo Moro op klaarlichte dag ontvoerd door de communistische terreurgroep de Rode Brigade. Er was de staat veel aan gelegen om Aldo Moro levend terug te vinden. Zo werd de\nbende van Magliana ingezet om tegen veel geld uit te zoeken waar de verblijfplaats van de ontvoerde Moro was. De - overigens volledig correcte . informatie werd echter door bepaalde politici moedwillig genegeerd en na 54 dagen werd zijn levenloze lichaam teruggevonden. Tot op de dag van vandaag speculeert men over wie verantwoordelijk was voor de dood van Moro. De Rode Brigades, de geheime\ndienst of de maffia.\nMet in de hoofdrol niemand minder dan Michele Placido, de ster van de maffiaserie La Piovra en regisseur van de gelauwerde speelfilm Romanzo Criminale.\n\nEnglish\n\nThe true story of the infamous Banda della Magliana to Rome between 1977 and 1992 was unsafe. Based on the bestseller by Giancarlo De Cataldo. For months throughout Italy was under the spell of the TV series ROMANZO CRIMI NAL. More than blood exciting series based on the bestseller by Giancarlo De Cataldo on the infamous Banda della Magliana between 1977 and 1992 became the most powerful criminal organization in Rome. Anyone who films or TV series like La Piovra or The Sopranos cherishes is ROMANZO NAL CRIMI a must. The quality of the series in every aspect of a very high level. The scenario is ingenious, there is great acting, the direction is compelling. ROMANZO By CRIMI NAL as bonus material the film ALDO MORO  IL PRESIDENTE added. The total running time is over 13 hours on 8 DVDs.\n\n\nTechnische gegevens\n8 DVD s \nBeeld: 16:9 anamorphic widescreen (1.78:1) \nGeluid: Dolby Digital 5.1 \nTaal: Italiaans \nOndertiteling: Nederlands\nGenre: Misdaad \nKijkwijzer: 16 jaar \nSpeelduur: 833 minuten (ruim 13 uur)\n\n\n\n\n\nISO/MDS\n16:9\nDD5.1\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\nThanks  Zadok \nGenre : Misdaad\n \nWeblink : http://www.dvd.nl/nieuws.php?id=3670\nWeblink : http://www.imdb.com/title/tt1242773 \n\n******************************************\n\nBrought to you by \nPioen\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n                              &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\t","torrent":{"xt":"urn:btih:6a850b3022477434203440985ec73cb7d85d3815","amp;dn":"Romanzo+Criminale+Serie+1+%283-8%29+%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a850b3022477434203440985ec73cb7d85d3815","infoHashBuffer":{"type":"Buffer","data":[106,133,11,48,34,71,116,52,32,52,64,152,94,199,60,183,216,93,56,21]},"announce":[],"urlList":[]}}