{"title":"Secrets of a sex addict.avi","uid":5740709,"size":746728254,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6ae481f09dc72ddf196aba6b2f15632583b35f09&amp;dn=Secrets+of+a+sex+addict.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hkgrguy","files":-1,"time":1281023983,"description":"Sue Silverman is onopvallende gehuwde nog kinderloze vrouw die met haar man in een rustige buitenwijk woont. Buiten zijn medeweten en haar controle om pikt Sue overal mannen op om seks met hen te hebben. Daardoor wordt het huishouden verwaarloosd waardoor de twee uit elkaar groeien.\n\nOp een feestje raakt Sue geÃƒÂ¯nteresseerd in de gehuwde Rick waarna ze regelmatig afspreken in een motel. Later flirt ze met een Fransman die bij haar op kantoor komt werken en die haar daarna in bed praat. Telkens denkt ze dat ze de ware liefde heeft gevonden maar voor de mannen is ze niet meer dan een scharrel.\n\nSue's vriendin vindt dat Sue een probleem heeft en geeft haar het nummer van een psychiater. Als Sue probeert de man van die vriendin tot seks te bewegen gaat ze daar eindelijk op in. Bij de psychiater komt aan het licht dat ze vroeger werd misbruikt door haar vader en ze gaat een maand op therapie.\n\nDaar leert ze dat ze de ware liefde niet gaat vinden door met iedereen naar bed te gaan. Daarmee is een eerste stap gezet naar de oplossing van haar probleem. Intussen is ze wel haar man en haar beste vriendin kwijtgeraakt.","torrent":{"xt":"urn:btih:6ae481f09dc72ddf196aba6b2f15632583b35f09","amp;dn":"Secrets+of+a+sex+addict.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ae481f09dc72ddf196aba6b2f15632583b35f09","infoHashBuffer":{"type":"Buffer","data":[106,228,129,240,157,199,45,223,25,106,186,107,47,21,99,37,131,179,95,9]},"announce":[],"urlList":[]}}