{"title":"The Lord of the Rings The Return of the King (2003)(2Lions-Team)","uid":5843954,"size":4682051720,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6c737981e09a50870e064e4fcdbcdbea325d7894&amp;dn=The+Lord+of+the+Rings+The+Return+of+the+King+%282003%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"juutje","files":-1,"time":1285083344,"description":"The Lord of the Rings: The Return of the King (2003) \n\nVerenigde Staten / Nieuw-Zeeland / Duitsland\nAvontuur / Fantasy\n201 minuten / 251 minuten (extended edition)\n\ngeregisseerd door Peter Jackson\nmet Elijah Wood, Ian McKellen en Viggo Mortensen\n\nDe hobbits Sam en Frodo beginnen samen met Gollum aan het laatste deel van hun reis richting Mordor, om daar te proberen in het hol van de leeuw de machtige Ene Ring te vernietigen. De legers van Gondor proberen ondertussen de stad Minas Tirith te beschermen tegen Sauron's legers.\n\n\nEngels\n\nThe War of the Ring reaches its climax as the dark lord Sauron sets his sights on Minas Tirith, the capital of Gondor. The members of the fellowship in Rohan are warned of the impending attack when Pippin cannot resist looking into Saruman's palantir and is briefly contacted by the dark lord. King Theoden is too proud to send his men to help without being asked, so Gandalf and Pippin ride to Minas Tirith to see that this request is sent. They meet opposition there from Denethor, steward of the city and father of Faramir and the late Boromir. Denethor's family has acted as temporary guardians of Gondor for centuries until a member of the true line of kings returns. This member is none other than Aragorn, who must overcome his own self-doubt before he can take on the role he was destined to fulfill. Meanwhile, Frodo and Sam continue to carry the One Ring towards Mordor, guided by Gollum. What they don't know is that Gollum is leading them into a trap so that he can reclaim the Ring for himself. Though Sam suspects his deceit, Frodo is starting to be corrupted by the Ring's power and the mistrust of Sam this causes is fully exploited by Gollum. The only way good can prevail in this contest is if the Ring is destroyed, an event that is becoming harder every minute for Frodo to achieve. The fate of every living creature in Middle Earth will be decided once and for all as the Quest of the Ringbearer reaches its climax. \n\nWeblink http://www.imdb.com/title/tt0167260/\nWeblink http://www.moviemeter.nl/film/3934\n\nVideo              : Retail DVDRip\nAudio              : AC 3  5.1 -ch English\nSubs               : English Dutch\nID                 : 224 (0xE0)\nFormaat            : MPEG Video\nFormaatversie      : Version 2\nBitrate-modus      : 720 pixels\nHoogte             : 576 pixels\nBeeldverhouding    : 16:9\nFramerate          : 25,000 fps\nStandaard          : PAL\nCover+Label        : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl/index.php&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\nPlease check our site !!!\nNEW SITE &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt; \n\n*****************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n","torrent":{"xt":"urn:btih:6c737981e09a50870e064e4fcdbcdbea325d7894","amp;dn":"The+Lord+of+the+Rings+The+Return+of+the+King+%282003%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c737981e09a50870e064e4fcdbcdbea325d7894","infoHashBuffer":{"type":"Buffer","data":[108,115,121,129,224,154,80,135,14,6,78,79,205,188,219,234,50,93,120,148]},"announce":[],"urlList":[]}}