{"title":"R.O.S.E. Online Evolution [ Rush On Seven Episodes Evolution | F","uid":5735366,"size":975185866,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6cf2fbb40c2f920d28262c06ceaec70861d61f12&amp;dn=R.O.S.E.+Online+Evolution+%5B+Rush+On+Seven+Episodes+Evolution+%7C+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"online-mir","files":1,"time":1280791994,"description":"R.O.S.E. Online Evolution (Rush On Seven Episodes Evolution)\nYear: 2006\nGenre: RPG / 3D / 3rd Person / Online-only / Massively multiplaer\n\nDeveloper: online-mir.org.ua\nPublisher: online-mir.org.ua\n\nPlatform: PC\nSystem requirements:\nCPU: Pentium III 800MHz or higher\nMemory: 128MB or higher\nGraphic Card: GeForce2 MX 400 or higher / Radeon 7000 or higher\nPublication Type: pirates\nLanguage: English only\n\n================================================\nRegister: &lt;a href=&quot;\nhttp://online-mir.org.ua/rose/index.php?op=register&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://online-mir.org.ua/rose/index.php?op=register&lt;/a&gt;\nStart:\nOSRose.exe / Launcher.ehe\n================================================\n\n================================================\nDescription:\n================================================\nROSE Online consists of seven vast planets. Each planet has its own characteristics and the environment. Interplanetary travelers will enjoy the many different adventures, which will be offered to these worlds.\nPlayers can form groups and complete dominance over the seven planets. In contrast to small wars, such as gildiynye war, in which players fight for control of locks, here the players can take part in the great war in which the rate will be the fate of the planet. When you're king of the planet, you will receive political and economic authority of the Head of the Government of this planet. Those who are able to gain control of all 7 planets will be the most powerful force in vselennoy.Dop. Information:\n================================================\nSeven different planets\n================================================\nWorld ROSE consists of seven vast planets. Each planet has its own set of particular characteristics and environments.\nInterplanetary explorers will enjoy a variety of adventures, which this world can offer.\n================================================\nInterplanetary Battle\n================================================\nPlayers can form teams and compete for control of the seven planets. Unlike a small scale war, such as war guild where players fight for possession of the castle, players can take part in the great war in which at stake the fate of an entire planet. Once you become the king of the planet, you will have the political and economic leadership. Anyone will be able to take control of all the seven planets will receive the greatest power in the universe.\n================================================\nNew Technologies\n================================================\nIn total there are 3 forms of displacement in the world of ROSE.\nSiege machine, which is needed to cause great damage to the enemy in the fight,\nThe machine, which is necessary to quickly mix.\nFlying a ship that is needed to realize the dream of studying outer space.\nMay be modified, customized machines and siege machines changing parts and improve skills.\n================================================\nPlayers can create their own story of the legend.\n================================================\nQuests in the world of ROSE are all connected with the social life of players. Each change in the game, such as the price of things, the rate of spawn monsters, monster figure (MVP) or the weather - all this under the influence of the players.\nEach main evet, which takes place on 7 planets is recorded on the official site. Charov names who have played key roles in these events are displayed on the official website that their legendary cases were recorded for posterity.\n================================================\nControlling functions of NPC.\n================================================\nFactions differ from Clans because a society ruled by faction NPC and not the players.\nCombining fractions, consumers can participate in various quests. Each faction has a certain length of leadership in economics, politics, public order, magic, art and religion. Each faction has its own alliances and hostilities.\n================================================\nEconomy of supply and demand.\n================================================\nMaterials for creating items are distributed in different areas. Consequently, cities in different areas have different prices for materials. As a result, when the city has too much of one material, the price of this material goes down automatically, and when the amount of a specific material is lower than expected, immediately activated the quests of the city, which contributes to, the collection of material to neutralize the city's economy. Consumers may have an advantage over this system of economy by buying things at a low price in one town and selling it at a higher price in another city.","torrent":{"xt":"urn:btih:6cf2fbb40c2f920d28262c06ceaec70861d61f12","amp;dn":"R.O.S.E.+Online+Evolution+%5B+Rush+On+Seven+Episodes+Evolution+%7C+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cf2fbb40c2f920d28262c06ceaec70861d61f12","infoHashBuffer":{"type":"Buffer","data":[108,242,251,180,12,47,146,13,40,38,44,6,206,174,199,8,97,214,31,18]},"announce":[],"urlList":[]}}