{"title":"Battlestar Galactica (Season 1 - Disk 4) - 2Lions-Team","uid":5825450,"size":4682394827,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6da8e351f61cb8ad28105b8ff9d319402df1dc2b&amp;dn=Battlestar+Galactica+%28Season+1+-+Disk+4%29+-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SAIMOR","files":-1,"time":1284247935,"description":"Verenigde Staten / Release Datum September 2006\n\nDVD 4 van DVD 5\n\nRegisseur: Michael Rymer \n\nmet Edward James Olmos, Mary McDonnell, Katee Sackhoff, Jamie Bamber, James Callis \n\nBeschrijving:\n\nScherper en heftiger dan zijn voorganger is Battlestar Galactica 2004 een compleet nieuwe invulling van de serie uit de jaren 70. \nWaarbij de actie, het avontuur en het drama dat de originele serie zo populair maakte in een overtreffende trap worden gepresenteerd. \nHet innovatieve verhaal van mensen versus machine is gebleven, maar deze keer is de Cylon niet langer een herkenbare vijand... hij kan zich onder de mensen begeven. \nNadat de 12 mensenkolonies vrijwel zijn vernietigd in de climax van een honderdjarige oorlog tegen het Cylon rijk, moeten President Roslin (Mary McDonnell) en\nCommander Adama (Edward James Olmos) de laatste nog levende mensen op de twaalf werelden oppikken om aan een reis te beginnen op zoek naar de mythische planeet Aarde, \nde veronderstelde dertiende kolonie van de mensheid. Battlestar Galactica 2004 blaast nieuw leven in de verhalen en ideeÃƒÂ«n die het hart vormden van de originele\nserie, met een meeslepende plot, adembenemende speciale effecten en pakkende actie en avontuur die zowel de oude fans als een nieuwe generatie van bewonderaars aan zal spreken. \n\nInhoudUitvoering: Dvd, 5 disks, speelduur 719:00 minuten \nKleur           : Color \nRegio           : 2 \nTaal            : Engels \nOndertiteling   : Nederlands \nAudio           : Dolby Digital 5.1  \n****************************************************************************\nUnited States / Release Date September 2006\n\nDVD 4 of DVD 5\n\nDirector: Michael Rymer\n\nwith Edward James Olmos, Mary McDonnell, Katee Sackhoff, Jamie Bamber, James Callis\n\nDescription:\n\nSharper and heavier than its predecessor, Battlestar Galactica 2004 a completely new interpretation of the series from the 70.\nTaking the action, adventure and drama that made the original series so popular in a superlative presentation.\nThe innovative story of human versus machine remains, but this time, the Cylon no longer a recognizable enemy ... he can go among the people.\nAfter the colonies almost 12 people have been destroyed in the climax of a hundred-year war against the Cylon Empire, President Roslin must (Mary McDonnell) and\nCommander Adama (Edward James Olmos), the last surviving people on the twelve worlds pick to start a journey to find the mythical planet Earth,\nthe supposed thirteenth colony of mankind. Battlestar Galactica 2004 gives new life to the stories and ideas that formed the heart of the original\nSeries, with a compelling plot, breathtaking special effects and gripping action and adventure that both old fans and a new generation of admirers will appeal.\n\nContent Model: DVD, 5 discs, running time 719:00 minutes\nColor        : Color\nRegion       : 2\nLanguage     : English\nSubtitles    : Dutch\nAudio        : Dolby Digital 5.1\n\n*****************************************************************************\nBrought to you by: \n\nROMIAS for 2Lions-Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n \n\n2Lions-Team for all your Dutch MOVIES and more \n\n****************************************************************************** \nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.\n\n******************************************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*******************************************************************************\t\n \n \n \n","torrent":{"xt":"urn:btih:6da8e351f61cb8ad28105b8ff9d319402df1dc2b","amp;dn":"Battlestar+Galactica+%28Season+1+-+Disk+4%29+-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6da8e351f61cb8ad28105b8ff9d319402df1dc2b","infoHashBuffer":{"type":"Buffer","data":[109,168,227,81,246,28,184,173,40,16,91,143,249,211,25,64,45,241,220,43]},"announce":[],"urlList":[]}}