{"title":"Honey West Disc 2","uid":5728709,"size":1607076864,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6dadfd523e460dc197956cbe4667c82c80921faf&amp;dn=Honey+West+Disc+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"soletar","files":1,"time":1280569137,"description":"As televisions first title roll female Private Eye, Honey West would take on any tough case. After the death of her father, the sexy private detective took over his high-tech PI firm. Being assisted by the rugged Sam Bolt and her pet ocelot Bruce, she could handle herself mingling with millionaires just as well as scaling a thirty foot wall.\n\nAnne Francis, John Ericson, Bruce the Ocelot\n\nDISC TWO: \n\n&quot;The Flame and The Pussycat&quot; - written by George Clayton Johnson, directed by James Goldstone: An arsonist is on the loose burning warehouses. Can Honey figure out his motives before she gets burned too? (25:27)\n\n&quot;A Neat Little Package&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by Murray Golden: A newsstand owner suffering from memory loss hires Honey to help figure out the missing pieces of his past. This episode features a camera watch gadget. (25:18)\n\n&quot;A Stitch In Crime&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by John Peyser: When $100,000 worth of designer eveningwear is stolen from Honey, will she be able to track them back down in time for the big fashion show in San Francisco? Catch a hilarious scene with Honey and Sam dressed as beatniks. (25:25)\n\n&quot;A Million Bucks In Anybody's Language&quot; - written by Tony Barrett, directed by John Florea: Honey must discover who is responsible for the death of her latest client, who also happens to be another private investigator. Check out Honey in a sexy tiger skinned outfit. (25:25)\n\n&quot;The Gray Lady&quot; - written by William Link &amp; Richard Levinson, directed by Walter Grauman: A chameleon jewel thief (who only steals from celebrities) keeps Honey guessing when he steals from her latest client. This episode utilizes a special television monitoring device (as well as a memorable Honey fight sequence). Kevin McCarthy (Invasion of the Body Snatchers,UHF) guest stars. (25:27)\n\n&quot;Invitation To Limbo&quot; - written by William Link &amp; Richard Levinson, directed by Tom Gries: Honey must thwart a hypnotist from stealing valuable corporate files. Wayne Rogers (TV's Trapper John on M*A*S*H) guest stars. (25:27)\n\n&quot;Rockabye The Hard Way&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by Bill Colleran: Honey travels to Mexico in order to recover a missing American with important military secrets. Joe Don Baker (Fletch, GoldenEye) has a small supporting role. (25:27)\n\n&quot;A Nice Little Till To Tap&quot; - written by Tony Barrett, directed by Jerry Hopper: Honey goes undercover, as a teller, in order to nab a bank robber. (25:26)\n\nExtra Features:\nBehind The Scenes Photo Gallery - 21 images (2:49)\nVintage Commercials - Sucrets Throat Lozenges, Carnation Instant Breakfast, Coffe-mate, Cover Girl, Sylvania Blue Dot Flash Cubes, Pall Mall Cigarettes, Tareyton Cigarettes. 7 commercials total. (6:12)\n\nTotal Running Time Approximately 212 Min.","torrent":{"xt":"urn:btih:6dadfd523e460dc197956cbe4667c82c80921faf","amp;dn":"Honey+West+Disc+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dadfd523e460dc197956cbe4667c82c80921faf","infoHashBuffer":{"type":"Buffer","data":[109,173,253,82,62,70,13,193,151,149,108,190,70,103,200,44,128,146,31,175]},"announce":[],"urlList":[]}}