{"title":"Patrician.IV.Conquest.by.Trade-RELOADED","uid":5830141,"size":2858214228,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6dd26dad12fae331786bde644c30ca1e3b5ad99b&amp;dn=Patrician.IV.Conquest.by.Trade-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MAFIAA.","files":-1,"time":1284482040,"description":"09/2010 :..... RELEASE.DATE .. PROTECTION .......: Serial\n1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\nThe Steam Special Edition contains alternate textures for the Counting House\nand Cog ship type.\n\nPatrician IV is the sequel to the historical trading simulation and strategy\nseries. You are a merchant in northern Europe in the late Middle Ages when\nthe Hanseatic League was flourishing. Your goal is to rise to the most\nsuccessful and influential member of the Hanse, ultimately being elected\nElderman, leader of the trading league. You start bargaining with common\ngoods, build up your own production and establish a merchant fleet. Later on,\nyou will gain more and more political influence and even found new towns.\n\nHowever, a Hanse merchant's life can also have its dark sides. On your way to\npower you have to hold your ground against fierce rivals, whom you have to\nfight with economic competition, price wars or impure means such as sabotage\nWill you even engage in piracy?\n\nFeatures\nBecome a powerful merchant - rise through the ranks using your increasing\nfame and wealth to shape towns from small villages to glorious capitals\nunder your control\nA complete strategic simulation - balance competing interests, trade\nroutes, political turmoil, disease, weather, piracy and greedy royalty\nBuild an empire - construct buildings and hire workers, stimulating\ndemand for common and exotic goods\nBattle on the high seas - protect your ships from pirate raiders in\nrealistic and exciting sea battles\nVisually stunning - a powerful new graphics engine lets you visit\nbustling and realistically recreated medieval cities such as London,\nNovgorod, Cologne and Bergen\nFriendly Interface and Gameplay - Players will enjoy a brand-new, user\nfriendly interface that makes Patrician IV easy to play but challenging\nto master\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Use one of the following keys when prompted\nXXXX-XXXXX-XXXXX-XXXXX-XXXXX\nXXXX-XXXXX-XXXXX-XXXXX-XXXXX\nXXXX-XXXXX-XXXXX-XXXXX-XXXXX\nXXXX-XXXXX-XXXXX-XXXXX-XXXXX\nXXXX-XXXXX-XXXXX-XXXXX-XXXXX\nXXXX-XXXXX-XXXXX-XXXXX-XXXXX\nXXXX-XXXXX-XXXXX-XXXXX-XXXXX\n5. Play the game, but do not allow it to go online (protip: firewall\n6. Support the software developers. If you like this game, BUY IT","torrent":{"xt":"urn:btih:6dd26dad12fae331786bde644c30ca1e3b5ad99b","amp;dn":"Patrician.IV.Conquest.by.Trade-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dd26dad12fae331786bde644c30ca1e3b5ad99b","infoHashBuffer":{"type":"Buffer","data":[109,210,109,173,18,250,227,49,120,107,222,100,76,48,202,30,59,90,217,155]},"announce":[],"urlList":[]}}