{"title":"Lou Reed - I Love You, Suzanne  (2nafish)","uid":5697610,"size":151437316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6dd494133ff141652bbdbf3368865b6f14d1c2f1&amp;dn=Lou+Reed+-+I+Love+You%2C+Suzanne++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1279324878,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNew Sensations is a 1984 album by Lou Reed.\n\nWhen this album was released, critics and listeners alike took note of a change in the songs as being more upbeat and fun than much of Reed's prior work. Lou seemed to have abandoned the often self-destructive lifestyle of a New York rock star and retreated to the New Jersey suburbs.\n\nLewis Allan &quot;Lou&quot; Reed (born March 2, 1942) is an American rock musician, songwriter, and photographer. He is best known as guitarist, vocalist, and principal songwriter of The Velvet Underground, and for his successful solo career, which spans several decades and crosses multiple genres. The Velvet Underground gained little mainstream attention during their career, but became one of the most influential bands of their era. As the Velvet Underground's main songwriter, Reed wrote about subjects of personal experience that rarely had been examined so openly in rock and roll, including a variety of sexual topics and drug culture. As a guitarist, he was a pioneer of many guitar effects including distortion, high volume feedback, and nonstandard tunings.\n\nAfter his departure from the group, Reed began a solo career in 1971. He had a hit the following year with &quot;Walk on the Wild Side&quot;, although for more than a decade he evaded the mainstream commercial success its chart status offered him. Reed's work as a solo artist has frustrated critics wishing for a return of The Velvet Underground. The most notable example is 1975's infamous double LP of recorded feedback loops, Metal Machine Music, upon which Reed later commented: &quot;No one is supposed to be able to do a thing like that and survive.&quot; By the late 1980s, however, he had garnered recognition by the music community as an elder statesman of rock. Since 2008, he has been married to the musician, multi-media and performance artist Laurie Anderson.\n\nIn 1980, Reed marrieddesigner Sylvia Morales. They were divorced more than a decade later. While together, Morales inspired some of Reed's best known love songs, particularly &quot;Think it Over&quot; from 1980's Growing Up in Public and &quot;Heavenly Arms&quot; from 1982's The Blue Mask. After Legendary Hearts (1983) and New Sensations (1984) fared adequately on the charts, Reed was sufficiently rehabilitated as a public figure to become spokesman for Honda motorcycles.\n\nOn September 22, 1985, Reed performed at the first Farm Aid concert in Champaign, Illinois, USA. He performed &quot;Doin' The Things That We Want To&quot;, &quot;I Love You, Suzanne&quot;, and &quot;New Sensations&quot; from &quot;New Sensations&quot;, and &quot;Walk on The Wild Side&quot;.\n\nIn 1986, he joined the Amnesty International A Conspiracy of Hope Tour and was outspoken about New York's political issues and personalities on the 1989 album New York, commenting on crime, AIDS, Jesse Jackson, Kurt Waldheim, and Pope John Paul II.\n\nFollowing Warhol's death after routine surgery in 1987, Reed again collaborated with John Cale on 1990's Songs for Drella (Drella - Warhol's nickname - is a blend of the words &quot;Dracula&quot; and &quot;Cinderella&quot;). The album marked an end to a 22-year estrangement. The album took the shape of a Warhol biography; on the album, Reed sings of his love for his late friend, but also criticizes both the doctors who were unable to save Warhol's life and Warhol's would-be assassin, Valerie Solanas.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6dd494133ff141652bbdbf3368865b6f14d1c2f1","amp;dn":"Lou+Reed+-+I+Love+You%2C+Suzanne++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dd494133ff141652bbdbf3368865b6f14d1c2f1","infoHashBuffer":{"type":"Buffer","data":[109,212,148,19,63,241,65,101,43,189,191,51,104,134,91,111,20,209,194,241]},"announce":[],"urlList":[]}}