{"title":"Steppenwolf - Rock Me (Beat Club) (2nafish)","uid":5847113,"size":134719492,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6de718c9f6088c47ddb8e73069732194e19a4f48&amp;dn=Steppenwolf+-+Rock+Me+%28Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1285234061,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAt Your Birthday Party is the third studio album by Steppenwolf, released in 1969 (see 1969 in music) on the label ABC Dunhill Records. It was the first Steppenwolf album to feature bass player Nick St. Nicholas. Although it was less critically acclaimed than their successful first two albums, Steppenwolf and Steppenwolf the Second, it contained a few well-known hits, such as &quot;It's Never Too Late&quot; and &quot;Jupiter's Child&quot;, as well as the colossal &quot;Rock Me&quot;. Still it would be their last top ten album with their last top ten hit. Even then, though, the album showcases Steppenwolf at their peak, coming out of, but not yet completely abandoning, the psychedelia of Steppenwolf the Second  and stepping into the distinctive hard rock of their later releases, but with less weight here than later, meaning it slides faster and more furiously.\n\nThe album's strange cover art supposedly depicts the charred remnants of amplifiers and equipment that had belonged to Canned Heat before a 1969 fire ripped through Canned Heat's house and rehearsal studio on Lookout Mountain Ave in Laurel Canyon, Los Angeles, California.\n\nThe original LP was a gatefold with a punched-out front cover; the punchout revealed a photo of the band which comprised the inner sleeve's recto.\n\nSteppenwolf is a Canadian-American hard rock group that was prominent in the late 1960s. The group was formed in 1967 in Los Angeles by vocalist John Kay, guitarist Michael Monarch, bassist Rushton Moreve, keyboardist Goldy McJohn and drummer Jerry Edmonton after the dissolution of Toronto group The Sparrows of which Moreve was not a member.\n\nThe band has sold more than 25 million units worldwide, releasing eight gold albums and twelve Billboard Hot 100 singles of which six were Top 40 hits, including three Top 10 successes: &quot;Born to Be Wild&quot;, &quot;Magic Carpet Ride&quot;, and &quot;Rock Me&quot;. Steppenwolf enjoyed worldwide success from 1968 to 1974, but clashing personalities led to the end of the core lineup. Today, frontman John Kay is the only original member left, having served as lead singer for more than 40 years since 1967.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6de718c9f6088c47ddb8e73069732194e19a4f48","amp;dn":"Steppenwolf+-+Rock+Me+%28Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6de718c9f6088c47ddb8e73069732194e19a4f48","infoHashBuffer":{"type":"Buffer","data":[109,231,24,201,246,8,140,71,221,184,231,48,105,115,33,148,225,154,79,72]},"announce":[],"urlList":[]}}