{"title":"The Spencer Tracy Legacy (TV) [1986] A Tribute by Katharine Hepb","uid":5699567,"size":781810971,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:705512865d0e49997f87f1ffb4d718808c8820ca&amp;dn=The+Spencer+Tracy+Legacy+%28TV%29+%5B1986%5D+A+Tribute+by+Katharine+Hepb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1279445355,"description":" &lt;a href=&quot;http://bayimg.com/aAnKiaacl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/aAnKiaacl&lt;/a&gt;\n\nThe Spencer Tracy Legacy: A Tribute by Katharine Hepburn (1986) (TV) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0091994/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0091994/&lt;/a&gt;\n\nThe moment is as wrenching as it is unexpected. Katharine Hepburn, a fiercely private person, begins reading a letter she wrote to Spencer Tracy long after he had died in 1967. It is an extremely personal document, openly reflecting the special love that existed between them. Tears welling in her eyes, she recalls that &quot;living wasn't easy for you, was it?&quot; She mentions his drinking problem and the puzzling fact that ''you couldn't enter your own life but you could be someone else. For all of that, she declares, he was still ''the world's best movie actor.\n\nThe scene, clearly thought out with care, comes at the end of &quot;The Spencer Tracy Legacy: A Tribute by Katharine Hepburn.&quot; Made by WNET in association with M-G-M Television, this is another of those movie-clip compilations that celebrate the talent and glamour of film stars. The producers are David Heeley and Joan Kramer, whose credits on similar valentines include &quot;Fred Astaire: Change Partners and Dance,&quot; &quot;Starring Katharine Hepburn&quot; and &quot;Judy Garland: The Concert Years.&quot;  Written by John L. Miller, the documentary offers a lively review of the Tracy career. Miss Hepburn is on hand not only as narrator but also as host and tour guide. Hair piled high, and wearing her standard uniform of slacks, black turtleneck sweater and lumpy jacket, she cheerfully anticipates any criticism about &quot;that lady up there&quot; being prejudiced. &quot;Damn right,&quot; says she, proudly. Miss Hepburn doesn't romanticize Tracy's image. For those unfamiliar with his style, she explains, seeing him is &quot;like eating a baked potato for the first time&quot; - he is pure, of the earth, dependable.\n\nColleagues who once worked with him, from Frank Sinatra to Mickey Rooney, offer tributes to the Tracy method. What it all boils down to is that he was a serious, well-prepared craftsman who worked almost entirely on his instincts. He never liked to do more than one take because he was convinced that his work would disintegrate with more. What came through on the screen was less a series of bravura moments than an accumulation of powerful concentration. Miss Hepburn argues that although he had made dozens of movies before 1936, it was &quot;San Francisco,&quot;  co-starring Clark Gable, that gave Tracy an opportunity to discover his own mystique. With the perennial tough guy playing a priest, he emerged as something more than a good actor; he had become a star.\n\nIt is generally agreed that Spencer Tracy was a difficult man to know, that he shied away from personal problems. Miss Hepburn speculates a couple of times on his Roman Catholic background as being a significant factor in his life. His wife, Louise, now deceased, is mentioned and seen casually in this documentary. And his daughter, Susie, is seen chatting amiably with Miss Hepburn. With time, it seems, adjustments have been made, at least to the point where Miss Hepburn can give the public an unusually intimate glimpse into what is bound to be one of Hollywood's more enduring legends.\n","torrent":{"xt":"urn:btih:705512865d0e49997f87f1ffb4d718808c8820ca","amp;dn":"The+Spencer+Tracy+Legacy+%28TV%29+%5B1986%5D+A+Tribute+by+Katharine+Hepb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"705512865d0e49997f87f1ffb4d718808c8820ca","infoHashBuffer":{"type":"Buffer","data":[112,85,18,134,93,14,73,153,127,135,241,255,180,215,24,128,140,136,32,202]},"announce":[],"urlList":[]}}