{"title":"Cities.XL.Limited.Edition.MULTi3-FASiSO","uid":5739497,"size":3711043209,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:710c9583a070ecfddf10059fa186f8e0adef6353&amp;dn=Cities.XL.Limited.Edition.MULTi3-FASiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thenoobish","files":-1,"time":1280948981,"description":"Cities XL - Limited Edition *ISO*\n\nDate.........: 2010-08-03                         Files........: 75 x 50.00\nCompany......: Monte Cristo                       Language.....: Multi 3\nRequirements.: Computer, Windows 2K/ME/XP/Vista/7\n\n\nGame Notes\n\nCities XL sets a new benchmark in the city-builder game category by fusing,\nfor the first time, the city builder genre with an MMO. Offline, it offers\nall the benefits of the leading city builders, through the creation and\ndevelopment of a photorealistic city in which managing your resources and\npopulation categories, will be essential to success. Online, it proposes\nan entirely new layer to the experience in allowing the players to trade\nresources with others, participate to the construction of Mega structures,\nor visit the entire planet via your avatar.\n\nFeatures:\n\n- 25 maps featuring varying landscapes - from canyons to grassy hills and\nsnowy mountains\n- Around 500 buildings based on various architectural styles (European,\nAmerican...)\n- A set of never-before-seen real-time construction tools allowing players\nto create curved roads, building zones of various shapes, elaborate\nbridges...\n- Diverse citizen structure: Four levels of wealth, four main different\nneeds (Services, Environmental, Prices and Traffic) split into many sub-\ncategories (Police and Fire departments, Education, Leisure, Commerce,\nmultiple types of Pollution, Taxes, Cost of Life, Distance to work and\nmore)\n- A rich enterprise selection ranging from agriculture to heavy industry,\nservices, tourism\n- A complex, but easy to access, simulation based on 15 resources\n(electricity, waste management, agriculture, water, fuel, etc.)\n- An ambitious traffic system including many type of roads (five different\nwidths, costs, quality and capacity), highways, airports, ports, and much\nmore. Complex bus system will be provided free post release\n- An avatar studio and Web-based profile pages\n\nLimited Edition contents:\n\n- 6 In-Game Buildings/Monuments - Lost Angeles City Hall, Berlin Victory\nColumn, Liev Saint-Vladimir cathedral, San Francisco Grand Hotel Paris\nOpra Garnier and the New York 40th Wall Street Building\n- 5 Additional Maps for Solo Mode\n- 2 Permanent Megastructures - Big Ben  Houses of Parliament and Maya\nPyramid of Chichn Itz\n- Special Add-Ons - T-shirt for your avatar and a web distinction\n- Large format Cities XL poster\n- 3 original Cities XL postcards\n\nURL: http://www.amazon.co.uk/dp/B002MZZMX6/\nURL: http://www.citiesxl.com\n\nNOTE: This game is English, French and German\n\n\nInstallation Notes\n\n1. UnRAR\n2. Burn the ISO with your favorite software.\n3. Install game\n4. Copy all files from FASiSO folder into install folder. Make sure that:\na) fas.patch is inside Paks\nb) Cities XL - Launcher.exe is in same folder as CitiesXL.exe\n5. Install patch CXL_1.0.3.297_to_CXL_1.1.0.457-B4.exe\n6. Start the game with Cities XL - Launcher.exe and remember your profile\nname so that you can continue your game later.","torrent":{"xt":"urn:btih:710c9583a070ecfddf10059fa186f8e0adef6353","amp;dn":"Cities.XL.Limited.Edition.MULTi3-FASiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"710c9583a070ecfddf10059fa186f8e0adef6353","infoHashBuffer":{"type":"Buffer","data":[113,12,149,131,160,112,236,253,223,16,5,159,161,134,248,224,173,239,99,83]},"announce":[],"urlList":[]}}