{"title":"The Matches - Complete Studio Album Discography","uid":5740193,"size":310207040,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:714b093bc79cf6c4dd0d6dd74f23a15d23987001&amp;dn=The+Matches+-+Complete+Studio+Album+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Theminkman","files":53,"time":1280978842,"description":"This is the complete discography for The Matches\\' four studio albums. The albums are all ripped straight from CDs, and the four albums that are included are:\n\nE. Von Dahl Killed the Locals (2004)\nDecomposer (2006)\nA Band In Hope (2008)\nthe Matches Album 4, Unreleased; Graphics? Title? or Not Needed?  (2009)\n\n\nThe following is a brief description of the band, as described by Wikipedia:\n\n\nThe Matches are a United States-based band formed in 1997 in Oakland, California. It currently is composed of vocalist and rhythm guitarist Shawn Harris, lead guitarist and backup vocalist Jonathan Devoto, bassist and backup vocalist Dylan Rowe, and drummer Matt Whalen. The Matches have released four studio albums and five singles, and currently are unsigned after their contract with Epitaph Records expired.\n\n\nIf you decide to give The Matches a listen, I would recommend listening to their debut album, &quot;E. Von Dahl Killed the Locals&quot;, as it is, in my opinion, the best of the four albums. The song style changes from punk rock in E. Von Dahl Killed the Locals to punk/alternative in Decomposer, and then finally to alternative in their last two albums, &quot;A Band In Hope&quot; and &quot;the Matches Album 4, Unreleased; Graphics? Title? or Not Needed?&quot;.\n\nAll the songs are correctly labeled, and are in MP3 format, at 256 kbps. The album artwork is also included. Please seed, as it is my first torrent that I have uploaded to Thepiratebay and I would like to make a good first impression. Thanks!\n","torrent":{"xt":"urn:btih:714b093bc79cf6c4dd0d6dd74f23a15d23987001","amp;dn":"The+Matches+-+Complete+Studio+Album+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"714b093bc79cf6c4dd0d6dd74f23a15d23987001","infoHashBuffer":{"type":"Buffer","data":[113,75,9,59,199,156,246,196,221,13,109,215,79,35,161,93,35,152,112,1]},"announce":[],"urlList":[]}}