{"title":"Kidd Jordan, Hamid Drake, William Parker - Palm Of Soul (2006)","uid":5882997,"size":341058159,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:75c65cd73d6598519cd6e9e1f4c20444caef0f78&amp;dn=Kidd+Jordan%2C+Hamid+Drake%2C+William+Parker+-+Palm+Of+Soul+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mariorg","files":-1,"time":1286974912,"description":"Personnel:\n~~~~~~~~~\n* Kidd Jordan: saxophone\n* Hamid Drake: vocals, drums, percussion\n* William Parker: bass instrument, drums, percussion\n\nRecording information: Systems Two Studio, Brooklyn, NY (09/23/2005)\n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:jzftxqudldke&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:jzftxqudldke&lt;/a&gt;\n\nArtist Kidd Jordan/Hamid Drake/William Parker\nAlbum Palm of Soul\nRating 4 Stars\nRelease Date Jun 13, 2006\nRecording Date Sep 23, 2005\nLabel AUM Fidelity\nGenre\n* Jazz\nStyles\n* Avant-Garde Jazz\n* Neo-Bop\n* World Fusion\n* Modern Creative\n\nReview\n~~~~~~\n\nby Thom Jurek\n\n\nIt's all there at the very beginning, thanks to Kidd Jordan, New Orleans'\nseptuagenarian saxophonist, teacher, and leader; drummer Hamid Drake, who,\ndespite leaving the Crescent City decades ago, still understands second-line\nrhythms; and William Parker, bassist extraordinaire, who plays a startling array\nof singing bowls, gongs, and even the talking drum on this session. In the 56\nseconds that are &quot;Peppermint Falls,&quot; the album's opener, all the elements are\nthere, up front, and waiting to peel the layers off the onion of sound. Jordan\nswings in everything he does, whether it's the lonesome blues singing at the\ncommencement of &quot;Forever&quot; or the startling intensity of &quot;Unity Call.&quot; It's about\nsong and sound, the notion of singing through the horn, expressing what the\nIndian, North African, and Congo shamans have been singing about for\ncenturies. Certainly this is jazz; it lives in a post-Coltrane aesthetic -- the\none of discovery, not imitation. The bowed bass beginnings of &quot;Living Peace&quot;\nsuggest, from the relative calm and quiet of the first two tracks, that the\nedges will become a noticeable present tense in this music. But there are no\nedges, despite the moan-song of the horn, the bowing and the skeletal inverted\nnotion of time that Drake stretches to its breaking point. What breaks are the\ndefined notions of the pianoless jazz trio. This is a triangle where texture,\nbalance, and color become the points at which sound itself can be expressed\nwithout distraction or notional individual identity struggles. This is music\nthat just is, as jazz, as blues, as folk music. The culmination of the trio's\nart is in the album's final cut, &quot;Last of the Chicken Wings.&quot; Never has out jazz\nsounded so recreational. The percussion work by both sidemen is stunning,\ncarrying a series of Yoruba rhythmic inventions into the joy of the moment. When\nJordan gets into his Ornette thang, playing the same catchy phrase over and over\nagain as the percussion gets louder and more insistent, it's an expression of\njoy. And that's what Palm of Soul is, an expression of spirit joy, one that is\nrooted in the breakdown of time as a construct, and jazz as an independent\nform. In fact, if this trio proves anything on this date, it is that jazz is the\nmusic that carries within it -- or at least can and should -- all the musics of\nthe world. Brilliant.","torrent":{"xt":"urn:btih:75c65cd73d6598519cd6e9e1f4c20444caef0f78","amp;dn":"Kidd+Jordan%2C+Hamid+Drake%2C+William+Parker+-+Palm+Of+Soul+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75c65cd73d6598519cd6e9e1f4c20444caef0f78","infoHashBuffer":{"type":"Buffer","data":[117,198,92,215,61,101,152,81,156,214,233,225,244,194,4,68,202,239,15,120]},"announce":[],"urlList":[]}}