{"title":"Teleac Buitenbeentjes - Depressie (DVD ISO)NLT-Release","uid":5898524,"size":1671888640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:75d2f4958ed27fd40441888cb938824833b5ca9c&amp;dn=Teleac+Buitenbeentjes+-+Depressie+%28DVD+ISO%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NLT-Release-Linday","files":-1,"time":1287590899,"description":"\n7% van de kinderen van 8 tot 11 jaar heeft gedragsproblemen. Ongeveer 250.000 jongeren, in de leeftijd van 13 tot 18 jaar, hebben psychische problemen. Veel voorkomende problemen zijn angst- en dwangstoornissen, eetstoornissen (anorexia en bulimia), depressie, agressieve gedragsstoornissen, ADHD, autisme en aanverwante stoornissen.\nPortretten van kinderen en ouders\n\nHet programma Buitenbeentjes geeft informatie over de aard, de oorzaken en de behandeling van zes veelvoorkomende, vaak ernstige psychische aandoeningen bij kinderen en jongeren. Het gaat om portretten van kinderen en ouders die problemen hebben. Samen met de hulpverlening zoeken zij een manier om de situatie hanteerbaar te maken en te houden. Naast informatie over aandoeningen besteden we aandacht aan actueel onderzoek naar de achtergronden van psychiatrische stoornissen. Meer kennis over deze zaken kan leiden tot meer begrip en openheid voor 'buitenbeentjes' en hun ouders.\n\nJong zijn en je neerslachtig en lusteloos voelen. Nergens lol aan beleven en het leven vaak niet meer zien zitten. Volgens onderzoeken heeft 3 tot 8% van de jongeren tussen de 12 en 18 jaar een depressie. Dat zijn 30.000 tot 80.000 jongeren. Hoe komt het dat kinderen en jongeren al last hebben van een depressie? Zijn er verschillen met een depressie op volwassen leeftijd en wat is eraan te doen?\n\nThirza van der Linden is 16 jaar en chronisch depressief. Zij voelt zich leeg, moe en lusteloos. Zij weet niet hoe het komt dat zij zo diep in de put geraakt is. Eerst dacht ze dat wanneer ze de oorzaak wist het vanzelf wel over zou gaan. Maar nu zij in therapie is en antidepressiva gebruikt, vindt ze dat niet meer zo belangrijk en wil ze alleen maar dat het over gaat.\n\nSubs: Nederlands Gesproken\nType: ISO\nGenre:Documentaire\n\nUnieke hashcode voor deze film:\n75D2F4958ED27FD40441888CB938824833B5CA9C\n\nVoor de nieuwste films en muziek ga je naar NLT.ONs-Forum het forum voor de Nederlands Ondertitelde Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:75d2f4958ed27fd40441888cb938824833b5ca9c","amp;dn":"Teleac+Buitenbeentjes+-+Depressie+%28DVD+ISO%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75d2f4958ed27fd40441888cb938824833b5ca9c","infoHashBuffer":{"type":"Buffer","data":[117,210,244,149,142,210,127,212,4,65,136,140,185,56,130,72,51,181,202,156]},"announce":[],"urlList":[]}}