{"title":"The Vampire Diaries S02D01 Pioen 2Lions-Team","uid":5869321,"size":4487840185,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:76310ddb8b67cebfc73909b4924849945bc7f381&amp;dn=The+Vampire+Diaries+S02D01+Pioen+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":28,"time":1286397750,"description":"The Vampire Diaries S02D01\n\nVier maanden nadat een tragisch auto-ongeluk een einde aan het leven van hun ouders maakte, proberen de 17-jarige Elena Gilbert (Nina Dobrev) en haar 15-jarige broer Jeremy (Steven R. McQueen) hun leven weer op te pakken. Ze wonen nu bij hun tante Jenna (Sara Canning) die er het beste van probeert te maken.\n\nAls het schooljaar begint, zijn Elena en haar vrienden gefascineerd door de nieuwe mysterieuze student Stefan Salvatore (Paul Wesley). Stefan en Elena voelen zich meteen tot elkaar aangetrokken. Wat ze niet weet is dat Stefan een vampier is.\n\nIn en rond Mystic Falls worden verschillende mensen dood aangetroffen na een aanval van een wild beest. Stefan weet dat dit niet waar is. Als hij thuis komt treft hij zijn oudere broer Damon (Ian Somerhalder) aan die hij al jaren niet heeft gezien. Ze hebben een hekel aan elkaar, en Stefan heeft het vooral in het begin druk met Damon's gemanipuleer en moorddadige buien. Hij probeert te voorkomen dat zijn broer de bewoners van Mystic Falls kwaad doet, maar slaagt hier niet altijd in. Belangrijke rollen zijn weggelegd voor Elena's schoolvrienden Bonnie (Katerina Graham), Caroline (Candice Accola), Matt (Zach Roerig) en Tyler (Michael Trevino).\n\nNa een poosje komt Elena te weten dat Stefan en Damon vampiers zijn. Stefan en Elena krijgen een relatie, maar ondertussen blijven de moorden maar doorgaan. Meer vampiers duiken op in de omgeving, en ook de legenden over heksen en weerwolven blijken waarheid te bevatten. Later in het verhaal blijkt Elena geadopteerd te zijn. Dit brengt een hoop onrust en vragen. Ze probeert te ontdekken wie haar echte ouders zijn en waarom ze geadopteerd is.\n\nIntussen lijkt Damon toch menselijke trekjes te hebben en raken hij en Elena bevriend. Het blijkt dat Elena precies lijkt op de vampier Katherine (een dubbelrol voor Nina Dobrev), de vroegere geliefde van zowel Stefan als Damon. Deze kwaadaardige vrouw is de belangrijkste reden van de concurrentie tussen de broers. Elena is een heel ander type dan Katherine. Terwijl Elena steeds meer ontdekt over het verleden van de broers, geeft Damon blijk van zijn gevoelens voor Elena.\n       \n\n \n  As the school year begins, Elena Gilbert is immediately drawn to a handsome and mysterious new student, Stefan Salvatore. Elena has no way of knowing that Stefan is a vampire struggling to live peacefully among humans, while his brother Damon is the embodiment of vampire violence and brutality.\n\nAflevering(en):\n1. The Return\n2. Brave New World\n3. Bad Moon Rising\n4. Memory Lane\n\n\n\n\nMenu: Ja\nBron: 720p HDTV + WEB-DL\nAudio: Engels 5.1DD\nSubs: Nederlands door PinkGaai (Bierdopje.com) \n\nBedankt PinkGaai voor de vertaling\nen Darkling voor het maken van deze geweldige DVD.\n\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : TV\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nFantasiefilm\nTV Shows/Series\n \nWeblink : &lt;a href=&quot; http://www.cwtv.com/shows/the-vampire-diaries&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.cwtv.com/shows/the-vampire-diaries&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.thevampirediaries.nl/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.thevampirediaries.nl/&lt;/a&gt; \nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt1405406/episodes#season-2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1405406/episodes#season-2&lt;/a&gt;\n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons Forum \n                &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;  \n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live\n \n \n \n","torrent":{"xt":"urn:btih:76310ddb8b67cebfc73909b4924849945bc7f381","amp;dn":"The+Vampire+Diaries+S02D01+Pioen+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76310ddb8b67cebfc73909b4924849945bc7f381","infoHashBuffer":{"type":"Buffer","data":[118,49,13,219,139,103,206,191,199,57,9,180,146,72,73,148,91,199,243,129]},"announce":[],"urlList":[]}}