{"title":"Electric Light Orchestra Discography","uid":5841981,"size":6914638163,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7643977c94963c3606e9cec6f9c15e006f8f2f51&amp;dn=Electric+Light+Orchestra+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ddawg","files":429,"time":1285003738,"description":"Artist: Electric Light Orchestra\nGenre: Rock\nQuality: Lossless\nFormat: flac\n\n\nElectric Light Orchestra Discography:\n\n[1971] No Answer\n[1973] ELO 2\n[1973] On the Third Day\n[1974] Eldorado\n[1975] Face the Music\n[1976] A New World Record\n[1977] Out of the Blue (30th Anniversary Edition)\n[1979] Discovery\n[1981] Time\n[1983] Secret Messages\n[1986] Balance of Power\n[2001] Zoom\n\n\nCompliations\n\n[1990] ELO Classics\n[1992] Definitive Collection\n[2000] Flashback\n\n\nVideo Included:\n\nShowdown.mpg\n\n\nAllmusic Biography:\n\nFormed October 1970 in Birmingham, England\nDisbanded 1988 \n \nThe Electric Light Orchestra's ambitious yet irresistible fusion of Beatlesque pop, classical arrangements, and futuristic iconography rocketed the group to massive commercial success throughout the 1970s. ELO was formed in Birmingham, England in the autumn of 1970 from the ashes of the eccentric art-pop combo the Move, reuniting frontman Roy Wood with guitarist/composer Jeff Lynne, bassist Rick Price, and drummer Bev Bevan. Announcing their intentions to &quot;pick up where 'I Am the Walrus' left off,&quot; the quartet sought to embellish their engagingly melodic rock with classical flourishes, tapping French horn player Bill Hunt and violinist Steve Woolam to record their self-titled debut LP (issued as No Answer in the U.S.). In the months between the sessions for the album and its eventual release, the Move embarked on their farewell tour, with Woolam exiting the ELO lineup prior to the enlistment of violinist Wilf Gibson, bassist Richard Tandy, and cellists Andy Craig and Hugh McDowell; despite the lengthy delay, Electric Light Orchestra sold strongly, buoyed by the success of the U.K. Top Ten hit &quot;10538 Overture.&quot;\n\nHowever, Wood soon left ELO to form Wizzard, taking Hunt and McDowell with him; Price and Craig were soon out as well, and with the additions of bassist Michael D'Albuquerque, keyboardist Richard Tandy, and cellists Mike Edwards and Colin Walker, Lynne assumed vocal duties, with his Lennonesque tenor proving the ideal complement to his increasingly sophisticated melodies. With 1973's ELO II, the group returned to the Top Ten with their grandiose cover of the Chuck Berry chestnut &quot;Roll Over Beethoven&quot;; the record was also their first American hit, with 1974's Eldorado yielding their first U.S. Top Ten, the lovely &quot;Can't Get It Out of My Head.&quot; Despite Electric Light Orchestra's commercial success, the band remained relatively faceless; the lineup changed constantly, with sole mainstays Lynne and Bevan preferring to let their elaborate stage shows and omnipresent spaceship imagery instead serve as the group's public persona. 1975's Face the Music went gold, generating the hits &quot;Evil Woman&quot; and &quot;Strange Magic,&quot; while the follow-up, A New World Record, sold five million copies internationally thanks to standouts like &quot;Telephone Line&quot; and &quot;Livin' Thing.&quot; \n\nThe platinum-selling double-LP, Out of the Blue, appeared in 1977, although the record's success was tempered somewhat by a lawsuit filed by Electric Light Orchestra against their former distributor, United Artists, whom the band charged flooded the market with defective copies of the album. Columbia distributed the remainder of the group's output, issued through their own Jet Records imprint, beginning with 1979's Discovery, which notched the Top Ten entries &quot;Shine a Little Love&quot; and &quot;Don't Bring Me Down.&quot; In the wake of ELO's best-selling Greatest Hits compilation, Lynne wrote several songs for the soundtrack of the Olivia Newton-John film Xanadu, including the hit title track. The next proper Electric Light Orchestra album, 1981's Time, generated their final Top Ten hit, &quot;Hold on Tight.&quot; Following 1983's Secret Messages, Bevan left the group to join Black Sabbath, although he returned to the fold for 1986's Balance of Power, which despite the presence of the Top 20 hit &quot;Calling America&quot; received little interest from fans and media alike. \n\nHowever, as Electric Light Orchestra's career descended, Lynne emerged as a sought-after producer, helming well-received comebacks from George Harrison (1987's Cloud Nine) and Roy Orbison (1989's Mystery Girl) and additionally re-teaming with both rock legends as well as Bob Dylan and Tom Petty in the hit supergroup the Traveling Wilburys. Lynne made his solo debut in 1990 with Armchair Theatre but otherwise spent the decade out of the limelight, instead producing material for Joe Cocker, Tom Jones, and Paul McCartney in addition to working on the Beatles' Anthology project. In 1988, meanwhile, Bevan formed Electric Light Orchestra Part II with vocalist Neil Lockwood, keyboardist Eric Troyer, and bassist Pete Haycock; although Lynne filed suit against the group (hence the &quot;Part II&quot; tag), a self-titled LP followed in 1991, with a live collection recorded with the Moscow Symphony Orchestra appearing a year later. Outside of 1994's Moment of Truth, subsequent ELO II releases have been live efforts as well. \n \n\n","torrent":{"xt":"urn:btih:7643977c94963c3606e9cec6f9c15e006f8f2f51","amp;dn":"Electric+Light+Orchestra+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7643977c94963c3606e9cec6f9c15e006f8f2f51","infoHashBuffer":{"type":"Buffer","data":[118,67,151,124,148,150,60,54,6,233,206,198,249,193,94,0,111,143,47,81]},"announce":[],"urlList":[]}}