{"title":"Ok Go - A Million Ways  (2nafish)","uid":5719434,"size":129038340,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:76566dedc589e2bbc5a265955718c05e0019f4d3&amp;dn=Ok+Go+-+A+Million+Ways++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280235856,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;A Million Ways&quot; is a song by rock band OK Go from their album Oh No. It was the first song from the album to be released as a single and became the band's breakthrough song thanks to the internet sensation that was the accompanying music video.\n\nThe b-side &quot;This Will Be Our Year&quot; is a cover version of the 1968 song by The Zombies from their album Odessey and Oracle and was previously released on the 2004 compilation album Future Soundtrack for America. &quot;The Lovecats&quot;, a cover of The Cure's hit single was previously released on the band's previous EP and would later be released for a third time on the single for &quot;Here It Goes Again.&quot; &quot;Down for the Count&quot; was previously unreleased and has since been released as a digital single on iTunes in 2007.\n\nThe song appeared as a playable track in the game Band Hero.\n\nA low-budget, homemade music video for the song was made in April or May 2005 showing the band in Damian Kulash's backyard, performing a dance routine choreographed by Kulash's sister, Trish Sie. The song's vocals are lip-synced in the video by bassist Tim Nordwind  instead of Damian, following the format from the dance choreographed for the song &quot;C-C-C-Cinnamon Lips&quot;, which Tim sings. The footage was not intended to be released as the single's music video, but it was sent via e-mail to friends of the band and spread around the internet becoming an internet sensation. It premiered on Fuse on August 18, 2005.\n\nOn July 18, 2006, OK Go unveiled &quot;The OK Go Dances With You(tube) Contest&quot; in which contestants submitted their pastiches of the video onThe winners would dance live with the band at one of their concerts. The contest ended on August 31, 2006. A compilation of these submissions was added on the DVD for the Deluxe Edition of Oh No.\n\nThe routine has been performed by the band on many occasions. They performed it on Mad TV and Soccer AM. They also performed the number in Paris, France to promote their French website.\n\nOh No is the second studio album by Chicago rock band OK Go. It was released 30 August 2005. The album was recorded in late 2004 with producer Tore Johansson in MalmÃƒÆ’Ã‚Â¶, Sweden. It is the final album to feature guitarist Andy Duncan, who left shortly after recording finished.\n\nAs of January 12, 2007, the album has sold 198,045 units.\n\nAfter the band's performance at the 2006 MTV Video Music Awards, their album moved up to #2 on the iTunes Music Store album sales charts (as of September 3, 2006). Their album sold 8,250 units in the following week, a 95% increase over the prior week, rocketing from #87 to #69 on the Billboard 200 albums chart, the highest position ever achieved by any OK Go album until the release of &quot;Of the Blue Colour of the Sky&quot; five years later.\n\nOn November 7, 2006, OK Go released a deluxe limited edition CD/DVD of the album. The DVD contains their videos (dancing and playing instruments), a video from 180 fans doing the &quot;A Million Ways&quot; dance for acontest, previously unseen footage, and a behind-the-scenes look of their treadmill rehearsals for the video and for the VMA's.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:76566dedc589e2bbc5a265955718c05e0019f4d3","amp;dn":"Ok+Go+-+A+Million+Ways++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76566dedc589e2bbc5a265955718c05e0019f4d3","infoHashBuffer":{"type":"Buffer","data":[118,86,109,237,197,137,226,187,197,162,101,149,87,24,192,94,0,25,244,211]},"announce":[],"urlList":[]}}