{"title":"Mostar Sevdah Reunion (1999) [FLACimg+CUE] ","uid":5848237,"size":368933153,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7868fd62b8a9d9d308883a50c2bb6c7ab2d70e90&amp;dn=Mostar+Sevdah+Reunion+%281999%29+%5BFLACimg%2BCUE%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1285280224,"description":"Mostar Sevdah Reunion - Mostar Sevdah Reunion\nLabel: World Connection\nCatalog#: WC43011\nFormat: FLAC img + CUE\nCountry: Bosnia Herzegovina /Netherlands\nReleased: 1999\nGenre: Balkan, Gypsy, Folk, World, Sevdalinka\n\nTracklist\n1 \t  \tAsik Osta' Na Te Oci \t\t\n2 \t  \tMujo Kuje Konje Po Mjesecu \t\t\n3 \t  \tMostarski Ducani \t\t\n4 \t  \tU Stambolu Na Bosforu \t\t\n5 \t  \tDul Zulejha \t\t\n6 \t  \tMoj Dilbere (w. Esma Redzepova)\n7 \t  \tKradem Ti Se U Veceri \t\t\n8 \t  \tU Lijepom Starom Gradu Visegradu \t\t\n9 \t  \tSnijeg Pade Na Behar Na Voce \t\t\n10 \t  \tPsenicica Sitno Sjeme (w. Esma Redzepova)\t\n11 \t  \tDaurko Mila \t\t\n\nCredits: Producer - Dragi Sestic\n\nHomepage: www.mostarsevdahreunion.com\n\n\n\nBBC documentary (6 parts - lowfi!): \n &lt;a href=&quot;\nhttp://pastebay.com/105383&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pastebay.com/105383&lt;/a&gt;\n\n\nBBC documentary (decent avi) + MP3 discography: \n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4074651&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4074651&lt;/a&gt;\n\n\nReviews:\n\n..This is a fascinating album , half meditative, half danceable, with excellent musicianship and remarkably coherent as an artistic work...I can not recommend it too much: this is one helluva monster sevdah reunion ! (Don Weeda / Roots World Magazine)\n\n...A jewel from a war-torn land (Andrew Cronshaw/Folk Roots Magazine)\n\n...This is a fantastic introduction to a music far too little known outside its homeland (Kim Burton/ Songlines Magazine)\n\n...Powerful, energetic, exciting , fantastic album (Le Monde /France)\n\n... ***** (5 stars) Pure Masterpiece! (Zlatko Gall/Feral Tribune / Croatia)\n\n\nStory (from http://worldmusic.nationalgeographic.com/view/page.basic/artist/content.artist/mostar_sevdah_reunion_45677 ):\n\nThe idea of forming Mostar Sevdah Reunion started in the summer of 1993, during the worst war destruction of Mostar. Dragi Sestic was working as a music editor at the local &quot;war radio station&quot; in Mostar. One evening he visited one of many candlelit concerts, which were performed for a small audience trying just for a moment to forget the war. For the first time in his life he saw and heard Ilijaz Delic, who had spent most of his career and life in Belgrade performing in the most famous bars and restaurants of the city.\n\nAmazed by Delic's interpretation of sevdalinkas (traditional Bosnian songs), Sestic made contact with him and went back to the radio station to share his impressions with a friend, journalist Faruk Kajtaz. A few days later, Delic came to the radio station to perform some songs for the program (in those days his accordion player was Elmedin Balalic). After that concert, Sestic and Kajtaz, impressed by Ilijaz's singing, had a pretty crazy idea for those days: to make a big world star of Ilijaz.\n\nIn October 1993, Sestic recorded one audiotape with Ilijaz, Biseri Sevdaha (The Pearls of Sevdah), which was released in limited edition because of war circumstances. One month later, in November 1993, Mustafa Santic, a great friend of Ilijaz, came to the radio station. There he met Sestic and Kajtaz. Mustafa was already known as a big virtuoso on the accordion and the clarinet. After their performance of sevdah, the fundamental basis of the future band was clear: the fantastic vocal of Ilijaz Delic and the virtuosity of Mustafa Santic.\n\nAfter the end of the war in Mostar, Sestic went to the Netherlands. Slowly, the idea of a band of world-class quality performing traditional Bosnian music was frozen. Everybody was busy with his own life and career. A few years later, in September 1998, Sestic returned to Mostar for a holiday, bringing some of the recent CDs of the world music to his friend Kajtaz. After listening to those CDs, they concluded that it was time to renew the idea of starting a band with the name &quot;Mostar Sevdah Reunion&quot;.\n\nThey met very supportive people in the Music Center Pavarotti, who had a great sense for sevdah music: David Wilson, the director of the center and one of the establishers of the &quot;War Child&quot; organization, and Eugene Skeef, great percussionist and in those days a musical therapist and also a man who gave strong support and spiritual power to the whole idea.\n\nSenad Trnovac, excellent rock-jazz drummer from Mostar, joined the band, and they made the first demo tracks. Because of the connections of the Music Center Pavarotti with world music stars, somehow those demo tracks ended up in the hands of the famous producer Brian Eno, one of the donors and coordinators of the whole project in Mostar connected with &quot;War Child.&quot; Sometime at the end of October 1998, Eno came to Mostar to visit the music center and he had a meeting with Sestic and Kajtaz.\n\nAfter a few hours of &quot;inspiring&quot; conversation with Eno, Sestic and Kajtaz knew that they were on the right musical track. Eno left them with the promise that he would do as much as possible to help release the CD. After a few months of waiting, Sestic and Kajtaz decided to finish all of the material for the CD. They went back to the studio in January 1999, but with four more musicians: Amir Karahasanovic (guitar), Miralem Basic and Adnan Zimic (bassprim), and Kosta Latinovic (berde bass).\n\nWith completed material, Sestic went back to the Netherlands to search for a publisher and record company. After making many contacts, he chose Dutch record label World Connection, which supported the new recording budget. Sestic then invited Miso Petrovic and Sandi Durakovic, a virtuoso guitar duo from Mostar that was living in the Netherlands, and Branko Petkovic, a famous violin player from Sarajevo to join the band. World Connection sent Esma Redzepova, &quot;The Queen of the Gypsies,&quot; as a special guest to perform two songs on the CD.\n\nThe final material was recorded in July 1999 in the studio of Music Center Pavarotti in Mostar, under the direction of Dragi Sestic and Faruk Kajtaz. The CD was released in October 1999. The dream of a summer war night became a reality!\n","torrent":{"xt":"urn:btih:7868fd62b8a9d9d308883a50c2bb6c7ab2d70e90","amp;dn":"Mostar+Sevdah+Reunion+%281999%29+%5BFLACimg%2BCUE%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7868fd62b8a9d9d308883a50c2bb6c7ab2d70e90","infoHashBuffer":{"type":"Buffer","data":[120,104,253,98,184,169,217,211,8,136,58,80,194,187,108,122,178,215,14,144]},"announce":[],"urlList":[]}}