{"title":"The Libarian 3 - The curse of the Judas(2006)-DivX-NL-subs 2Lion","uid":5903919,"size":583041150,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7871774348c070f0be7ef0e0cfa004de8ab6d76a&amp;dn=The+Libarian+3+-+The+curse+of+the+Judas%282006%29-DivX-NL-subs+2Lion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"larsisgoed9","files":-1,"time":1287777246,"description":"The Librarian 3 - The curse of the Judas\n\nVerenigde Staten\nActie &amp; avontuur\n90 minuten\n\nGeregisseerd door Jonathan Frakes.\nMet: Noah Wyle, Bruce Davison, Stana Katic, Bob Newhart &amp; Jane Curtin.\n\nNederlands:\nNadat de Philosofische steen bij een veiling is gekocht, maar zijn vriendin hem is \nverlaten, heeft de bibliothecaris Flynn Carsen een breakdwon. Charlene en Judson \nvragen hem om een vakantie te nemen. Flynn reist naar New Orleans en hij word verliefd \nop een Franse zanger (Simone Renoir). Maar ze vertelt dat ze de bewaker is van een sleutel \ntot de Judas Kelk, die in staat is om vampiers te herrijzen.\nInmiddels is de voormalige Russische minister van Defensie Sergei Kubichek op zoek \nnaar de kelk om Vlad op te baren. De vampier met de steun van professor Lazlo. Ook om \neen leger van ondoden te verhogen en Rusland terug te brengen naar de top van de wereld. \nToen Simone onthulde dat zij een vampier was, vroeg Flynn zich af of ze hem niet gebruikt \nom de kelk en het bereik van haar macht te vergroten.\n\n\nEngels:\nAfter retrieving the philosophical stone at an auction but losing his girlfriend, \nthe librarian Flynn Carsen has a breakdown. Charlene and Judson ask him to spend \nsome time on vacation. Flynn travels to New Orleans and he has a crush on a French \nsinger (Simone Renoir). However she discloses that she is the guardian of a key to \naccess the Judas Chalice that is capable to resurrect vampires. Meanwhile the former \nRussian Minister of Defense Sergei Kubichek is seeking the chalice to revive Vlad \nthe vampire with the support of Professor Lazlo. Also to raise an army of undead \nto bring Russia back to the top of the world. When Simone reveals that she is a \nvampire, Flynn question whether she is not using him to reach the chalice and \nincrease her power.\n\nPostinformatie:\nCategorie:\tBeeld\nFormaat:\tDivX\nBron:\t\tDVD\nOndertitels:\tNederlands\nGeluid:\t\tEngels\nMenu:\t\tNee\nCover:\t\tJa\nLabel:\t\tJa\nExtra's:\tNee\nGenre:\t\tActie &amp; avontuur","torrent":{"xt":"urn:btih:7871774348c070f0be7ef0e0cfa004de8ab6d76a","amp;dn":"The+Libarian+3+-+The+curse+of+the+Judas%282006%29-DivX-NL-subs+2Lion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7871774348c070f0be7ef0e0cfa004de8ab6d76a","infoHashBuffer":{"type":"Buffer","data":[120,113,119,67,72,192,112,240,190,126,240,224,207,160,4,222,138,182,215,106]},"announce":[],"urlList":[]}}