{"title":"The Vampire Diaries (Retail) First Season (2010)(1-5) (subs 6)2L","uid":5863526,"size":4704030127,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:78eabd5095a445e8e67e5d458d635bb847485757&amp;dn=The+Vampire+Diaries+%28Retail%29+First+Season+%282010%29%281-5%29+%28subs+6%292L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Pioen","files":-1,"time":1286058927,"description":"The Vampire Diaries: The Complete First Season (2010)(1-5)      \n   \n \n  \n\n\n\n\nBeschrijving\nThe Vampire Diaries is het verhaal van Salvatore en Damon, twee broers die ten tijde van de Italiaanse renaissance verliefd waren op dezelfde vrouw. Ze vonden de dood in een zwaardduel, maar ontwaakten daarna als vampiers. Eeuwenlang bestreden ze elkaar. Nu zijn ze opnieuw verliefd op hetzelfde meisje, deze keer op het aantrekkelijke tienermeisje Elena, van Robert E. Lee High School. Is Elena sterk genoeg om zich staande te houden in hun allesvernietigende vete? \n\n\nRecensie(s)\nNBD|Biblion recensie\nIn de gebundelde eerste twee delen van de vierdelige serie vampierdagboeken onder de titel 'The vampire diaries' van de bekende Californische schrijfster van jeugd- en kinderboeken is Elena de gelukkige. Ze is het uitverkoren meisje dat door twee vampierbroers, Stefan en Damon, wordt aanbeden. Aanvankelijk weet ze niet dat Stefan die bij haar op highschool zit, een vampier is. Dat hij haar afwijst, wil ze niet accepteren en daarom verleidt ze hem. Zijn broer Damon is de demonische uitgave die Stefan achtervolgt en al eeuwenlang met hem duelleert vanwege een vrouw in de Italiaanse renaissance. Elena lijkt op haar. De geschiedenis wordt steeds herhaald; de broers zijn namelijk onsterfelijk en kunnen door magische krachten ook transformeren in een valk en een kraai, die elkaar op leven en dood bevechten en bv. een hond, maar ook mensen vermoorden. Na een spannend eind zal het verhaal in het derde deel een vervolg krijgen. Een bloeddorstig, maar goed boek, passend in de huidige vampier-hype. 'The vampire diaries' zijn inmiddels als televisieserie verfilmd*; ook is de auteur begonnen met een spin-off: een trilogie met Damon in de hoofdrol. Paperback, kleine druk, filmfoto op het omslag. Vanaf ca. 14 jaar.\n\n\nEnglish\n\nStoryline\nThe vampire brothers Damon and Stefano Salvatore, eternal adolescents, having been leading 'normal' lives, hiding their bloodthirsty condition, for centuries, moving on before their non-aging is noticed. They are back in the Virginia town where they became vampires, as high school students. Stefano is noble, denying himself blood to avoid killing, and tries to control his evil brother Damon. Stefan falls in love with schoolgirl Elena, whose best friend is a witch, like her grandma. Written \n\n\n\nOok te vinden in: a.b.b4e\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \n\n\nDvD Inf0:\n\n\nDVD-Source: Retail DVD9\nASPECT &amp; STANDARD: 1.78:1 - PAL - Macrovision Free\nAUDIO: Enlish 5.1DD\nSUBTITLES: English, Danish, Finnish, Norwegia, Swedish, Dutch\nViDEO: Re-Encoded @ [6] passes\n\nMENU: Untouched\n\nDVD-EXTRAS: Untouched\n\n \nGenre : Fantasiefilm\nHorror\nThriller\n\nyoutube.com/watch?v=olDWd-CnxO8\n \nWeblink : &lt;a href=&quot; http://www.bol.com/nl/p/nederlandse-boeken/the-vampire-diaries/1001004008257703/index.html#product_description&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.bol.com/nl/p/nederlandse-boeken/the-vampire-diaries/1001004008257703/index.html#product_description&lt;/a&gt; \nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt1405406/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1405406/&lt;/a&gt;\n \n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons Forum \n              &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;  \n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live\n      \n \n \n \n","torrent":{"xt":"urn:btih:78eabd5095a445e8e67e5d458d635bb847485757","amp;dn":"The+Vampire+Diaries+%28Retail%29+First+Season+%282010%29%281-5%29+%28subs+6%292L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78eabd5095a445e8e67e5d458d635bb847485757","infoHashBuffer":{"type":"Buffer","data":[120,234,189,80,149,164,69,232,230,126,93,69,141,99,91,184,71,72,87,87]},"announce":[],"urlList":[]}}