{"title":"Australia","uid":5856189,"size":1557615633,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7968cd661e430712143aef1e831a368feeff4d9f&amp;dn=Australia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mcb11_gr1","files":2,"time":1285625308,"description":"In northern Australia at the beginning of World War II, an English aristocrat inherits a cattle station the size of Maryland. When English cattle barons plot to take her land, she reluctantly joins forces with a rough-hewn stock-man to drive 2,000 head of cattle across hundreds of miles of the country's most unforgiving land, only to still face the bombing of Darwin, Australia, by the Japanese forces that had attacked Pearl Harbor only months earlier.\n\nIn 1939, the aristocratic Lady Sarah Ashley travels from Great Britain to Australia to meet her husband Maitland Ashley in northern Australia. The husband's drover comes to the city of Darwin to bring Sarah to their farm; however, when they reach Faraway Downs Farm, they find that Maitland was murdered. Sarah befriends Nullah, who tells her that the administrator Neil Fletcher is stealing her cattle; has killed her husband; and is working for the cattle baron King Carney. Sarah fires Fletcher and his men and together with Drover, Nullah and a group of loyal employees, they ride together to take the cattle to supply the army and win a tender in times of war. But the ambitious Fletcher has other intentions and uses Nullah to press Sarah. ","torrent":{"xt":"urn:btih:7968cd661e430712143aef1e831a368feeff4d9f","amp;dn":"Australia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7968cd661e430712143aef1e831a368feeff4d9f","infoHashBuffer":{"type":"Buffer","data":[121,104,205,102,30,67,7,18,20,58,239,30,131,26,54,143,238,255,77,159]},"announce":[],"urlList":[]}}