{"title":"Genesis - Turn It On Again (Live) (2nafish)","uid":5736580,"size":157061124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:796ca4a8faa25352fd22b783dea0776a0e4a0d22&amp;dn=Genesis+-+Turn+It+On+Again+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280794029,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n&quot;Turn It on Again&quot; is a single from theprogressive rock band Genesis, from their 1980 album Duke.\n\nThe lyrics deal with a man who does nothing more than watch his television, so much that he becomes obsessed with the people he watches on it, believing them to be his friends.\n\nThe song is also characterised by a rhythmic structure uncharacteristically complex for pop music, with verse/chorus sections in alternating time signatures, 6/4 to 7/4, while the intro and bridge sections are in 4/4 and 5/4.\n\n&quot;Turn It on Again&quot;, has been a favorite in Genesis's live shows. Consequently, the group's 1999 compilation album Turn It on Again: The Hits was named after it, as was the band's 2007 Turn It on Again: The Tour reunion project. The song was featured prominently during the 2007 tour, albeit transposed down a key to account for the deepening of Phil Collins's voice over the years.\n\n&quot;Turn It on Again&quot; has been recently used as background music for a General Motors commercial. It is also used in the game Grand Theft Auto: Vice City Stories. It was also featured in Dream Theater's &quot;Big Medley&quot; on the album A Change of Seasons.\n\nDuke is the tenth studio album byband Genesis, released in March 1980.\n\nThe release of Duke followed solo albums by Genesis members Tony Banks (A Curious Feeling) and Mike Rutherford, (Smallcreep's Day).\n\nPhil Collins, meanwhile, had taken an extended leave of absence of the band in order to try and save his first marriage. During this time he wrote a a number of songs on his own - a first for him. These songs would make up the bulk of his first solo album, Face Value, released in 1981, after the release of Duke. Banks and Rutherford picked two Collins songs, &quot;Please Don't Ask&quot; and Misunderstanding,&quot; for inclusion on the album. Banks claims that they would certainly have selected In the Air Tonight if only Collins had played it for them. Collins, however, maintains that he did play the song for them.\n\nOnce Duke was released, the song &quot;Turn It on Again&quot; became the band's second UK Top 10 hit, while &quot;Misunderstanding&quot; reached the Top 20 in the US.\n\nA digitally remastered version was released on CD in 1994 on Virgin in Europe and Atlantic in the US and Canada. The remastered CD's booklet features all of the original album's artwork and complete lyrics.\n\nAn SACD / DVD double disc set (including new 5.1 and Stereo mixes) was released on 2 April 2007 (although it will be a CD / DVD double disc set for the US and Canada).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:796ca4a8faa25352fd22b783dea0776a0e4a0d22","amp;dn":"Genesis+-+Turn+It+On+Again+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"796ca4a8faa25352fd22b783dea0776a0e4a0d22","infoHashBuffer":{"type":"Buffer","data":[121,108,164,168,250,162,83,82,253,34,183,131,222,160,119,106,14,74,13,34]},"announce":[],"urlList":[]}}