{"title":"AC/DC - That's The Way I Wanna Rock And Roll (2nafish)","uid":5728828,"size":139821060,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7a99a45754fd8cc14172fcc46c07087a986a4621&amp;dn=AC%2FDC+-+That%5C%27s+The+Way+I+Wanna+Rock+And+Roll+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280572765,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;That's the Way I Wanna Rock 'n' Roll&quot; is a song and a single by Australian hard rock band AC/DC. The song appeared on their 1988 album Blow Up Your Video as the second track. A live version of this song can be found on the band's live album, Live: 2 CD Collector's Edition. The b-side of the single was &quot;Borrowed Time&quot;.\n\nIn 2005, the music video, directed by Peter Sinclair, Brian Grant, and Jiff Morrison, was released on Family Jewels. The video included fans carrying red cardboard Gibson SG guitars.\n\nBlow Up Your Video is an album by the Australian hard rock band AC/DC, first released on 18 January 1988. It was later released in the U.S. on February 1, 1988. The album was recorded at the Miraval Studio in Le Val, France in between August and September 1987.\n\nThe album was produced by Harry Vanda and George Young, the production team behind the band's early albums. This was also the final studio album to feature drummer Simon Wright. Although he wrote all the lyrics on the album, it would be the last on which Brian Johnson was credited as a songwriter (all songs on subsequent albums were written by the Young brothers). The title of the album was taken from a line in the song &quot;That's The Way I Wanna Rock 'n' Roll&quot;.\n\nThe album was the band's biggest-selling album of new material since For Those About to Rock We Salute You, being certified Platinum in the US. Blow Up Your Video reached #2 in the UK and #12 in the US. However, the band played four tracks from it on the subsequent world tour, &quot;Heatseeker&quot;, &quot;That's the Way I Wanna Rock 'n' Roll&quot;, &quot;Nick of Time&quot;, and &quot;Go Zone&quot; - &quot;Heatseeker&quot; and &quot;That's The Way I Wanna Rock 'n' Roll&quot; are also featured on AC/DC Live Collector's Edition. &quot;Heatseeker&quot; was a top 20 hit in the United Kingdom. The album was re-released in 2003 as part of the AC/DC remasters series. During the Blow Up Your Video world tour, Malcolm Young decided not to participate in touring, in order to get over an alcohol addiction. Filling in for him was Malcolm and Angus' nephew, Stevie Young, although Malcolm is present in the Blow Up Your Video promotional videos.\n\nOuttakes from the recording sessions include the unreleased songs &quot;Let It Loose&quot; and &quot;Alright Tonight&quot;, as well as other versions of &quot;Heatseeker&quot;, and &quot;That's the Way I Wanna Rock 'n' Roll&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7a99a45754fd8cc14172fcc46c07087a986a4621","amp;dn":"AC%2FDC+-+That%5C%27s+The+Way+I+Wanna+Rock+And+Roll+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a99a45754fd8cc14172fcc46c07087a986a4621","infoHashBuffer":{"type":"Buffer","data":[122,153,164,87,84,253,140,193,65,114,252,196,108,7,8,122,152,106,70,33]},"announce":[],"urlList":[]}}