{"title":"Autosport Magazine UK 09/16/2010","uid":5836825,"size":95125239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b3e4f5ce51a00f8d951e81ad0b2f6cdd2b748aa&amp;dn=Autosport+Magazine+UK+09%2F16%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thorhammer2000","files":-1,"time":1284751145,"description":"NEWS\n10 Hamilton's title fears. Brit admits: Monza error could dent F1 title hopes\n12 Team orders to return. Ferrari escape triggers comeback for team orders\n15 Four-way Renalt scrap. Fight for 2011 F1 seat at Renault intensifies\n17 Heidfeld back at Sauber. Veteran German replaces de la Rosa with immediate effect\n20 BMW close to DTM move. BMW boss Mario Theissen says DTM not too far away\n22 Aston Martin LMP1 is go. British firm commits to prototype project to take fight to Audi and Peugeot\n25 New GP2 racer revealed. Third generation car appears\n27 Pau street track returns. 2011 F3 race for classic track\n28 Raikkonen in Mini link. Finn could rally Mini... or Ford\n\nREPORTS\n30 Italian GP. Alonso wins for Ferrari to reignite championship spark\n42 GP2 Monza. Bird breaks his duck as Maldonado secures crown\n45 GP3 Monza. Gutierrez wraps up title with race-one pole slot\n47 GP Supports. Rast wins Porsche Supercup title; Frijns is final FBMW Europe champion\n49 World of Sport. NASCAR; V8 Supercars; Grand-Am; Argentinian TC2000; Brazilian GT3\n56 WRC Japan. Young charger Ogier overcomes old stager Solberg\n60 LMS Silverstone. Victory for Peugeot in AUTOSPORT 1000Km after rare Audi failure\n\nFEATURES\n64 Revival survival. Full preview to the 13th Goodwood Revival Meeting, at which bike/car legend John Surtees and iconic British marque BRM will be honoured\n\nSPORTS EXTRA\n81 Kristensen for Goodwood. Le Mans legend to make Revival debut\n82 Ginetta Academy. Ginetta Junior drive up for grabs in new initiative\n88 Reports. Brands Hatch HSCC; Silverstone LMS Supports; Blyton British Rallyaoss; Rockingham BARC; Oulton Park MSVR; Mondell Park LMC; Brands Hatch SEMSEC; Cadwell Park CSCC\n\nREGULARS\n100 Photo finish. Derek Bell, Silverstone 1000Km, 1983\n102 Race of my life. Mario Dominguez, Mexico City Champ Car, 2003\n\nOCRd by Acrobat Pro 9.3.4. Links to articles on front cover.","torrent":{"xt":"urn:btih:7b3e4f5ce51a00f8d951e81ad0b2f6cdd2b748aa","amp;dn":"Autosport+Magazine+UK+09%2F16%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b3e4f5ce51a00f8d951e81ad0b2f6cdd2b748aa","infoHashBuffer":{"type":"Buffer","data":[123,62,79,92,229,26,0,248,217,81,232,26,208,178,246,205,210,183,72,170]},"announce":[],"urlList":[]}}