{"title":"Battlestar Galactica","uid":5710528,"size":125979544151,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7b430a989bafccfada3838e15ae6174ef1cf4cab&amp;dn=Battlestar+Galactica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"i83","files":336,"time":1279877652,"description":"========================================================================\n            ___  ____ ___ ___ _    ____ ____ ___ ____ ____ \n            |__] |__|  |   |  |    |___ [__   |  |__| |__/ \n            |__] |  |  |   |  |___ |___ ___]  |  |  | |   \n                                                           \n               ____ ____ _    ____ ____ ___ _ ____ ____ \n               | __ |__| |    |__| |     |  | |    |__| \n               |__] |  | |___ |  | |___  |  | |___ |  | \n\t\t\t   \n                     THE ENTIRE FRAKING COLLECTION\n\t\t\t\t   \n========================================================================\n\nBattlestar Galactica is a science fiction franchise created by Glen A. \nLarson. The franchise began with a 1978 TV show, followed by a sequel TV \nseries, a line of book adaptations, original novels, comic books and \nvideo games. A re imagined miniseries developed by Ronald D. Moore and \nDavid Eick aired in 2003, continuing with a regular television series \naired from 2004 to 2009 and a prequel series, Caprica, which began \nairing in January 2010. \n\nAll of the Battlestar Galactica productions share the same premise: in a \ndistant part of the universe, a civilization of humans lives on a group \nof planets known as the Twelve Colonies, having migrated there from \ntheir ancestral home-world of Kobol. In the past, the Colonies had been \nat war with a cybernetic race known as the Cylons. With the help of a \nhuman traitor named Baltar, the Cylons launch a sudden ambush on the \nColonies, laying waste to the planets and devastating their populations. \nThe few human survivors flee into space aboard any spacecraft they can \nreach. Of the entire Colonial Fleet, only the Battlestar Galactica \nappears to have survived the attack. Under the leadership of \nfamed military leader Commander Adama, the Galactica and its crew take \nup the task of leading the small fugitive fleet of survivors into space \nin search of the fabled thirteenth colony known as Earth. \n\n------------------------------------------------------------------------\n1. VIEWING ORDER\n------------------------------------------------------------------------\n\nAll the video's in this collection have been sequentially numbered to \nallow you to watch the entire series, including all the webisodes and \nmovies in the order the were premiered. Some of the webisodes, and in \nparticular the movie &quot;Razor&quot; take place in the 'past' on the storyline, \nbut are meant to be watched later for the continuity of the plot. The \norder goes as follows: \n\n\t1]\t\tBattlestar Galactica\n\t2]\t\tSeason 1\n\t3]\t\tSeason 2\n\t4]\t\tResistance\n\t5]\t\tSeason 3\n\t6]\t\t*Razor Flashbacks\n\t7]\t\tRazor\n\t8]\t\tRevealed (Special)\t\t\n\t9]\t\tThe Phenomenon (Special)\n\t10]\t\tSeason 4 (Episodes 1-10)\n\t11]\t\tFace of the Enemy\n\t12]\t\t**Top 10 Things You Need to Know\n\t13]\t\tSeason 4.5 (Episodes 11-18)\n\t14]\t\t***The Last Fraking Special\n\t15]\t\tSeries Finale (Season 4, Episode 19 &amp; 20)\n\t16]\t\tThe Plan\n\t17]\t\tCaprica (Pilot)\n\t18]\t\tCaprica Season 1\n\n\t*\t\tOptional; mostly repeated in the Razor feature.\n\t**\t\tOptional; Due to the writers strike, there was a long \n\t\t\tgap in the middle of season 4, this special summarized \n\t\t\teverything that had come before to get viewers back up to \n\t\t\tspeed with the series.\n\t***\t\tOptional; This is a summarization of Re-imagined Series \n\t\t\tbefore watching the final episodes of season 4.\n\n------------------------------------------------------------------------\n2. CONTENTS\n------------------------------------------------------------------------\n\nThe re-imagined Battlestar Galactica contains A LOT of content, spanning \na miniseries, three movies, two tv series (5 total seasons), three short \nfeatures and four specials as well as full soundtracks for each season; \nthis torrent is huge. I've done my best to make sure the files are named \nappropriately and well organized. A lot of the content is compiled from \nseparate torrents, some of it was directly ripped by me, but all of it \nis the highest quality available (most of it is 720p). \n\n\nBATTLESTAR GALACTICA ORIGINAL SOUNDTRACK [320kbps]\nThe music of the reimagined Battlestar Galactica is a body of work \nlargely credited to the composers Bear McCreary and Richard Gibbs. The \nmusic of Battlestar Galactica displays a wide variety of ethnic \ninfluences and intentionally tries not to conform to the &quot;usual&quot; style \nof a science fiction score. \n\n\nBATTLESTAR GALACTICA [HD 720p]\nBattlestar Galactica is a three-hour miniseries written and produced by \nRonald D. Moore and directed by Michael Rymer. It was the first part of \nthe Battlestar Galactica reimagining based on the 1978 Battlestar \nGalactica television series, and served as a backdoor pilot for the 2004 \ntelevision series. The miniseries aired originally on the Sci Fi Channel \nin the United States starting on December 8, 2003. The two parts of the \nminiseries attracted 3.9 and 4.5 million viewers, making the miniseries \nthe third-most-watched program on SyFy ever. \n\n\nTV SERIES (SEASON 1-4) [HD 720p]\nThe story arc of Battlestar Galactica is set in a distant part of the \ngalaxy, where a civilization of humans live on a series of planets known \nas the Twelve Colonies. In the past, the Colonies had been at war with a \ncybernetic race known as the Cylons. With the unwitting help of a human \nnamed Gaius Baltar, the Cylons launch a sudden sneak attack on the \nColonies, laying waste to the planets and devastating their populations. \nThe approximately 50,000 human survivors flee into space aboard any \nspacecraft they can reach. Of all the Colonial Fleet, the eponymous \nBattlestar Galactica appears to be the only military capital ship that \nsurvived the attack. Under the leadership of Colonial Fleet officer \nCommander William &quot;Bill&quot; Adama (Olmos) and President Laura Roslin \n(McDonnell), the Galactica and its crew take up the task of leading the \nsmall fugitive fleet of survivors into space in search of a fabled \nrefuge known as Earth. \n\n\nRESISTANCE [HQ WEB RIP]\nThe first set of webisodes were a series of shorts produced to promote \nthe third season of the show. They filled in some of the events between \nthe second and third seasons and featured some of the main cast. These \nwebisodes were made so as not to reveal what would happen in the \nbeginning of season three. Season 3 was also set up so that missing the \nwebisodes would not leave a viewer confused about the story. \n\n\nRAZOR FLASHBACKS [DVD 480p]\nThe Razor Flashbacks were a series of seven webisodes set during William \nAdama's fighter pilot days during the later stages of the First Cylon \nWar. They were released on the Internet as &quot;webisodes&quot; leading up to \nRazor's release. They are now available on the DVD and Blu-Ray releases \nof Battlestar Galactica: Razor, and some are inserted into the both the \nbroadcast and extended cuts of the movie on the DVD. The installments \nthat did not make the final cut include 1, 2, and the latter half of 7. \n\n\nRAZOR [DVD 480p]\nBattlestar Galactica: Razor is a television movie produced and broadcast \nin the gap between Seasons 3 and 4. Razor is also technically the first \ntwo episodes of Season 4 though it chronicles events on Battlestar \nPegasus in two time periods, both of which are &quot;in the past&quot; with \nrespect to the Season 4 continuity. The &quot;present day&quot; framing scenes are \nset during Lee Adama's command, in the latter half of Season 2, while \n&quot;flashback&quot; scenes depict Helena Cain's command in the period between \nthe Cylon attack and the reunion with Galactica in the second season \nepisode Pegasus. Also during the extended episode the Razor Flashbacks, \nwhich were previously released as webisodes, were integrated into the \nmovie but only some were inserted into the shortened television cut. It \naired in the United States and Canada on November 24 and in Britain and \nIreland on December 18, 2007. An expanded version of the movie was \nreleased on DVD on December 4, 2007. \n\n\nREVEALED [HD 720p]\nThe special summarizes the previous 3 seasons stories and character \nrelationships for uninitiated viewers, hosted by producers David Eick \nand Ron Moore. \n\n\nTHE PHENOMENON [HD 720p]\nThe special includes interviews with celebrities about Battlestar \nGalactica's impact on pop culture \n\n\nFACE OF THE ENEMY [HQ WEB RIP]\nIn late May 2008, a set of 10 webisodes were announced to be in the \nworks which were released during the 7 month hiatus between episodes 10 \nand 11 of season 4. The web series premiered on December 12, 2008 on \nSciFi.com. The webisodes are also available to view on Hulu.com, the \niTunes Store and on DirecTV's OnDemand service. \n\n\nTOP 10 THINGS YOU NEED TO KNOW [DVD 480p]\nSci Fi Channel aired a special program, Battlestar Galactica: The Top 10 \nThings You Need to Know, as a lead-in to the start of the final episodes \nof the Re-imagined Series. It was first broadcast on Sunday, January 11, \n2009. Ron D. Moore and David Eick appear in this special program as they \nsummarized ten items to know about the Re-imagined Series before \nwatching the final episodes of season 4. The team elaborated on each of \nthe ten points with the aid of clips from the series. \n\n\nTHE LAST FRAKING SPECIAL [DVD 480p]\nThe last special for the series before the finale. \n\n\nTHE PLAN [HD 720p]\nOn August 7, 2008 Sci Fi Channel officially announced the production of \na two-hour TV movie which was originally supposed to air after the final \nepisode of Season 4. The movie began production on September 8, 2008. \nThe movie premiered exclusively on DVD, Blu-ray and digital download on \nOctober 27, 2009 and aired on January 10, 2010, on Sci Fi. Written by \nJane Espenson and directed by Edward James Olmos, The Plan storyline \nbegins before the attack on the 12 colonies and shows events mainly from \nthe perspective of two Cylons, Cavil and Anders. Tricia Helfer states \nthat the disappearance of Shelly Godfrey in &quot;Six Degrees of Separation&quot; \nwill be explained. Scenes including Aaron Doral preparing for the \nsuicide bombing seen in &quot;Litmus&quot;, Anders awakening in a Cylon \nresurrection chamber, and Cavil berating Boomer for failing to kill \nWilliam Adama in &quot;Kobol's Last Gleaming&quot; appeared on IGN.com prior to \nthe release of the film. In addition to Shelly Godfrey, there is a \ndark-haired Six called &quot;Tough Six&quot; in the script. A sneak peek was made \navailable by SciFi on June 12, 2009, showing Cavil and Ellen Tigh during \nthe events of &quot;33&quot;. Cast members include Edward James Olmos, Michael \nTrucco, Aaron Douglas and Dean Stockwell. All the actors playing Cylons \nwere present in the movie, except Lucy Lawless. Tricia Helfer, Grace \nPark, Rick Worthy, Matthew Bennett, Callum Keith Rennie, Michael Hogan \nand Rekha Sharma are all featured. \n\n\nCAPRICA [HD 720p]\nCaprica is a television series that premiered on Syfy (formerly Sci-Fi) \non January 22, 2010, and is described as &quot;television's first science \nfiction family saga&quot;. It was originally a two-hour back door pilot for a \npossible weekly television series, but on December 2, 2008, SyFy gave \nthe go-ahead to expand the project into a full, 20-episode series. \nCaprica is set on the fictional planet Caprica around fifty years before \nthe events depicted in the 2004 reimagined series. The show will revolve \naround two families, the Adamas and the Graystones, the building of the \nCylons, and the beginnings of the first Cylon War. \n\n\n\n\n\nSO SAY WE ALL!","torrent":{"xt":"urn:btih:7b430a989bafccfada3838e15ae6174ef1cf4cab","amp;dn":"Battlestar+Galactica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b430a989bafccfada3838e15ae6174ef1cf4cab","infoHashBuffer":{"type":"Buffer","data":[123,67,10,152,155,175,204,250,218,56,56,225,90,230,23,78,241,207,76,171]},"announce":[],"urlList":[]}}