{"title":"N.E.R.D. feat. Nelly Furtado - Hot-n-Fun (2nafish)","uid":5727139,"size":166901764,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7c08b399ded25f37ae3fd03d3dec02640d2e4d67&amp;dn=N.E.R.D.+feat.+Nelly+Furtado+-+Hot-n-Fun+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1280497830,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no extra logos or titles.\n\n\nN.E.R.D (No-one Ever Really Dies) (stylized as N*E*R*D) is an American rock, funk and hip hop band. Pharrell Williams and Chad Hugo were signed by Teddy Riley to Virgin Records as a duo, The Neptunes. After producing songs for several artists throughout the late 1990s and early 2000s, the production duo formed the band with Shay Haley as a side project of The Neptunes in 2001. N.E.R.D's debut album, In Search Of..., sold 603,000 copies in the United States and was certified Gold by the Recording Industry Association of America (RIAA). It was also awarded the second annual Shortlist Music Prize. The band's second album, Fly or Die, sold 412,000 copies in the United States and was certified Gold by the RIAA.\n\nIn 2005, N.E.R.D ended their contract with Virgin and disbanded. Three years later, the band reunited under Star Trak Entertainment, a subsidiary of Interscope Records established by Williams and Hugo. The band's third album, Seeing Sounds, sold 80,000 copies in its first week.\n\nIn 2010, N.E.R.D announced the release of their fourth studio album entitled Nothing, which will be released on September 7, 2010. The first single from the album, &quot;Hot-n-Fun&quot; featuring Canadian recording artist Nelly Furtado, was released on May 18th, 2010 to iTunes.\n\nThe band's sound generally contains elements of rock, funk and hip hop, while also encompassing R&amp;B and pop. Though the band rarely samples from other songs, the European release of their debut album, In Search Of..., relied heavily on sampling. They have been praised for their heavy use of electronic, bass and funk beats, while others have suggested that The Neptunes are unable to blend R&amp;B and rock.\n\nN.E.R.D's lyrics have been criticized. Ian Cohen of Pitchfork Media called the band's writing ability &quot;far down the list of what N.E.R.D is actually good at&quot;, where Williams is often criticized for being excessively sexual. With the release of Fly or Die, the album was advertised in Kerrang! magazine, which made Alexis Petridis of The Guardian feel that N.E.R.D's lyrics tried to &quot;empathize with the alienated teenagers who make up Kerrang!'s readership&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7c08b399ded25f37ae3fd03d3dec02640d2e4d67","amp;dn":"N.E.R.D.+feat.+Nelly+Furtado+-+Hot-n-Fun+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c08b399ded25f37ae3fd03d3dec02640d2e4d67","infoHashBuffer":{"type":"Buffer","data":[124,8,179,153,222,210,95,55,174,63,208,61,61,236,2,100,13,46,77,103]},"announce":[],"urlList":[]}}