{"title":"Land of The Dead V1.1 (Play Online) 879 extra online maps","uid":5832127,"size":3469513236,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c6299cf5a9bba3b5c5418fe0a465982822e451f&amp;dn=Land+of+The+Dead+V1.1+%28Play+Online%29+879+extra+online+maps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FuCtUpPuNk","files":5,"time":1284558437,"description":"A QUICK, IMPORTANT MULTIPLAYER NOTE: the master server is normally up but if you catch it at a time that it is down, do not worry because it will be back up shortly after.\n\n\n &lt;a href=&quot;\nhttp://www.landofthedeadmatchmaking.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.landofthedeadmatchmaking.com/&lt;/a&gt;\nabove link contains patches and fixes for the game. so id check it out\n\nLOTD\\'s Single Player Mode:\nstarting off as Jack. you notice a stranger in your front yard. You find it strange the way he is just standing there, so you get a hair\\' to go see what he wants. you find out he\\'s a zombie. so you run upstairs and grab your rifle. now zombies are barging onto your property. you must kill them all.\nIn this mode you go threw the cities, cornfields, sewers, movie theaters, a jail, and many other areas. you must get to fiddlers green AKA the land of the living.\nSingle Player is fun for a few times through but nothing like online\n\nONLINE LOTD:\nthe online play of lotd has so many new things added to it. even a new game type. the new game type is called Last man standing. the other new things that this game has are new weapons, new player skins to play as (including an umbrella corp character from resident evil), new maps/levels to play online, and new zombie types.\n\nZOMBIE DAMAGES/KILLING ZOMBIES:\nBLOW OFF ARMS (blow off one or the other, even both if you like)\nBLOW OFF LEGS (blow off one or the other, even both if you like)\nPOP THE HEADS\nOR DON\\'T BLOW ANYTHING OFF, A SIMPLE CHEST SHOT WILL JUST KILL IT, FULLY INTACT.\n\nFINDING WEAPONS, AMMO, AND HEALTH:\nLOOK IN DRAWERS\nCABINETS\nFRIDGE\nFREEZER\nCHESTS\nLOCKERS\nIN BUILDINGS\nOUTSIDE\nON THE GROUND\nON TOP OF OBJECTS\nAND MANY OTHER PLACES\n\nVIDEOS OF MAPS IVE MADE, showing you new weapons, levels, and player skins\nGraveYardParkthe music is off so utube doesnt disable the sound.\nScaryNightV2 (part 1 vid)yeah my voice clip is actually in the map\nScaryNightV2 (part 2 vid)\ntownofPuNki dont put zombies in most of my deathmatch maps (shows lots of new guns)\nSkateParka Deathmatch map (i made invasion 1 too). not the song i used in the map.\nRocket launcher Test\n\nSOME OF THE NEW WEAPONS ARE:\nak-74\n2 different rocket launchers\nflame thrower\na few different guns with flashlights attached to them (can be turned on, turned brighter, or turned off)\nland mines\ndynamite\ncrossbow\nspiked bat\nmace\ndifferent glock types\nnun-chucks\nninja stars\ntommy gun\ncleaver\nminigun\n2 different chainsaws\ndifferent shotgun types (lots of them)\ndifferent m16\\'s\nhk\nuzi\\'s\nsome gun that has a laser sight on it\ndifferent snipers\ndifferent rifles\nmp5s\n2 types of stryer aug\\'s\nmachete\nswords\nknives\nbrass knuckles\ndifferent types of revolvers\ngrenades\nmolotives\nbaseball bats\nlead pipes\nfire axe\ngold clubs\nother axes\n2 armor suits\nAND SO MUCH MORE GUNS AND MELEE WEAPONS (lots more then i\\'ve mentioned)\n\nTHE MAPS/LEVELS:\nmost people like a zombie game where you can go outside and inside any building, well this game is just that. you can go outside or inside where ever youd like. some of the maps are so huge you can actually get lost in them. there are also maps based off movies and games, such as: land of the dead, day of the dead, 28 days later, dawn of the dead, resident evil, older doom games, etc.\n\nZOMBIE TYPES:\nSCUTTLERS: crawling zombies that kina resemble the grudge or the ring\nSPITTERS/PUKERS: zombies that puke on ya to infect you. temporarily, depending on the game type\nRUNNERS: zombies that run...\nSUPER FAST TURBO CHARGED CRACK ZOMBIES: these zombies run faster then any human player, they seem to be decently strong as well.\nLMS ZOMBIES: these are runners but unlike the other zombies, these one lunge at you with their arms out in front of them.\nLICKERS: from resident evil series (both games and movies)\nSCREAMERS: these zombies dont attack you, they just scream (calling the other zombies to your location).\nMIDGET ZOMBIES: small zombies, really small. can only be killed by a headshot, using a gun that can pop their head.\nETC (might be types im forgetting about)\n\nGAME TYPES:\nINVASION\nAll Players vs the zombies. you run around and kill zombies. try to stay alive till the time runs out. some maps are so big it feels like you\\'re playing in an actual city, maybe even kinda like you\\'re playing left4dead.\n\nCAPTURE THE FLAG\nA team based game where you are on 1 of 2 teams, red or blue. you start in your teams base with your teams flag, you must make it to the other teams base and grab their flag then get back to yours without dying and killing any1 or zombie that gets in your way. if you die the flag is left where u died until 1 of the teams grab it. if the opposing team gets the flag it goes straight to their base but if your team gets it they continue to your base. this game type requires both going for their flag and guarding your own...you need both people leaving and guarding the base at all times\n\nTEAM DEATH MATCH\nteam based game. start off on either red or blue team, kill players from the opposing team while trying not to be killed by the other team or zombies. the first team to get to the set score wins, or the team with the higher points total when the time runs out wins\n\nDEATH MATCH\nEvery player for themselves. kill all the other players as many times as you can and die as few times as you can. gain the highest score and watch out for zombies during the set time. first player to reach the set score or the player with the highest score when the time runs out wins.\n\nINFECTION\nTHIS IS A MODDED GAME TYPE\nthe same thing as invasion but when you get hit by a zombie you keep losing health till you die or till u find an infection kit. not all infection maps have kits though. after death your character gets up (not controlled by you) and is a zombie. you can\\'t controll it at all, ever. you have to wait for the waves end like in regular invasion.\n\nLAST MAN STANDING\nTHIS IS A MODDED GAME TYPE\nLike invasion but with a small twist. when you get hit by a zombie you end up infected and keep loosing health till you die, unless you find an infection kit but not all maps have infection kits. when you die u play as a zombie and try to kill the other players that remain alive. if you die as a zombie, u just re-spawn in another area on the map/level as a zombie and keep going. the point of lms is to try to remain a human and live till the time runs out, if the humans are alive then they win if not the zombies win. the zombies in this are usually fast from what I\\'ve seen.\n\nMY SERVER AND FRIENDS OF MINE SERVERS: (want your server added to this list? PM me)\n** (*uNk //ation $erver **\n** PuNk Nation Server **\nNUK3 TIM3 (PuNk Nation)\n\nCONTACTING ME:\nXFIRE: cfreakdog (xfire.com) it\\'s a messenger just like msn, aim, icq, yahoo, windows live, skype, etc. only more advanced.\nAIM: cfreakdog\n\n\n\n\n\n\nI MADE A README IN THIS TORRENT THAT TELLS YOU HOW TO INSTALL THE GAME\nit also has my contact info if you need help or dont understand something.\n\n\n\nENJOY AND PLEASE HELP ME SEED FOR A WHILE. i like to play online too but i cant do that if im the only person seeding my torrents","torrent":{"xt":"urn:btih:7c6299cf5a9bba3b5c5418fe0a465982822e451f","amp;dn":"Land+of+The+Dead+V1.1+%28Play+Online%29+879+extra+online+maps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c6299cf5a9bba3b5c5418fe0a465982822e451f","infoHashBuffer":{"type":"Buffer","data":[124,98,153,207,90,155,186,59,92,84,24,254,10,70,89,130,130,46,69,31]},"announce":[],"urlList":[]}}