{"title":"Katy Perry feat. Snoop Dogg-California Gurls(Xvid-2nafish)1080p","uid":5726339,"size":180139662,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7c9fa26b69e579eb8c90aaa601a3cf529ad95e55&amp;dn=Katy+Perry+feat.+Snoop+Dogg-California+Gurls%28Xvid-2nafish%291080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1280472564,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:54\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 5816 Kbps\nQuality Factor : 0.10 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nKaty Perry feat. Snoop Dogg - California Gurls (Xvid-2nafish) 1080p\n\nThis video has no logos or titles.\n\n&quot;California Gurls&quot; is an electropop song by American singer-songwriter Katy Perry. It serves as the lead single of her upcoming third studio album, Teenage Dream. The song features rapper Snoop Dogg, and was produced by Dr. Luke, Max Martin, and Benny Blanco. According to Perry, the song is an answer song to &quot;Empire State of Mind&quot;. The song was originally intended to be sent to mainstream and rhythmic  airplay on May 25, 2010. However, after clips from Perry's new album were leaked online, her label released the song to radio on to May 7, 2010, and also began to stream it on her website. It is her second number-one single (on both Billboard's Hot 100 and Hot Dance Airplay charts) in the United States after 2008's &quot;I Kissed a Girl&quot; and Snoop Dogg's third number-one single after 2004's &quot;Drop It Like It's Hot&quot; with Pharrell and 2006's &quot;I Wanna Love You&quot; with Akon. The song has been number one on the Billboard Hot 100 for six consecutive weeks. Outside the United States, the song has reached number one on the Canadian, Australian, Scottish, Irish, British, and New Zealand singles charts.\n\nThe video was directed by Mathew Cullen and was inspired by the work of Will Cotton, who was also the Artistic Director of the video. The video premiered on June 15, 2010. Filming of the video began on May 14, 2010. While being interviewed by MTV, Perry explained why the main idea behind the video had to do with candy, rather than incorporating a beach theme,\n\n    It's definitely something to watch when you have the munchies. ... It's all edible. We named it 'Candyfornia' instead of 'California,' so it's a different world,&quot; she said. &quot;It's not just like, 'Oh, let's go to the beach and throw a party and then shoot a music video!' It's more like, 'Let's put us California Gurls in a whole different world!'\n\nIn the music video, Perry is a game piece in Candyfornia', a game based in poker and board games. The settings are inspired in part by Alice's Adventures in Wonderland, Charlie and the Chocolate Factory, and the board game Candy Land, with much of the set decorated with cupcakes, ice creams, candy floss and lollipops. Snoop Dogg appears in the video as a king that is holding several young women captive throughout the game, using candy related devices to hold them. Katy Perry moves through the land, making discoveries and freeing the women. When all the women are free, Perry leads them in a dance on the beach. Seeing the women freed, &quot;King Snoop Dogg&quot; becomes enraged, marching on the womens position with an army of gummy bears. Perry quickly defeats the army with her whip cream guns, after which the stunned king throws down his staff and surrenders. The video ends with Snoop Dogg buried up to his neck in the sand by the women, nonetheless admiring their beauty and wishing that women everywhere could be California girls. Various California landmarks appear in the video, such as the Hollywood Walk of Fame, the Hollywood Sign and some West Coast beaches which were all made out of confectionery.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7c9fa26b69e579eb8c90aaa601a3cf529ad95e55","amp;dn":"Katy+Perry+feat.+Snoop+Dogg-California+Gurls%28Xvid-2nafish%291080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c9fa26b69e579eb8c90aaa601a3cf529ad95e55","infoHashBuffer":{"type":"Buffer","data":[124,159,162,107,105,229,121,235,140,144,170,166,1,163,207,82,154,217,94,85]},"announce":[],"urlList":[]}}