{"title":"Pink Floyd - Astronomy Domine (2nafish)","uid":5742111,"size":141092868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7cf33d54ae599c525cc35d40c8f700b88dfcac0f&amp;dn=Pink+Floyd+-+Astronomy+Domine+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1281071597,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Astronomy Domine&quot; is a song by British psychedelic rock band Pink Floyd. The song, written and composed by original vocalist/guitarist Syd Barrett, was the first track featured on their debut album, The Piper at the Gates of Dawn (1967). The lead vocal was sung by Barrett and keyboard player Richard Wright. Its working title was &quot;Astronomy DominÃƒÂ© (An Astral Chant)&quot;. &quot;Domine&quot; (the vocative of &quot;Lord&quot; in Latin) is a word frequently quoted in Gregorian chants.\n\nIn 1968, Pink Floyd travelled to Belgium where they filmed a lip-synched promotional film for &quot;Astronomy Domine&quot;, as well as &quot;See Emily Play&quot;, &quot;The Scarecrow&quot;, &quot;Apples and Oranges&quot;, &quot;Paint Box&quot;, &quot;Set The Controls For The Heart Of The Sun&quot;, and &quot;Corporal Clegg&quot;. Syd Barrett does not appear in these films, as he had been replaced by David Gilmour.\n\nDavid Gilmour lip-synced Syd's voice in the &quot;Astronomy Domine&quot; video.\n\nThe song opens with the voice of their manager at the time Peter Jenner, reading the names of stars through a megaphone. The intention of this opening is to replicate the feeling of outer space, with Jenner's voice sounding like an astronaut's over an intercom. Barrett's Fender Esquire  then seemingly emerges from the distance and grows louder. At 0:19 a rapid beeping sound appears, again reaffirming the feeling of distant space.[original research?]  At 0:26, Mason's distinctive drum fills emerge, followed closely by Barrett's bluesy, sinister-sounding guitar (perhaps reminiscent of Duane Eddy) in a figure suggestive of the brass motif from &quot;Mars, the Bringer of War&quot; in Holst's The Planets. Wright's Farfisa organ  is mixed into the background. Barrett's incantatory lyrics about space again support the cosmonautical theme in the song, mentioning planets Jupiter, Saturn, and Neptune as well as Uranian moons Oberon, Miranda, and Titania, and Saturn's moon Titan. Barrett and Richard Wright  provide lead vocals. Waters' repetitive bass line, Wright's Farfisa organ, and Barrett's kinetic slide guitar then dominate, followed by the voice of Peter Jenner again through a megaphone.\n\nThe song has an unusual chord progression: E, E-flat, G, A. The sound of this chord progression, in conjunction with the use of a Binson echo machine for the guitar, has a very distinctive psychedelic character.[original research?] The track is the album's most &quot;space rock&quot; song, alongside the longer &quot;Interstellar Overdrive&quot;. The style of the song and its use of sound effects would influence the future work of Pink Floyd, and its influence can be felt on Ummagumma (1969) and even The Dark Side of the Moon (1973).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7cf33d54ae599c525cc35d40c8f700b88dfcac0f","amp;dn":"Pink+Floyd+-+Astronomy+Domine+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cf33d54ae599c525cc35d40c8f700b88dfcac0f","infoHashBuffer":{"type":"Buffer","data":[124,243,61,84,174,89,156,82,92,195,93,64,200,247,0,184,141,252,172,15]},"announce":[],"urlList":[]}}