{"title":"Vincere DVDRip Spanish Ac3 2009","uid":5875845,"size":1663643880,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7df2a3c15711b9b3a67f111af4eaf25f3e4670f9&amp;dn=Vincere+DVDRip+Spanish+Ac3+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"acer2010","files":1,"time":1286632381,"description":"Hay un secreto en la vida de Mussolini. Una mujer y un hijo, Benito Albino, que naciÃƒÂ³, fue reconocido y despuÃƒÂ©s negado. El secreto tiene un nombre: Ida Dalser. Es una pÃƒÂ¡gina oscura de la historia ignorada en la biografÃƒÂ­a oficial de el Duce. \n\nCuando Ida se encuentra con Mussolini en MilÃƒÂ¡n, ÃƒÂ©ste es editor de Avanti! y un socialista ferviente que planea guiar a las masas hacia un futuro anticlerical, antimonÃƒÂ¡rquico y socialmente emancipado. Ida ya habÃƒÂ­a tenido un fugaz encuentro con ÃƒÂ©l en Trento, y habÃƒÂ­a quedado fascinada. \n\nElla cree realmente en ÃƒÂ©l y en sus ideas. Para financiar Il Popolo d''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''Italia, un periÃƒÂ³dico que ÃƒÂ©l ha fundado y nÃƒÂºcleo del futuro Partido Fascista, Ida vende todo lo que tiene. \n\nAl estallar la Primera Guerra Mundial, Benito Mussolini se alista en el ejÃƒÂ©rcito y desaparece. Cuando Ida vuelve a encontrarle estÃƒÂ¡ en un hospital militar cuidado por Rachele, con la que se acaba de casar. Ida arremete furiosamente contra su rival, exigiendo sus derechos como verdadera esposa de Mussolini y madre de su hijo. Es expulsada por la fuerza. \n\nDurante mÃƒÂ¡s de once aÃƒÂ±os, es encerrada en una instituciÃƒÂ³n mental (y su hijo en un centro), donde es recluida y torturada, para que no pueda volver a ver a su hijo nunca mÃƒÂ¡s. Pero Ida no se rinde sin luchar...   ","torrent":{"xt":"urn:btih:7df2a3c15711b9b3a67f111af4eaf25f3e4670f9","amp;dn":"Vincere+DVDRip+Spanish+Ac3+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7df2a3c15711b9b3a67f111af4eaf25f3e4670f9","infoHashBuffer":{"type":"Buffer","data":[125,242,163,193,87,17,185,179,166,127,17,26,244,234,242,95,62,70,112,249]},"announce":[],"urlList":[]}}