{"title":"PC Ã‚Â» LARA CROFT AND THE GUARDIAN OF LIGHT Full Game directplay ","uid":5850904,"size":636291800,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7e0c81f6c9dde175a52e67cda26a368bd55ca37e&amp;dn=PC+%C3%82%C2%BB+LARA+CROFT+AND+THE+GUARDIAN+OF+LIGHT+Full+Game+directplay+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1285381516,"description":"* Hello PC games fans ...\n\n\n* Play the new Tomb Raider game ...\n\n\n* FILE INFO : complete game with nothing ripped , the final size of the file is really like this and this is absolutly the correct work for this game , after the work the game folder get more than 2 giga , just a very good nice compression work\n\n\n\n* Gameplay : *\n\n* The game is a departure from the main series as being a third person adventure game. Instead it is a non-linear &quot;arcade-inspired&quot; action game played from an isometric viewpoint using a fixed camera. The game also features cooperative gameplay, and players can take control of either Lara or an ancient Mayan tribesman named Totec. Each playable character possess unique weapons and skills. Lara retains her dual pistols with infinite ammo and a grappling hook, which she is able to use to make it across difficult gaps and Totec can ride along. Totec carries spears which can be used both as a weapon and on the environment. Both characters carry unlimited &quot;bombs&quot; that can be dropped and detonated. Tombs can be explored and some will have &quot;booby-trap puzzles&quot; to solve. The game will not have any loading times.\n\nGuardian of Light may be played with a single player, and a second player may join at any time, whether online or locally. In the single-player campaign the only playable character is Lara; Totec will not be available to assist and Lara will have all the tools required along with new abilities to make it through her own unique adventure.The puzzles and bits of the map are also different. Creative director Daniel Neuberger said that this was because he did not want the player to get frustrated by having to rely on AI. The campaign will reportedly feature up to eight to ten hours of gameplay\n\n\n\n* enjoy ... *\n","torrent":{"xt":"urn:btih:7e0c81f6c9dde175a52e67cda26a368bd55ca37e","amp;dn":"PC+%C3%82%C2%BB+LARA+CROFT+AND+THE+GUARDIAN+OF+LIGHT+Full+Game+directplay+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e0c81f6c9dde175a52e67cda26a368bd55ca37e","infoHashBuffer":{"type":"Buffer","data":[126,12,129,246,201,221,225,117,165,46,103,205,162,106,54,139,213,92,163,126]},"announce":[],"urlList":[]}}