{"title":"(Fuckin Awesome Blues) Eilen Jewell - Letters From Sinners &amp; Str","uid":5826460,"size":95469600,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7eb7c8e3ffec241e9dd3a6c1a9ae88ffdfba9696&amp;dn=%28Fuckin+Awesome+Blues%29+Eilen+Jewell+-+Letters+From+Sinners+%26+Str&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1284303513,"description":"It's hard to tell where the traditional ends and the original begins in the music \nof Eilen Jewell, a sweet-voiced young singer who steeps her material in the \nhard times of old, reviving the stories and musical styles of the Depression. \nOn her own &quot;Rich Man's World,&quot; she casts herself as a &quot;lonely rambler girl&quot; \nwhile conjuring comparisons with Gillian Welch. Another original, &quot;In the End,&quot; \nsounds uncannily like Lucinda Williams, while a revival of Eric Andersen's \ntrain-hopping &quot;Dusty Boxcar Wall&quot; and the double-entendre blues of the \ntraditional &quot;If You Catch Me Stealing&quot; reinforce the sense of Jewell as a \nmusical throwback to a time before she was born. Yet there are timeless \npleasures here as well: a bittersweet reading of Charlie Rich's &quot;Thanks a Lot,&quot; \nan understated, harmony-laden rendition of Bob Dylan's &quot;Walking Down the \nLine,&quot; the sultry cantina twang of her original &quot;Too Hot to Sleep.&quot; When the \nmusical arrangements aren't generic Hot Club and the songs seem more like \nrole-playing, Jewell sounds like a singer with enough promise to develop her \nown identity. --Don McLeese\n\nOnce in a great while you put on a CD by an artist you've never heard of \nbefore and time stops. The voice is new, yet timeless. The lyrics are all \noriginal yet feel immediately familiar. And the melodies carry the easy groove. \nThis is the story of Eilen (rhymes with feelin') Jewell and this is her debut \nrecord. Jewell's heart-aching hushed style and intimate grasp of roots music \nare revealed in the CD's provocative, melodic originals and timeless country \nand blues classics. For fans of Lucinda Williams and Gillian Welch, this is a \nrousing and confident tour de force.\n\nThere's an off-the-cuff manner to the opening songs of Eilen Jewell's Letters \nfrom Sinners &amp; Strangers that makes the album easy to like. She builds &quot;Rich \nMan's World&quot; around bits and pieces of older folk songs, leaving the listener \nwith the impression that she might have heard the song -- somewhere -- \nbefore. She follows with Eric Andersen's &quot;Dusty Boxcar Walls,&quot; a song that \nlikewise echoed Andersen's folk influences. Jewell's lazy Southern delivery on \nLetters from Sinners &amp; Strangers, backed by full-band arrangements, reminds \none of a mellower version of the Tarbox Ramblers' self-titled release. Like the \nRamblers, Jewell delivers her version of traditional folk without slavishly \nreplicating the old music in a familiar way, pulling the music into a more \nrelevant present; unlike the Ramblers, she mixes oldies with originals and, \narrangement-wise, is capable of replicating everything from Western swing \ncrossed with rock (&quot;Heartache Boulevard&quot;) to jazzy blues (&quot;High Shelf \nBooze&quot;). Jerry Miller's electric guitar spices up the texture of songs like \n&quot;Where They Never Say Your Name,&quot; while Daniel Kellar's violin underpins the \nemotional depth of songs like &quot;In the End.&quot; Jewell delivers a mellow version of \nDylan's &quot;Walking Down the Line&quot; before closing with the sassy, upbeat &quot;Blue \nHighway.&quot; Jewell's low-key, off-the-cuff strategy works well from beginning \nto end on Letters from Sinners &amp; Strangers, delivering a fine contemporary \nfolk album. \n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. (00:02:54) Eilen Jewell - Rich Man's World\n2. (00:02:42) Eilen Jewell - Dusty Boxcar Wall\n3. (00:03:37) Eilen Jewell - High Shelf Booze\n4. (00:02:47) Eilen Jewell - Thanks A Lot\n5. (00:02:40) Eilen Jewell - Heartache Boulevard\n6. (00:02:29) Eilen Jewell - Too Hot To Sleep\n7. (00:02:31) Eilen Jewell - Where They Never Say Your Name\n8. (00:03:06) Eilen Jewell - How Long\n9. (00:04:32) Eilen Jewell - In The End\n10. (00:04:08) Eilen Jewell - If You Catch Me Stealing\n11. (00:03:36) Eilen Jewell - Walking Down The Line\n12. (00:02:12) Eilen Jewell - Blue Highway\n\nmp3   320kbps\n\n\ndo you know what?   this bitch is good...\n...she fuckin is...\n\n","torrent":{"xt":"urn:btih:7eb7c8e3ffec241e9dd3a6c1a9ae88ffdfba9696","amp;dn":"%28Fuckin+Awesome+Blues%29+Eilen+Jewell+-+Letters+From+Sinners+%26+Str","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eb7c8e3ffec241e9dd3a6c1a9ae88ffdfba9696","infoHashBuffer":{"type":"Buffer","data":[126,183,200,227,255,236,36,30,157,211,166,193,169,174,136,255,223,186,150,150]},"announce":[],"urlList":[]}}