{"title":"Windows Vista - Louder (normalized) System Sounds","uid":5930327,"size":6196669,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7f0f59909506d84bdfd3d69f52b43665ed7363f1&amp;dn=Windows+Vista+-+Louder+%28normalized%29+System+Sounds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FalconFour","files":44,"time":1288754115,"description":"With Windows Vista came a whole new series of energy-inspired, sleek and flashy sounds. The only problem is, they are almost inaudibly quiet. It's no wonder you can't tell the volume you just set by listening to the test &quot;ding&quot; anymore. This is here to fix that. This torrent is designed for Windows Vista only, however I believe it can be applied to Windows XP as well, if you want to hear Vista. They may be the same filenames, I can't remember exactly.\n\nTired of having to crank the volume up to hear your notifications only to be deafened the next time you play a video? Having trouble hearing the hardware disconnect/connect sounds in the background of your music? And worse... maybe trying to use the Mixer to boost the Windows sound level, then not being able to turn the rest of your sounds back up? It's bad enough we have to put up with way-too-low DVD audio, so why put up with Windows following suit?\n\nBehold, the answer. I ran all the Windows sounds through Adobe Audition's &quot;normalize 98%&quot; script and came up with this. The only highly irritating one was the &quot;navigation start&quot; sound, which is played when you move between folders in Explorer, which I reduced by 12db to make it less annoying. Windows sounds are meant to be heard, not silenced. These suckers were all but a flat line in file view. I swear, they were down by about 22db - that's almost inaudible!\n\nTo install, browse to C:\\Windows\\Media, back up your old files if you like, and paste the contents of the torrent over the old ones. You should notice the difference immediately.\n\nIf there is a problem installing, you may need to take ownership of the directory (from TrustedInstaller) and try again. Do this by getting Properties on the folder - go up to Windows, right click Media, and click Properties - then go to Security, Advanced, Owner, Edit, click your name, click &quot;replace owner on subcontainers and objects&quot;, click OK, *deep breath*... back to the advanced screen, click Permissions, Edit, Add, type &quot;Administrators&quot;, give them full control, click &quot;replace all existing inheritable... blah blah blah&quot;, click OK, OK, OK, wham bam, thank you ma'am, and you're done. Now try again. God, Vista makes modifying your Windows files a pain in the royal ass.\n\nENJOY!!!","torrent":{"xt":"urn:btih:7f0f59909506d84bdfd3d69f52b43665ed7363f1","amp;dn":"Windows+Vista+-+Louder+%28normalized%29+System+Sounds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0f59909506d84bdfd3d69f52b43665ed7363f1","infoHashBuffer":{"type":"Buffer","data":[127,15,89,144,149,6,216,75,223,211,214,159,82,180,54,101,237,115,99,241]},"announce":[],"urlList":[]}}