{"title":".Inpaint.v2.4.= remove an object or person that appears in the p","uid":5742865,"size":1685806,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7fef0cfecc6690b9d6b6305ce90f3332a857dc4c&amp;dn=.Inpaint.v2.4.%3D+remove+an+object+or+person+that+appears+in+the+p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BLACKTROY","files":1,"time":1281092046,"description":"Do you have a photo where the photo would be just right if you could just remove an object or person that appears in the photo? For example, look at the following picture, which would be improved if we could just take out that building.\n\nTake a look at how the picture is improved when the building is removed.\n\nYou can remove the unwanted object or person using Inpaint.\n\nInpaint reconstructs the selected image area from the pixel near the area boundary. Inpaint may be used to remove undesirable objects from still images. \n\nDelete any unwanted object from your photo, such as logo, watermark, extra power-line, people, text... The program will automatically inpaint the selected area to erase it. \n\nIf some unexpected object spoils an otherwise good photograph, Inpaint may be used to remove it. Simply select the object. No need for fiddly messing about with the clone tool! \n\nIt is alarmingly simple to use. Draw a selection around the object you wish to remove from the picture, and run smart remove selection. Inpaint will fill the selection area with intelligently generated texture drawn from the surrounding image data. really magic function you should try it! \n\n","torrent":{"xt":"urn:btih:7fef0cfecc6690b9d6b6305ce90f3332a857dc4c","amp;dn":".Inpaint.v2.4.%3D+remove+an+object+or+person+that+appears+in+the+p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fef0cfecc6690b9d6b6305ce90f3332a857dc4c","infoHashBuffer":{"type":"Buffer","data":[127,239,12,254,204,102,144,185,214,182,48,92,233,15,51,50,168,87,220,76]},"announce":[],"urlList":[]}}