{"title":"Autosport Magazine UK 23/09/2010","uid":5848590,"size":83261232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:805b66d70a69e8144ac5e76ea814bbb30a092ccf&amp;dn=Autosport+Magazine+UK+23%2F09%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thorhammer2000","files":-1,"time":1285292207,"description":"NEWS\n10 Di Resta set for F1 seat. Scot likely to be promoted to Force India race team\n12 Pole to join shootout. Kubica is fly in the ointment for F1's title battlers\n14 Red Bull's floor test. Singapore race will prove if FIA tests have had impact\n17 David Coulthard column. Looking forward to a five-way title shoot-out\n18 Singapore GP preview. Focusing our night vision on prospects for Marina Bay\n24 Snetterton upmarket. Norfolk venue gets extension in bid for international races\n26 Lotus and Carlin for GP2. British squads get the nod for places in new three-year cycle\n28 Loeb's farewell tour. French rally king will bow out after next year's WRC\n\nREPORTS\n36 BTCC Donington. Demolition men at Donington!\n44 IndyCar Motegi. Castroneves clears off\n46 Superleague Algarve. Shock: Liverpool win a trophy\n48 DTM Oschersleben. Di Resta closes in on Spengler\n50 Euro F3 Oschersleben. Bottas crushes his opposition\n55 WSR Silventone. A feast of Renault action\n58 WTCC Valencia. Tarquini on top form\n60 F2 Valencia. Stoneman claims the crown\n62 World GT1 Algarve. Maserati clings on for win\n64 World of Sport. NASCAR; Scandinavian Touring; Superstars; Brazil V8s\n66 Goodwood Revival. Period costume drama - of the most thunderous kind\n\nFEATURES\n30 Resurrection of Renault. Getting the lowdown from senior figures of Fl 2010's Lazarus team. They've worked wonders this year, so what's possible?\n\nSPORTS EXTRA\n85 BTCC teams for Carreras. Triple 8 and Dynamics to enter British Porker arena\n86 New Renault squad. Ex-Fortec engineer goes it alone for Formula Renault\n9O Reports. Brands Hatch MSVR; Mallory Park BRSCC; Snetterlon 750MC; Doune hillclimb; Knockhill SMRC\n\nREGULARS\n100 Photo finish. BRM's first race win, Goodwood 1950\n102 Race of my life. Eddie Cheever, 1982 Detroit Grand Prix\n\nOCRd by Acrobat 9.3.4, cover has links to articles","torrent":{"xt":"urn:btih:805b66d70a69e8144ac5e76ea814bbb30a092ccf","amp;dn":"Autosport+Magazine+UK+23%2F09%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"805b66d70a69e8144ac5e76ea814bbb30a092ccf","infoHashBuffer":{"type":"Buffer","data":[128,91,102,215,10,105,232,20,74,197,231,110,168,20,187,179,10,9,44,207]},"announce":[],"urlList":[]}}