{"title":"Death at a Funeral por memitoxxx etorrents.org ( ingles + sub la","uid":5712324,"size":4448108544,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8125e1ab70834d8dca460cf0d2c329c60de0cea0&amp;dn=Death+at+a+Funeral+por+memitoxxx+etorrents.org+%28+ingles+%2B+sub+la&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"memitoxxx","files":11,"time":1279948489,"description":"Directed by \tNeil LaBute\nProduced by \tSidney Kimmel\nWilliam Hordberg\nChris Rock\nShare Stallings\nLaurence Malkin\nWritten by \tDean Craig\nStarring \tChris Rock\nMartin Lawrence\nLuke Wilson\nTracy Morgan\nDanny Glover\nRegina Hall\nKevin Hart\nJames Marsden\nZoe Saldana\nLoretta Devine\nRon Glass\nPeter Dinklage\nColumbus Short\nMusic by \tChristophe Beck\nCinematography \tRogier Stoffers\nEditing by \tTracey Wadmore-Smith\nStudio \tSKE Entertainment\nWonderful Films\nParabolic Pictures\nStable Way Entertainment\nDistributed by \tScreen Gems\nRelease date(s) \tApril 16, 2010 (2010-04-16)\nRunning time \t92 min.\nCountry \tUnited States\nLanguage \tEnglish\nBudget \t$21 million\nGross revenue \t$48,577,257\n\n\nGÃƒÂ©nero: Comedia\nAÃƒÂ±o: 2010\nDuraciÃƒÂ³n: 92 min.\nNorma de video: NTSC\nAspect Ratio: 16:19\nIdioma: InglÃƒÂ©s 5.1\nSubtitulo: EspaÃƒÂ±ol Latino, InglÃƒÂ¨s\nMenÃƒÂº: Si\nExtras: No\n\nEl entierro de un patriarca conduce a una serie de acontecimientos de familia, revelando secretos oscuros y posiblemente hasta criminales. Todo comienza cuando los miembros de una familia americana se reÃƒÂºnen para despedir juntos al amado esposo y padre de familia reciÃƒÂ©n fallecido. Todo transcurre en un entretenido dÃƒÂ­a en el que, a medida que los miembros de la familia van llegando a la casa familiar, revelaciones escandalosas, resentimientos purulentos, sucias amenazas, chantajes y un cadÃƒÂ¡ver mal encaminado desatarÃƒÂ¡n un caos mortÃƒÂ­fero y desenfrenado... Remake del film dirigido por Frank Oz en 2007, &quot;Un funeral de muerte&quot;. \n\nThe film revolves around the funeral ceremony for the father of Aaron (Chris Rock) and Ryan (Martin Lawrence). Aaron, the older son, lives with his wife Michelle at his parent's home. Aaron and Michelle have been trying to buy their own home and have children but have been unsuccessful. Aaron envies Ryan because Ryan is a successful writer, which Aaron wants to be but has yet to have his novel published. Aaron is resentful towards Ryan because Ryan would rather spend money on a first class ticket from New York to L.A. than help him pay for the funeral expenses.\n\nElaine (Zoe Saldana) and her fiancee Oscar (James Marsden) are on their way to pick up her brother Jeff before heading to the funeral. To ease Oscar's nerves, she gives him what she believes is Valium. Jeff later reveals to Elaine that it's not actually Valium, but a hallucinogenic drug he's concocted for his friend. Chaos ensues when Oscar hallucinates that the coffin is moving and he knocks it over which pushes the body out the coffin which freaks out the guests.\n\nAaron is approached by an unknown guest who happens to be a little person named Frank (Peter Dinklage), who reveals himself to be the secret gay lover of his deceased father. Frank shows Aaron photos as proof and threatens to reveal them to Aaron's mother unless he is paid $30,000. Aaron tells Ryan who suggest Aaron pay the money because Ryan claims he's buried in debt. While Aaron and Ryan meet with him to pay him, Frank starts to trash talk Aaron's ability as writer and Aaron refuses to pay Frank. Frank gets angry and tries to leave the room; Ryan attacks Frank and both Aaron and Ryan tie Frank up to prevent him from leaving. Norman comes in and sees what happened. He gives Frank what they also believe is Valium to try and calm him down and Jeff tells them it's not Valium.\n\nWhile Jeff and Norman, who are supposed to be watching Frank, get distracted by Uncle Russell, Frank jumps off the coffee table and hits his head. With Aaron, Ryan, Jeff, and Norman believing Frank is dead, they plan to put him in the coffin. While everyone is outside watching the naked Oscar on the roof threatening to jump because he saw Elaine unwillingly get kissed by Derek, Aaron and Ryan put Frank in the coffin.\n\nElaine calms Oscar down by revealing she is pregnant. With everyone back inside, they continue the eulogy. While Aaron awkwardly tries to do his speech, Frank starts banging on the coffin and suddenly emerges from it. The pictures fall out of his pocket and Cynthia sees the pictures and starts to attack Frank. Aaron yells for everyone's attention as he tells them that his father was a good man with flaws like everyone else.\n\nThe film ends with Aaron and Ryan saying goodbye while Ryan gets a ride to the airport by little Martina, who Ryan has been trying to get with all day. Aaron and Michelle are finally alone and going to try and have a baby. Aaron asks where Uncle Russell is and Michelle tells him that she gave him what she believes is Valium to calm him down. In the final scene Uncle Russell is on the roof naked.\n\nIMAGENES\n &lt;a href=&quot;\nhttp://img832.imageshack.us/img832/6132/deathatafuneral2010film.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img832.imageshack.us/img832/6132/deathatafuneral2010film.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img837.imageshack.us/img837/544/ll2na.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img837.imageshack.us/img837/544/ll2na.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img682.imageshack.us/img682/816/3yyol.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img682.imageshack.us/img682/816/3yyol.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img682.imageshack.us/img682/1977/mtnen.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img682.imageshack.us/img682/1977/mtnen.png&lt;/a&gt;","torrent":{"xt":"urn:btih:8125e1ab70834d8dca460cf0d2c329c60de0cea0","amp;dn":"Death+at+a+Funeral+por+memitoxxx+etorrents.org+%28+ingles+%2B+sub+la","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8125e1ab70834d8dca460cf0d2c329c60de0cea0","infoHashBuffer":{"type":"Buffer","data":[129,37,225,171,112,131,77,141,202,70,12,240,210,195,41,198,13,224,206,160]},"announce":[],"urlList":[]}}