{"title":"Magic Workstation Fully Updated M11(7-29-10)","uid":5726966,"size":2061135517,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:81836ef3a42a19ae34c63f97eb514f9548d3d1bc&amp;dn=Magic+Workstation+Fully+Updated+M11%287-29-10%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"InternetNinjacy","files":335,"time":1280448975,"description":"Alright, this is everything, EVERYTHING, you'll need to use and play on Magic Workstation. In case you didn't know, Magic Workstation is basically the free, online version of Magic the Gathering. With this you can make any deck you want and play it online against real humans.\n\nIncluded in the .Torrent.\n\nAll Install Files needed for the game.\n\nInstructions for installation.\n\nInstall Files for Winzip (you'll need it to install) and Adobe Reader.\n\nPdf files for the Regular Magic Rulebook and the Comprehensive Rulebook.\n\nAll of the Preconstruced Magic decks. Normally Magic Workstation stops at 7th edition or so. I manually included all of the decks including the M11 Precons.\n\nAll of the World Champion decks up to 2009. The only reason 2010 isn't in there is because it hasn't happened yet.\n\nAll the Pics for almost every card. I only say almost because it's pretty impossible to check all of the thousands. This includes Planechase (which normally doesn't have pics) and Archenemy which, as of this post, doesn't have pics on the MWS pics site.\n\nA crack to unlock Magic Workstation, you DON'T NEED THIS, it's simply for people that don't want an annoying popup when they start the program. It also allows you to make your own sets and cards. If you want.\n\nFinally, if you are experienced in Magic you won't need this, but if you are relatively new or just want to see someone else' work. I have included a few of my decks. I'm not crazy good or anything, but they are working decks you can use to play around with newbies or just see some deck types you don't normally use.\n\nDamn, that's alot of words. But if you install this, you will have the most up to date Magic Workstation available as of this post. I would even bet that besides a few maniacs like me with too much time on their hands, you'd have the best copy in the world.\n\nSo seed and enjoy.","torrent":{"xt":"urn:btih:81836ef3a42a19ae34c63f97eb514f9548d3d1bc","amp;dn":"Magic+Workstation+Fully+Updated+M11%287-29-10%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81836ef3a42a19ae34c63f97eb514f9548d3d1bc","infoHashBuffer":{"type":"Buffer","data":[129,131,110,243,164,42,25,174,52,198,63,151,235,81,79,149,72,211,209,188]},"announce":[],"urlList":[]}}