{"title":"Windows XP Exodo Lite Desatendido","uid":5866922,"size":384499712,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:81b49d982c473c375999b83af43f250fe7e96a53&amp;dn=Windows+XP+Exodo+Lite+Desatendido&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VICTOR_CADIZ","files":1,"time":1286239851,"description":"Como ya saben andan circulando por todos lados una cantidad enorme de Windows desatendidos, y algunos me parecen muy bueno, asÃƒÂ­ que buscando un Windows que fuera mucho mÃƒÂ¡s rÃƒÂ¡pido y mÃƒÂ¡s Bonito. Mi mÃƒÂ¡s grande preocupaciÃƒÂ³n siempre ha sido la velocidad en cuanto a los sistemas operativos, asÃƒÂ­ como la apariencia, hay muchos desatendidos que son ligeros pero pobres en apariencia, y hay otros que se exceden en la apariencia y olvidan la velocidad. AquÃƒÂ­ tenÃƒÂ©is la combinaciÃƒÂ³n de Ambas cosas Que se le cambiÃƒÂ³: Las apariencias de los Iconos La barra de tareas Se le ha integrado Service Pack 3 Nuevo Logon Nueva ventana de cambio de usuario 7 nuevos Temas para salir de lo comÃƒÂºn. Se ha modificado para que no tengÃƒÂ¡is que meter mano durante el proceso de InstalaciÃƒÂ³n, salvo escoger la particiÃƒÂ³n de instalaciÃƒÂ³n, y al final para que pongÃƒÂ¡is vuestro nombre de usuario. Que se la ha quitado: Soporte para Teclados inservibles Lenguajes innecesarios Importante: Vosotros debÃƒÂ©is de instalarle vuestros propios Drivers; como ya es sabido de todos no hay ningÃƒÂºn sistema operativo que contenga todos los controladores. Una excelente novedad es que se instala en mÃƒÂ¡s o menos 12 a 13 minutos","torrent":{"xt":"urn:btih:81b49d982c473c375999b83af43f250fe7e96a53","amp;dn":"Windows+XP+Exodo+Lite+Desatendido","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81b49d982c473c375999b83af43f250fe7e96a53","infoHashBuffer":{"type":"Buffer","data":[129,180,157,152,44,71,60,55,89,153,184,58,244,63,37,15,231,233,106,83]},"announce":[],"urlList":[]}}