{"title":"Mahjong Suite 2010 v7.1 With Latest Graphics Packs by Laila","uid":5745290,"size":32748474,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:83711fb191c804e2f647aa1284b2e866d4a3d3d9&amp;dn=Mahjong+Suite+2010+v7.1+With+Latest+Graphics+Packs+by+Laila&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"laila1","files":6,"time":1281189882,"description":"MahJong Suite is a high-quality collection of MahJong solitaire games. Each MahJong game has millions of possible shuffles to play, so the game remains fresh no matter how many times you play. Enjoy the detailed statistics of each game with graphs, 3D charts (pies and bars) and tables to estimate your skill level (by total, current session, series of wins and losses, players' games won, players' score, hi-scores...), statistics for All Games, Won games, Not Won games, Over Average, Under Average, Not Played. For MahJong lovers, MahJong Suite is a guaranteed pleasure. Each of the games is fun and exciting and will keep you entertained for hours. If you like MahJong games, then you'll want to add MahJong Suite to your collection!\n\nFeatures:\n- Play traditional MahJong-type games with classical MahJong tile sets and millions of possible combinations!\n- Play matching-type games with funny tile sets.\n- MahJong Suite Graphics Pack contains a collection of very beautiful Tile Sets and backgrounds to use with MahJong Suite 2008.\n- Enter Hi-Scores and manage your Statistics. Play to reach the Hi-Score for every layout and manage games won, with 3D Graphics.\n- Create an unlimited number of Players so that you can challenge your friends to beat one another's Hi-Scores, Games won, Score Statistics.\n______________\n\nInstall the game and use keygen to register it. Then install graphics pack vol. 1 first and then vol. 2, respectively in the same directory where you installed the game. The keygen is clean, however, if your A.V. programme gives a false positive, use the info below to register your game.\n\nName: My Mahjong\nSerial: MFC6AF32-5659CDE2-AA2818ED\n\nEnjoy the game and don't forget to seed.\n","torrent":{"xt":"urn:btih:83711fb191c804e2f647aa1284b2e866d4a3d3d9","amp;dn":"Mahjong+Suite+2010+v7.1+With+Latest+Graphics+Packs+by+Laila","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83711fb191c804e2f647aa1284b2e866d4a3d3d9","infoHashBuffer":{"type":"Buffer","data":[131,113,31,177,145,200,4,226,246,71,170,18,132,178,232,102,212,163,211,217]},"announce":[],"urlList":[]}}