{"title":"Fine Young Cannibals - Suspicious Minds (2nafish)","uid":5837889,"size":148193284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:839ec77c23a2afd872eeda025791ad003250ed12&amp;dn=Fine+Young+Cannibals+-+Suspicious+Minds+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284803244,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Suspicious Minds&quot; is a song about being trapped in a mistrusting and dysfunctional relationship. Originally, and most notably, a hit for Elvis Presley in 1969, &quot;Suspicious Minds&quot; was widely regarded as the single that jump-started Presley's career after his successful '68 Comeback Special. It was his eighteenth and last number-one single in the United States. Rolling Stone later ranked it #91 on their list of the 500 Greatest Songs of All Time.\n\nIn 1986, the band Fine Young Cannibals' cover version of the song, which featured backing vocals by Jimmy Somerville, reached #8 on the UK Singles chart.\n\nFine Young Cannibals is an album released in 1985 by the band of the same name.\n\nThe success of their UK #8 debut single &quot;Johnny Come Home&quot; did not continue with the next single, &quot;Blue&quot;, which languished at #41 in the UK. The version of &quot;Blue&quot; on the original vinyl LP and cassette was re-mixed for the single release in an attempt to boost its commercial appeal. The re-mix version features additional electronically processed drum and percussion sounds, giving it a sound typical of other 1980's technopop hits. The currently available CD features the re-mix version in place of the original album version.\n\nFine Young Cannibals were a British band formed in Birmingham, England, in 1984, by bassist David Steele and guitarist Andy Cox (both formerly of The Beat), and singer Roland Gift (formerly of the Akrylykz). They are best known for their 1989 hit singles &quot;She Drives Me Crazy&quot; and &quot;Good Thing&quot;.\n\nTheir name came from the 1960 film All The Fine Young Cannibals starring Robert Wagner and Natalie Wood.\n\nThe group was formed in 1984 in Birmingham, UK, from the ashes of The Beat, with whom Cox and Steele previously played. The band's eponymous debut album was released in 1985, spawning two UK hit singles, &quot;Johnny Come Home&quot; and a cover of Elvis Presley's &quot;Suspicious Minds&quot; featuring additional vocals by Jimmy Somerville.\n\nFine Young Cannibals appeared as the house band in a nightclub in the 1987 comedy film Tin Men, set in Baltimore, Maryland in 1963. Steele and Cox released an instrumental house single under the moniker Two Men, a Drum Machine and a Trumpet in 1988, called &quot;Tired Of Getting Pushed Around&quot;, which reached #18 in the UK Singles Chart and was popular on the U.S. dance chart. During this time, Gift appeared in the movie Sammy and Rosie Get Laid.\n\nTheir highest charting hits were &quot;She Drives Me Crazy&quot; and &quot;Good Thing&quot;, from the 1989 album The Raw and the Cooked. Both reached number one in the U.S. singles charts. The Raw and the Cooked included three songs the band had recorded for Tin Men (including &quot;Good Thing&quot;), and their cover of the Buzzcocks' &quot;Ever Fallen in Love (With Someone You Shouldn't've)&quot; recorded for the film Something Wild.\n\nIn 1990, the band contributed a cover version of Cole Porter's song &quot;Love for Sale&quot; for the album Red Hot + Blue, a collection of 20 Cole Porter songs recorded by various artists as a benefit for AIDS research.\n\nFine Young Cannibals broke up in 1992, although they briefly returned to the studio in 1996 to record a new single, &quot;The Flame&quot;, which would complement their greatest hits compilation The Finest released that year. Gift reactivated the band name and toured in the 2000s as Roland Gift and the Fine Young Cannibals.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:839ec77c23a2afd872eeda025791ad003250ed12","amp;dn":"Fine+Young+Cannibals+-+Suspicious+Minds+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"839ec77c23a2afd872eeda025791ad003250ed12","infoHashBuffer":{"type":"Buffer","data":[131,158,199,124,35,162,175,216,114,238,218,2,87,145,173,0,50,80,237,18]},"announce":[],"urlList":[]}}