{"title":"The Red House [1947] Edward G Robinson","uid":5724578,"size":436016418,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:83ea58ff0fa6a7e2872964f5bb8d8158d3722b3e&amp;dn=The+Red+House+%5B1947%5D+Edward+G+Robinson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Dr.Caplan","files":5,"time":1280414612,"description":" &lt;a href=&quot;http://bayimg.com/lAngoaacP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/lAngoaacP&lt;/a&gt;\n\nThe Red House (1947) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0039757/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0039757/&lt;/a&gt;\n\nThe Red House (1947) is a black-and-white psychological thriller starring Edward G. Robinson. It is adapted from the novel The Red House by George Agnew Chamberlain, published in 1943 by Popular Library. The novel was serialized in five consecutive issues of Saturday Evening Post, 10 March 1945 through 7 April 1945.\n\n\n Edward G. Robinson ...  Pete Morgan \n Lon McCallister ...  Nath Storm \n Judith Anderson ...  Ellen Morgan \n Rory Calhoun ...  Teller \n Allene Roberts ...  Meg \n Julie London ...  Tibby \n Ona Munson ...  Mrs. Storm \n Harry Shannon ...  Dr. Byrne \n Arthur Space ...  The Sheriff \n\nThe summer teenaged Meg (Roberts) and her friends stand on the verge of adulthood, is the summer they decide to explore the woods on the lands owned by her adopted father (Robinson), over his virulent objections. Soon, secrets that have been buried deep in the forest since Meg was a baby are dragged back into the light, with tragic and deadly consequences.\n\n&quot;The Red House&quot; is a well-paced, expertly acted thriller where country-folk are neither simple nor neighborly. The cast are all perfect in their roles, with Edward G. Robinson (who transforms from an eccentric, crabby farmer into a menacing, murderous pervert, as his vener is gradually stripped away) and Allene Roberts (who changes from a shy, romantic girl into a young woman willing to risk everything to learn the secrets of her past) give particularly noteworthy performances.\n\nThe camera-work and the staging are also very impressive. The way the woods change between day and night are very impressively done, with the menace present when Meg's friend and object of her puppy-love (McCallister) tries to take a shortcut them during a storm, but completely absent during the light of day. The musical score is also extremely well-done and probably somewhat ahead of its time. (My biggest complaint about movies from the 1930s, 1940s, and into the 1950s is that oftentimes the music soundtrack almost seems random in its emotional quality and often not even close to being in sync with what's happening on screen. That can't be said for the music here--it enhances and moves the story along with as much force as the actors and the dialogue they deliver.)","torrent":{"xt":"urn:btih:83ea58ff0fa6a7e2872964f5bb8d8158d3722b3e","amp;dn":"The+Red+House+%5B1947%5D+Edward+G+Robinson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83ea58ff0fa6a7e2872964f5bb8d8158d3722b3e","infoHashBuffer":{"type":"Buffer","data":[131,234,88,255,15,166,167,226,135,41,100,245,187,141,129,88,211,114,43,62]},"announce":[],"urlList":[]}}