{"title":"Monica Zetterlund - Ett Lingonris som satts i cocktailglas","uid":5904112,"size":2722882417,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:843d187d349eda26d11726d31e2aca99487c7d69&amp;dn=Monica+Zetterlund+-+Ett+Lingonris+som+satts+i+cocktailglas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barzam","files":149,"time":1287785711,"description":"This 6-CD box was released in 1995 and contains a wide selection of Monica Zetterlund's music. Included is the comprehensive booklet (in Swedish), which couldn't be properly scanned, but photographed. The photos are in high quality though and put together in a pdf. \n\n\nEnjoy!\n\n\n\nAllmusic:\nMonica Zetterlund sang with Ib Glindeman's band in Denmark and saxophonist Arne Domnerus' band in Stockholm in 1957, recording with Domnerus beginning in 1958. She began performing abroad in the late '50s. In the United States, Zetterlund's credibility as a jazz singer rests largely upon Waltz for Debbie, a recording made in 1964 with pianist Bill Evans' trio. In addition to several solo records, she's also recorded with the Thad Jones-Mel Lewis orchestra (It Only Happens Every Time, 1977) and bassist Niels-Henning ÃƒËœrsted Pedersen (This Is All I Ask, 1998), among others. Her repertoire also incorporated such non-jazz idioms as Swedish folk songs and classical music. Zetterlund's celebrity transcended music; classically beautiful, she was also an actress in her native Sweden. She continued to perform until her death in May of 2005 after a fire broke out in her apartment.\n\n","torrent":{"xt":"urn:btih:843d187d349eda26d11726d31e2aca99487c7d69","amp;dn":"Monica+Zetterlund+-+Ett+Lingonris+som+satts+i+cocktailglas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"843d187d349eda26d11726d31e2aca99487c7d69","infoHashBuffer":{"type":"Buffer","data":[132,61,24,125,52,158,218,38,209,23,38,211,30,42,202,153,72,124,125,105]},"announce":[],"urlList":[]}}