{"title":"20100805-Stossel-[Transportation].Fox Business.CF.avi","uid":5748427,"size":308758560,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8491a06335b380fd494d6617cd417888a2c3198e&amp;dn=20100805-Stossel-%5BTransportation%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1281310146,"description":"STOSSEL - [Transportation] - Fox Business Network\n2010, August 5, Thursday\n\nXvid/MP3 AVI\n\n-----\n[Excerpted from John Stossel's blog:]\n\nPeople usually say, &quot;Only government can build and maintain the roads!&quot; And it's true, government did build the interstate highway system. And overwhelmingly, it's government that maintains our roads.\n\nBut should they? That's the question I answer in my Fox Business program (Thursday @ 9pm ET) and my syndicated column this week:\n\nPoliticians call road management a &quot;public good&quot; that &quot;government must control.&quot; Nonsense.\n\n... For years there was a gap in the ring road surrounding Paris that created huge traffic problems. Then private developers made an unsolicited proposal to build a $2 billion toll tunnel in exchange for a 70-year lease to run it. They built a double-decker tunnel that fits six lanes of traffic in the space usually required for just two. The tunnel's profit-seeking owners have an incentive to keep traffic moving. They collect tolls based on congestion pricing, and tolls are collected electronically, so cars don't have to stop. The tunnel operators clear accidents quickly.Most are detected within 10 seconds -- thanks to 350 cameras inside the tunnel. The private road has cut a 45-minute trip to 10 minutes.\n\nIndiana used to lose money on its toll road. Then Gov. Mitch Daniels leased it to private developers. Now it makes a profit.The new owners spent $40 million on electronic tolling. That's saved them 55 percent on toll collection. They saved $20 per mile by switching to a better de-icing fluid. They bought a new fleet of computerized snowplows that clear roads using less salt. Drivers win, and taxpayers win. ","torrent":{"xt":"urn:btih:8491a06335b380fd494d6617cd417888a2c3198e","amp;dn":"20100805-Stossel-%5BTransportation%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8491a06335b380fd494d6617cd417888a2c3198e","infoHashBuffer":{"type":"Buffer","data":[132,145,160,99,53,179,128,253,73,77,102,23,205,65,120,136,162,195,25,142]},"announce":[],"urlList":[]}}