{"title":"Clerks Complete Animated Series DvDrip","uid":5886541,"size":980944896,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:84d2e963ad66c0c8b5f69d800a33eb0327dbfa24&amp;dn=Clerks+Complete+Animated+Series+DvDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jlas2h","files":6,"time":1287073413,"description":"Episodes\n\n1.\t\\&quot;Leonardo Leonardo Returns and Dante Has an Important Decision to Make\\&quot; \tDecember 14, 2002\n\nBillionaire Leonardo Leonardo returns to Leonardo, New Jersey and opens the Quicker Stop right across from the Quick Stop, nearly costing Randal and Dante their jobs. \n\n\n\n2.\t\\&quot;The Clipshow Wherein Dante and Randal are Locked in the Freezer and Remember Some of the Great Moments in Their Lives\\&quot; \t\t\t\t\t\t\t\t\t\t\tJune 7, 2000\n\nDante and Randal get locked in the freezer. There, they look back on their lives, primarily in clips from the same and previous episode.\n\n\n \n3 \t\\&quot;Leonardo Is Caught in the Grip of an Outbreak of Randal\\'s Imagination and Patrick Swayze Either Does or Doesn\\'t Work in the New Pet Store\\&quot; \t\t\t\t\t\t\t\t\tDecember 14, 2002\n\nQuick Stop is put under government control after Leonardo is said to have been infected with a deadly virus by a monkey at the new pet store next to RST Video. \n\n\n\n\n4 \t\\&quot;A Dissertation on the American Justice System by People Who Have Never Been Inside a Courtroom, Let Alone Know Anything About the Law, but Have Seen Way Too Many Legal Thrillers\\&quot; \t\t\tMay 31, 2000\nJay sues the Quick Stop for 10 million dollars after slipping on Randal\\'s soda. \n\n\n\n5 \t\\&quot;Dante and Randal and Jay and Silent Bob and a Bunch of New Characters and Lando Take Part in a Whole Bunch of Movie Parodies...\\&quot; \t\t\t\t\t\t\t\t\t\tDecember 14, 2002\n\nLeonardo Leonardo decides to let Dante manage his Little League team, which includes Jay and Silent Bob. Meanwhile, Randal is put into slave labor after beating the high score on an old video game. \n\n\n\n6 \t\\&quot;The Last Episode Ever\\&quot; \tDecember 14, 2002\n\nDante and Randal work inside the Quick Stop discussing various things. Meanwhile outside Leonardo Leonardo attempts to take over the world with a private army prompting the U.S. military to retaliate inside Leonardo, New Jersey. Despite the loud amount of noise Dante and Randal never actually notice what\\'s going on. \n\n\n","torrent":{"xt":"urn:btih:84d2e963ad66c0c8b5f69d800a33eb0327dbfa24","amp;dn":"Clerks+Complete+Animated+Series+DvDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84d2e963ad66c0c8b5f69d800a33eb0327dbfa24","infoHashBuffer":{"type":"Buffer","data":[132,210,233,99,173,102,192,200,181,246,157,128,10,51,235,3,39,219,250,36]},"announce":[],"urlList":[]}}