{"title":"Gears Of War [PC-2DVD]","uid":5690643,"size":16153160528,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8528e7efb1dac89e7bd673acf993a5c0957cc73d&amp;dn=Gears+Of+War+%5BPC-2DVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2308,"time":1279080128,"description":"Gears of War es un videojuego tÃƒÆ’Ã‚Â¡ctico de acciÃƒÆ’Ã‚Â³n/horror en tercera persona desarrollado por Epic Games utilizando el motor de juego Unreal Engine 3. Gears of War apareciÃƒÆ’Ã‚Â³ en el mercado de los Estados Unidos el dÃƒÆ’Ã‚Â­a 7 de noviembre de 2006.\n\nEl juego toma lugar en el planeta Sera, el cual llegÃƒÆ’Ã‚Â³ a tener una importante escasez de fuentes de energÃƒÆ’Ã‚Â­a tras un consumismo humano desmesurado, extinguiendo casi todas las fuentes de energÃƒÆ’Ã‚Â­a. Durante una excavaciÃƒÆ’Ã‚Â³n fue descubierta una sustancia fosforescente de baja viscosidad llamada ImulsiÃƒÆ’Ã‚Â³n, la cual por medio del proceso de Lightmass, descubierta por la Doctora Helen Cooper, era convertida directamente en fuente de combustion por eso la gasolina fue remplazada por este. Las naciones tuvieron un gran problema econÃƒÆ’Ã‚Â³mico, y por un desastre en el laboratorio esto llevÃƒÆ’Ã‚Â³ a que ellas luchasen entre sÃƒÆ’Ã‚Â­ por el control de la ImulsiÃƒÆ’Ã‚Â³n, provocando la Guerra del PÃƒÆ’Ã‚Â©ndulo. Finalmente la CGO ganÃƒÆ’Ã‚Â³ el control de la imulsion y por un tiempo se conociÃƒÆ’Ã‚Â³ la ilusiÃƒÆ’Ã‚Â³n de la paz... hasta el &quot;DÃƒÆ’Ã‚Â­a de la Emergencia&quot;.\n\nEl dÃƒÆ’Ã‚Â­a en el que comenzÃƒÆ’Ã‚Â³ el ataque de los Locust fue llamado el &quot;DÃƒÆ’Ã‚Â­a de Emergencia&quot;, debido a que los Locust emergieron de la corteza terrestre del planeta, donde habitan desde hace aÃƒÆ’Ã‚Â±os. La CGO hizo su mejor esfuerzo, pero no pudo con la horda Locust y decidieron usar rayos de partÃƒÆ’Ã‚Â­culas satelitales sobre sus ciudades para evitar que los Locust las tomaran.\n\nDebido a las bajas que se cobra la guerra, cualquier familia o persona rescatada y acogida deberÃƒÆ’Ã‚Â¡ luchar junto a la CGO y gran cantidad de prisioneros ex militares estÃƒÆ’Ã‚Â¡n siendo enrolados de nuevo en el ejÃƒÆ’Ã‚Â©rcito. Es el caso del personaje principal de la historia, el exsargento Marcus FÃƒÆ’Ã‚Â©nix, que es sacado de la cÃƒÆ’Ã‚Â¡rcel por haber desobedecido ÃƒÆ’Ã‚Â³rdenes de Hoffman para intentar salvar a su padre del general Raam el jefe de los extremos locust Dominic &quot;Dom&quot; Santiago. (El compaÃƒÆ’Ã‚Â±ero de Marcus)\n\nEl videojuego ya ha vendido mÃƒÆ’Ã‚Â¡s de 5 millones de unidades por todo el mundo.\n\n[b]Jugabilidad:[/b]\n\nEste tÃƒÆ’Ã‚Â­tulo destacÃƒÆ’Ã‚Â³, mÃƒÆ’Ã‚Â¡s allÃƒÆ’Ã‚Â¡ de la repercusiÃƒÆ’Ã‚Â³n que supuso en la llamada nueva generaciÃƒÆ’Ã‚Â³n su deslumbrante motor grÃƒÆ’Ã‚Â¡fico, por tener una dinÃƒÆ’Ã‚Â¡mica divertida, frenÃƒÆ’Ã‚Â©tica y fresca, que sin desear innovar sÃƒÆ’Ã‚Â­ que toma algo de aquÃƒÆ’Ã‚Â­ y algo de allÃƒÆ’Ã‚Â¡ para aportar un conjunto que merece ser tomado como referente del gÃƒÆ’Ã‚Â©nero. La acciÃƒÆ’Ã‚Â³n no resultaba directa; tenÃƒÆ’Ã‚Â­amos que buscar cobertura de forma continua, moviÃƒÆ’Ã‚Â©ndonos de un lado para otro y sÃƒÆ’Ã‚Â³lo asomarnos para lanzar una correcta y letal rÃƒÆ’Ã‚Â¡faga a nuestro enemigo. Pero no por ello se perdÃƒÆ’Ã‚Â­a ritmo, compensando el componente tÃƒÆ’Ã‚Â¡ctico con una respuesta mÃƒÆ’Ã‚Â¡s bien arcade al control\n\n[b]Sonidos:[/b]\n\nSonoramente tambiÃƒÆ’Ã‚Â©n es de destacar, con una banda sonora digna y un gran elenco de efectos bien situados que provocan una gran inmersiÃƒÆ’Ã‚Â³n, sobre todo si se disfruta del sonido envolente 5.1. No ha habido ningÃƒÆ’Ã‚Âºn cambio en este aspecto salvo por el de la plataforma en la que corre, que ayuda a configurar una calidad al gusto del usuario.\n\n[b]Opciones de juego[/b]\n\nLas opciones en sÃƒÆ’Ã‚Â­ son bastante completas. Tenemos el modo campaÃƒÆ’Ã‚Â±a, que, contando las nuevas misiones que comentaremos a continuaciÃƒÆ’Ã‚Â³n dura sobre las doce horas, aunque depende de su nivel de dificultad; luego tenemos la cooperaciÃƒÆ’Ã‚Â³n y los modos multijugador, que son divertidos a rabiar. Y hasta aquÃƒÆ’Ã‚Â­ quÃƒÆ’Ã‚Â© es lo que ofrece Gears of War\n\n[b]ConclusiÃƒÆ’Ã‚Â³n[/b]\n\nGears of War es un imprescindible del catÃƒÆ’Ã‚Â¡logo de la blanca de Microsoft, de eso no cabe duda. Su exquisita jugabilidad y un apartado tÃƒÆ’Ã‚Â©cnico que quita el aliento, ademÃƒÆ’Ã‚Â¡s de un modo online de lo mÃƒÆ’Ã‚Â¡s adictivos y aprovechables que existen.","torrent":{"xt":"urn:btih:8528e7efb1dac89e7bd673acf993a5c0957cc73d","amp;dn":"Gears+Of+War+%5BPC-2DVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8528e7efb1dac89e7bd673acf993a5c0957cc73d","infoHashBuffer":{"type":"Buffer","data":[133,40,231,239,177,218,200,158,123,214,115,172,249,147,165,192,149,124,199,61]},"announce":[],"urlList":[]}}