{"title":"The Health Wyze Report - Episode 10","uid":5884610,"size":76589177,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:85de9643271171aa7b42fcccde6a5b2c4990c5c6&amp;dn=The+Health+Wyze+Report+-+Episode+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mandalasarah","files":1,"time":1287017558,"description":"This was our first self-hosted live show. We discussed the F.D.A.'s threats toward Nestle Corporation, their attempts to stop companies from using honest labeling, and armed raids against raw milk sellers. We also talked about the F.D.A.'s infringement of freedom of speech, and how they prevent supplement companies from making honest statements on their products.\n\nWe told people how to stop a heart attack naturally, gave the common causes of sudden heart attacks and heart disease, listed the many benefits of cayenne pepper, warned about the effects of vitamin C on tooth enamel and provided other dental tips. We explained how the mainstream medical establishment ignores all medicines which do not produce toxic side-effects, because they maintain that only toxic products can be beneficial. We highlighted the unethical practices of Horizon dairy company, and their intentional deception of health-conscious customers. October is Breast Cancer Awareness Month, so we exposed how the companies that are funding the &quot;cure&quot; are the ones which are actually causing the disease, particularly in the case of deodorants. We talked about the unique approval process being used for G.M.O. salmon, the dangers of homogenization, curing and preventing hangovers, and the government's increasing invasion of privacy, including Thomas' personal experience with U.S. Census workers.","torrent":{"xt":"urn:btih:85de9643271171aa7b42fcccde6a5b2c4990c5c6","amp;dn":"The+Health+Wyze+Report+-+Episode+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85de9643271171aa7b42fcccde6a5b2c4990c5c6","infoHashBuffer":{"type":"Buffer","data":[133,222,150,67,39,17,113,170,123,66,252,204,222,106,91,44,73,144,197,198]},"announce":[],"urlList":[]}}