{"title":"Pro Evolution Soccer 2011 [PAL][Xbox360][Spanish][www.consolasat","uid":5861031,"size":7838695876,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:8677985e308a41baafc899b5b83eeb342e541a69&amp;dn=Pro+Evolution+Soccer+2011+%5BPAL%5D%5BXbox360%5D%5BSpanish%5D%5Bwww.consolasat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":4,"time":1285969610,"description":"Plataforma: Xbox 360\nNÃ‚Âº de Jugadores: 1-4\nOnline: Si\nGÃƒÂ©nero: Deportes\nDesarrollado por: Konami\nDistribuido por: Konami Digital Entertainment\nVideo: Pal\nIdiomas: Italiano y EspaÃƒÂ±ol Audio y Textos\nFecha Lazamiento: 30/09/2010\n\nResumen:\nLos chicos de Konami son conscientes de que se juegan mucho con esta nueva entrega, estÃƒÂ¡n orgullosos de seguir siendo lideres en ventas en EspaÃƒÂ±a, pero saben de las dificultades que han tenido los ÃƒÂºltimos aÃƒÂ±os en otras regiones europeas, es por ello, que en esta nueva entrega, estÃƒÂ¡n queriendo darle especial ÃƒÂ©nfasis al feedback de los usuarios, y seguir el guiÃƒÂ³n que el futbol mundial maneja en este momento y de los gustos de los usuarios con respecto a las quejas de las ÃƒÂºltimas entregas.\n\nEl futbol de precisiÃƒÂ³n y la defensa zonal serÃƒÂ¡ una de las claves en su jugabilidad, pretenden diferenciar el juego actual, mÃƒÂ¡s estratÃƒÂ©gico, del futbol individual de ÃƒÂ©pocas como las de Maradona. Para ello, tÃƒÂ¡ctica e IA dinÃƒÂ¡mica responderÃƒÂ¡n en consonancia a todas las jugadas, consiguiendo un futbol versÃƒÂ¡til y en equipo al unÃƒÂ­sono.\n\n\nHan conseguido al fin un control de 360 grados en respuesta y movimiento a la vez con la direcciÃƒÂ³n del jugador, la anterior entrega tenÃƒÂ­a el control en 360 grados pero no en la respuesta y sincronizaciÃƒÂ³n de las direcciones. Con control de 360 grados nos referimos a 32 direcciones distintas con el stick, en la ÃƒÂ©poca de PS2 eran 16 y en la ÃƒÂ©poca de PS1 eran solo 8 direcciones posibles con el jugador.\n\nSe podrÃƒÂ¡n personalizar los regates, es decir, con L2 + movimiento del stick derecho haremos distintos regates al contrario, tambiÃƒÂ©n para fintas y driblings. Otra novedad serÃƒÂ¡ la liga master online, pero no han querido entrar aun en detalles de cÃƒÂ³mo serÃƒÂ¡.\n\nEl HUD del juego serÃƒÂ¡ ahora mucho mÃƒÂ¡s sencillo y con menos cosas en pantalla, se acabÃƒÂ³ la barra de stamina en pantalla y el nombre de los jugadores, estÃƒÂ¡s 2 cosas se mostrarÃƒÂ¡n directamente encima del jugador, la barra de disparo, tanto de pase como a puerta, irÃƒÂ¡ debajo del jugador, nos ha parecido muy acertada, te adaptas rÃƒÂ¡pido y no molesta en el juego, se acabÃƒÂ³ eso de mirar la parte de debajo de la pantalla mientras tiras para saber quÃƒÂ© potencia das al tiro, ahora desde el mismo jugador puedes mirar a porterÃƒÂ­a y a la barra a la vez, todo un acierto. Todo esto permitirÃƒÂ¡ una vista del campo mÃƒÂ¡s amplia sin tanta carga en el HUD.\n\nEl motor del juego serÃƒÂ¡ el mismo que la anterior entrega, pero en cambio, el motor de animaciones serÃƒÂ¡ completamente nuevo, todas las animaciones de los jugadores serÃƒÂ¡n completamente nuevas, damos fe de ello.\n\nEl ritmo de juego es otra de las cosas donde mÃƒÂ¡s han querido interesarse con el feedback de los usuarios, segÃƒÂºn Konami, no hay un ritmo concreto mayoritario preferido por los usuarios, por tanto, han llegado a la conclusiÃƒÂ³n de que cada jugador podrÃƒÂ¡ elegir su ritmo de juego a su gusto, desde -2 a +2, pudiendo ser elegido tambiÃƒÂ©n en el modo online y buscar partidas de este modo, y siendo fÃƒÂ¡cilmente cambiable en el menÃƒÂº pausa en mitad de un partido.","torrent":{"xt":"urn:btih:8677985e308a41baafc899b5b83eeb342e541a69","amp;dn":"Pro+Evolution+Soccer+2011+%5BPAL%5D%5BXbox360%5D%5BSpanish%5D%5Bwww.consolasat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8677985e308a41baafc899b5b83eeb342e541a69","infoHashBuffer":{"type":"Buffer","data":[134,119,152,94,48,138,65,186,175,200,153,181,184,62,235,52,46,84,26,105]},"announce":[],"urlList":[]}}