{"title":"Gundam Wing s1 e18-22 [DVDrip ITA] Pack 4 di 9 [TNT Village]","uid":5857538,"size":1120704512,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8769b850149f00f4df1d5082f224a2e269b7dad7&amp;dn=Gundam+Wing+s1+e18-22+%5BDVDrip+ITA%5D+Pack+4+di+9+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"l.diliberto","files":5,"time":1285864064,"description":"Gundam Wing s1 e18-22 [DVDrip ITA] Pack 4 di 9 [TNT Village]\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=46330&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=46330&lt;/a&gt;\n\n.: Trama :.\n\nE' l'anno 195 AC (After Colony) . Da oltre un secolo, l'umanitÃƒÂ  ha fondato un numero di colonie spaziali, gigantesche costruzioni rotanti che fanno da casa a milioni di persone. Queste colonie sono riunite in gruppi nei 5 punti di Lagrange, aree relativamente stabili nell'orbita terrestre.\n\nPer decenni, mentre la superficie terrestre vi erano guerra e conflitti civili, la pace e la calma delle colonie spaziali rappresentavano una attraente altenativa per i coloni stanchi della guerra. Quando le guerre terrestri finirono, venne creato un nuovo governo mondiale, una &quot;United Earth Sphere Alliance&quot; creata per portare la pace attraverso la forza delle armi. Nel nome della pace e della giustizia, l'Alleanza prese il controllo delle colonie.\n\nPer fare pressioni sulle nazioni terrestre per la loro autonomia, i coloni dello spazio scelsero un uomo di nome Heero Yuy quale loro rappresentante. Il carismatico Yuy unÃƒÂ¬ le colonie, e il so messaggio di smilitarizzazione e di non-violenza venne ben accolto dai popoli della Terra. Ma quando Yuy venne assassinato nell'anno AC 175, le speranze dei coloni vennero frantumate e si gettarono nel tumulto.\n\nSotto il pretesto di riportare l'ordine nelle colonie, l'Alleanza allestÃƒÂ¬ un secondo intervento militare, utilizzando macchine da combattimento umanoidi chiamate mobile suits per schiacciare tutta la resistenza. Le colonie passarono sotto la legge marziale, e vennero proibite tutte le cooperazioni e le comunicazioni tra le colonie. Perfino nazioni terrestri simpatizzanti della filosofia di Heero Yuy, come la pacifica Sanc Kingdom in Europa, vennero spazzate via dalla travolgente forza dell'Alleanza.\n\nDietro le quinte, l'Alleanza ÃƒÂ¨ stata manipolata dalla Romefeller Foundation, la potente lega industriale che sviluppa e produce i suoi mobile suits. Il corpo speciale di mobile suits dell'Alleanza, gli &quot;Specials&quot;, ÃƒÂ¨ addestrato ed equipaggiato dalla Romefeller Foundation. In realtÃƒÂ , gli Specials non sono nient'altro che una facciata per OZ, una sussidiaria dei Romefeller che ÃƒÂ¨ stata rimodellata come una societÃƒÂ  segreta. Dipendente solo dalla Romefeller Foundation, OZ si ÃƒÂ¨ infiltrata ai piÃƒÂ¹ alti livelli militari dell'Alleanza.\n\nDopo due decenni di oppressione, una rete di ribelli basata sulle colonie spaziali decide di reagire a OZ e alla sua marionetta, l'Alleaza. I gruppi di resistenza dui cinque gruppi di colonie spaziali lavorano indipendentemente alla loro parte dell'Operazione Meteor, ciascuno usufruendo dei servizi di uno degli scienziati che aiutarono nella creazione dei primi mobile suits. Usando il Gundanium, materiale super-resistente per la corazza, gli scienziati hanno costruito mobile suits avanzati chiamati &quot;Gundam&quot;, affidandoli a cinque giovani piloti altamente preparati e pieni di risorse, e li spedisce sulla Terra per avviare azioni di guerriglia contro l'Alleanza.\n\nDei cinque piloti di Gundam, Chang Wufei del gruppo di colonie L5, Quatre Raberba Winner di L4, Trowa Barton di L3 e Duo Maxwell di L2 raggiungono la Terra senza incidenti. Ma il pilota del Gundam di L1, un sinistro nome avente il nome in codice di Heero Yuy, nome del leader delle colonie ucciso, viene intercettato da Zechs Merquise, asso degli Specials, e costretto a far ammarare il suo Gundam in mare. Barcollando a riva, Heero incontra Relena Darlian, figlia del ministro degli esteri dell'Alleanza. Heero promette di ucciderla pur di mantenere nascosta la sua identitÃƒÂ , ma capisce di non poter attuare questa minaccia...\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://www.gundamwingzero.com/wing-dvd1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gundamwingzero.com/wing-dvd1.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nTitolo Italiano: Mobile Suit Gundam Wing\nTitolo Originale: Shinkidousenki Gundam Wing\nNumero di Episodi: 49\nDurata media di ogni episodio: 21'\nFormato: Serie TV\nCasa Produttrice: Sunrise\nGenere: Mecha\nAnno di produzione: 1996\nAdattamento italiano: 2001\n\nDirettore: Masashi Ikeda\nScenario: Katsuyuki Sumisawa\nCharacter design: Shuko Murase\nMecha design: Junya Ishigaki, Hajime Katoki, Kunio Okawara\nCostume design: Yutaka Izubuchi\nDirettore artistico: Masaru Satoh, Yuusuke Takeda\nMusica: Yasuo Urakami\n\n========================================\n\n.: Dati tecnici dei file :.\n\nDimensione File (in bytes):223,004,672\nDurata(hh:mm:ss):20:46.527\nNumero di tracce Audio :1\n\n--- Informazioni Video ---\n\nNome Codec Video:DivX 5.0.5\nNumero Frame:29887\nLarghezza Frame(pixels):640\nAltezza frame(pixels):480\nDisplay Aspect Ratio (&quot;DAR&quot;):1.333\nFPS:23.976\nVideo Bitrate (kbps):1293\nQF:0.176\n\n--- Informazioni Audio Traccia 1 ---\n\nCodec audio:0x0055 MPEG-1 Layer 3\nFreq.audio (Hz):44100\nBitrate(kbps):128\nTipo:CBR\nCanali:2","torrent":{"xt":"urn:btih:8769b850149f00f4df1d5082f224a2e269b7dad7","amp;dn":"Gundam+Wing+s1+e18-22+%5BDVDrip+ITA%5D+Pack+4+di+9+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8769b850149f00f4df1d5082f224a2e269b7dad7","infoHashBuffer":{"type":"Buffer","data":[135,105,184,80,20,159,0,244,223,29,80,130,242,36,162,226,105,183,218,215]},"announce":[],"urlList":[]}}