{"title":"Umberto Eco - The Island of the Day Before (doxyerfre)","uid":5709110,"size":1409845,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:88543e423a4a22c9f34f764f68648817f70150fa&amp;dn=Umberto+Eco+-+The+Island+of+the+Day+Before+%28doxyerfre%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":null,"files":1,"time":1279816177,"description":"E-Book PDF 1.4MB 269 Pages\n\nBy Umberto Eco\n\nEco is often compared to literary greats such as Joyce, Voltaire and Swift in that he shares in the fabulist tradition. That should be a clue that The Island of the Day Before is going to be a rather daunting read. And indeed, it is. But the core of the story is a unique and adventurous tale about an Italian nobleman, a dreamer who gets caught up in worlds of his own making.\n\nIt is 1643, and Roberto della Griva is marooned off the coast of an island in the South Pacific. Sent on a mission by French Cardinal Mazarin to decipher the secrets of longitude, Roberto is swept off the Amaryllis by a violent storm. He manages to climb aboard another ship, the Daphne. The Daphne is abandoned, and Roberto cannot get to the nearby island, as various hazards and his inability to swim stand in his way. The novel indicates that the island is across the International Dateline from the ship, which makes it the island of the day before.\n\nAs he explores the different cabinets on the Daphne and evaluates the provisions, he reminisces about his life. Most of his memories involve Ferrante, his imaginary evil brother who eventually seems to morph into Roberto's alter ego. There is also his love, Lilia, who is never far from his mind. Roberto remembers some adventures from his youth, and how he came to be in his current predicament.\n\nThe main plot is certainly interesting and spirited, and Roberto is a likeable character. However, the entire story goes off course, much like the Daphne, getting mired in obscure references and various other narratives compete with the main plot and making the book extremely difficult to follow. So, too, does the constant switching back and forth between Roberto's past life and present life. And this book cannot be read without a dictionary handy.\n\nIt's a shame too, because Eco's previous works, The Name of the Rose, and Foucault's Pendulum, have been highly praised and well received internationally. This is my first experience with Eco, so I'm unsure about delving into these other works. The Island of the Day Before, like Roberto's narrative, is a harrowing journey. Only the truly adventurous should proceed.\n\n\nA review","torrent":{"xt":"urn:btih:88543e423a4a22c9f34f764f68648817f70150fa","amp;dn":"Umberto+Eco+-+The+Island+of+the+Day+Before+%28doxyerfre%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88543e423a4a22c9f34f764f68648817f70150fa","infoHashBuffer":{"type":"Buffer","data":[136,84,62,66,58,74,34,201,243,79,118,79,104,100,136,23,247,1,80,250]},"announce":[],"urlList":[]}}