{"title":"Democracy Now - 20 sep 2010","uid":5841927,"size":445330743,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:888ba969eaba7bd363e69630c89e593601f36732&amp;dn=Democracy+Now+-+20+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1285001751,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 20, 2010\n\n- BP Permanently Seals Ruptured Gulf Well\n- At Least 56 Killed in Iraq Violence\n- 17 Killed as Afghanistan Holds Elections\n- NATO Bombing Kills 7 in Afghan Village\n- Report: US Won't Change Afghan War Policy\n- Freed Hiker Returns to US, Urges Freeing of 2 Prisoners\n- Iran Retracts Claim of US Troop Arrests\n- Poll: Majority Oppose Attack on Iran, Favor Neutrality on Mideast Conflict\n- Pope Benedict Faces Protests in Britain\n- Virginia Scheduled to Execute 1st Woman Prisoner in Century\n- FDA Barring Food Makers from Advertising Products as GMO-Free\n\n\nSpecial reports\n\n- Legendary British Author John le CarrÃƒÂ© on Why He Won't Be Reading Tony Blair's Iraq War-Defending Memoir\n\nDavid Cornwell, the legendary British novelist who writes under the name John le CarrÃƒÂ©, joins us in London. A former British spy, his books include The Spy Who Came in from the Cold, Tinker, Tailor, Soldier, Spy, and The Constant Gardener. On the heels of the publication of British Prime Minister Tony Blair's Iraq war-defending memoir A Journey, le CarrÃƒÂ© explains why he refused to interview Blair and why he won't be reading his memoir.\n\n\n- John le CarrÃƒÂ©: &quot;The United States of America Has Gone Mad&quot;\n\nWhile John le CarrÃƒÂ© is famous for his spy novels, he wrote a widely read antiwar essay in 2003 titled &quot;The United States of America Has Gone Mad.&quot; He reads an excerpt.\n\n\n- Iraqi Refugee Describes Torture, Imprisonment of Husband Who Returned to Iraq to Free Jailed Son\n\nRabiha al Qassab, a British Iraqi woman who lives in London, describes the harrowing story of her husband, Ramze Shihab Ahmed. Having fled in 1998 after being accused of trying to overthrow Saddam Hussein, Ramze returned to Iraq last year to get his son out of prison. He, too, was arrested and was tortured. Like 30,000 other Iraqis, he and his son are being held without charge.\n\n\n- &quot;New Order, Same Abuses&quot;: Amnesty Condemns Iraq for Holding 30,000 Prisoners Without Trial\n\nAmnesty International is condemning Iraq for holding an estimated 30,000 prisoners without trial, including 10,000 prisoners who were recently transferred from US custody. In a new report, Amnesty documents that Iraqi prisoners are being arbitrarily detained and often beaten to obtain forced confessions.\n\n\n- British Jamaican Rastafarian Writer, Dub Poet Benjamin Zephaniah on Poetry, Politics and Revolution\n\nIn London, the Prince of Wales Theatre was packed Sunday for a reading of the British production of The People Speak, a people's history of Britain inspired by the work of the late historian Howard Zinn. We speak to Rasta and performance poet Benjamin Zephaniah.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:888ba969eaba7bd363e69630c89e593601f36732","amp;dn":"Democracy+Now+-+20+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"888ba969eaba7bd363e69630c89e593601f36732","infoHashBuffer":{"type":"Buffer","data":[136,139,169,105,234,186,123,211,99,230,150,48,200,158,89,54,1,243,103,50]},"announce":[],"urlList":[]}}