{"title":"Democracy Now - 02 aug 2010","uid":5735219,"size":457282602,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:89d6de47dd3d84eec7324c8251d9636fddc82826&amp;dn=Democracy+Now+-+02+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Roys","files":1,"time":1280784885,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 2, 2010\n\n- Massive Flooding Kills Over 1,200 in Pakistan\n- Mullen: U.S. Military Has Plans To Attack Iran If Needed\n- Report: July Was Deadliest Month In Iraq Since May 2008\n- WikiLeaks Volunteer Detained, Questioned Over Afghan War Logs\n- Global Treaty Banning Cluster Bombs Goes Goes Into Force\n- Greenspan Opposes Keeping Bush's Tax Cuts on Wealthy\n- Life Insurance Firms Probed For Defrauding Families of Dead Soldiers\n- Rep. Maxine Waters To Face Ethics Trial\n- ADL Opposes Plan For Mosque Near Ground Zero\n- Mothers of Imprisoned Hikers Protest Outside Iranian Mission in NYC\n- FBI File on Howard Zinn Dates to 1949\n- Puerto Rican Nationalist Lolita Lebron, 90, Dies\n\n\nSpecial reports\n\n- Andrew Bacevich on Afghanistan War: &quot;The President Lacks the Guts to Get Out&quot;\n\nRetired U.S. army Colonel and historian Andrew Bacevich joins us for his first interview about his new book, Washington Rules: America's Path to Permanent War. &quot;The question demands to be asked: Who is more deserving of contempt?&quot; Bacevich asks. &quot;The commander-in-chief who sends young Americans to die for a cause, however misguided, in which he sincerely believes? Or the commander-in-chief who sends young Americans to die for a cause in which he manifestly does not believe and yet refuses to forsake?&quot;\n\n\n- '12th and Delaware' Offers Unique Inside Look at Struggle Between Abortion Clinic and Anti-Abortion Pregnancy Care Center\n\nA new documentary by the Oscar-nominated directors of &quot;Jesus Camp&quot; offers a rare inside look at the pitched battle over abortion rights that's being waged not just in Congress and the courts, but on the street corners of small-town America. One street corner in particular, where an abortion clinic and an anti-abortion pregnancy care center sit across the street from each other.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:89d6de47dd3d84eec7324c8251d9636fddc82826","amp;dn":"Democracy+Now+-+02+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d6de47dd3d84eec7324c8251d9636fddc82826","infoHashBuffer":{"type":"Buffer","data":[137,214,222,71,221,61,132,238,199,50,76,130,81,217,99,111,221,200,40,38]},"announce":[],"urlList":[]}}