{"title":"Coast to Coast AM - 07-18-10 - Paranormal &amp; Psychical Research","uid":5702904,"size":56471139,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:89da92e15dabc7d42deb9f3842ecd79f68828621&amp;dn=Coast+to+Coast+AM+-+07-18-10+-+Paranormal+%26+Psychical+Research&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1279575289,"description":"Date:\n\t\n\n07-18-10\n\nHost:\n\t\n\nGeorge Knapp\n\nGuests:\n\t\n\nJeffrey Kripal, Laura Leigh\n\nJeffrey Kripal, Chair of the Department of Religious Studies at Rice University, shared his historical analysis of paranormal and psychical research. Instead of evaluating the paranormal through science, he views it through the filter of religious or human experience. &quot;A lot of these paranormal experiences, including a lot of UFO encounters, are ultimately about consciousness and Mind, and they don't cut muster with the scientists because the scientific method needs a stable object...to measure and replicate,&quot; he explained.\n\nHe focused on the work of four major figures in the field: psychical researcher Frederic Myers; writer Charles Fort; astronomer and ufologist Jacques Vallee; and philosopher and sociologist Bertrand Meheust. Myers, one of the founders of the Society for Psychical Research (SPR), coined the term &quot;telepathy&quot; in 1882 from the Greek words telos and pathos, and attended hundreds of seances. Interestingly, Myers accumulated evidence of afterlife communications with a woman he'd been in love with, but the material was destroyed after his wife found out about it, Kripal reported. Myers also was first to suggest that psychical abilities could be linked to human evolution.\n\nCharles Fort, who could be considered the &quot;father of ufology,&quot; referred to UFOs as &quot;super constructions in the sky,&quot; and his books contained accounts of huge craft floating over cities, beaming down with searchlights. He also proposed that the dead might see the living as a ghostly or occult presence. In Vallee's groundbreaking books on UFOs, he was as hard on the skeptics as he was the true believers. &quot;The true believers are wrong because they mistake their perception for the stimulus that's really out there, and the skeptics are wrong because they deny that there's a stimulus out there,&quot; Kripal recounted.\nHorse Round-Up Update\n\nFirst hour guest, animal activist Laura Leigh talked about the recent wild horse round-up in Nevada by the BLM, and her lawsuit to stop it. The BLM claims that the horses are being rescued from lack of water, but Leigh said more horses are dying from the process of the round-up.\nWebsite(s):\n# authorsoftheimpossible.com\n# kripal.rice.edu\n#\nBook(s):\n# Authors of the Impossible: The Paranormal and the Sacred","torrent":{"xt":"urn:btih:89da92e15dabc7d42deb9f3842ecd79f68828621","amp;dn":"Coast+to+Coast+AM+-+07-18-10+-+Paranormal+%26+Psychical+Research","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89da92e15dabc7d42deb9f3842ecd79f68828621","infoHashBuffer":{"type":"Buffer","data":[137,218,146,225,93,171,199,212,45,235,159,56,66,236,215,159,104,130,134,33]},"announce":[],"urlList":[]}}