{"title":"Panchamugi[2010][Lotus DVD] Continuation of Arundati","uid":5902903,"size":3704193024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:89f14699383746b3939e11f66599b52f3bbbc204&amp;dn=Panchamugi%5B2010%5D%5BLotus+DVD%5D+Continuation+of+Arundati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nrsadri","files":4,"time":1287737777,"description":"Honey is an ultra moden city resident from a rich family. One day she dashes a young man Sriram who is stunned on looking her. He then follows her wherever she goes and takes video snaps which earns dislikes of Honey. But she understands the truth behind his act when she enocunters a photo of a woman who resembles like her named Panchakshari. Panchakshari is a woman who is believed to be a deity of her village. Sriram falls in love with Panchakshari and marries her and they both are blessed with a daughter. ON a day of Chitra poornima Panchakshari is possessed by the deity and it informs that Panchakshari will die shortly which happens immediately in front of all people of village, where fire suddenly engulfs her. Panchakshari's daughter becoms unconscious on seeing her mother dying . To make the girl gain her conscious back Sriram brings Honey to his daughter. Honey also visits the village.\nActually Panchakshari is killed in order to close and make people to stay away from temple to execute their plan of digging the treasure. Panchakshari possesses Honey and she challenges the killer that he will die on the Chitra poonima. The killer tries to eliminate the spirit but Panchakshari kills him finally","torrent":{"xt":"urn:btih:89f14699383746b3939e11f66599b52f3bbbc204","amp;dn":"Panchamugi%5B2010%5D%5BLotus+DVD%5D+Continuation+of+Arundati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89f14699383746b3939e11f66599b52f3bbbc204","infoHashBuffer":{"type":"Buffer","data":[137,241,70,153,56,55,70,179,147,158,17,246,101,153,181,47,59,187,194,4]},"announce":[],"urlList":[]}}