{"title":"STARGATE.SG-1.S08E06-09.SWESUB. -Lindoff.ISO","uid":5835871,"size":3112968192,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8a6c4bea6eb762b82f69e35c7bb8fc5d27c51b21&amp;dn=STARGATE.SG-1.S08E06-09.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1284722355,"description":"Season 8, Episode 6: Avatar\n\nDr. Lee and his team have modified one of the virtual reality chairs last seen in \n\n&quot;The Gamekeeper&quot; to host a combat simulation for training Stargate personnel. \n\nAfter claiming the simulation isn't realistic, Teal'c agrees to help the \n\nscientists refine it. Inside, he faces steadily mounting hazards. Worse, his own \n\nego prevents him from leaving until the last Goa'uld is destroyed. Each time he \n\ndies in the scenario, the chair shocks him. Teal'c must find a way past the \n\nbarriers of his own mind to escape before the virtual deaths sum to real fatality.\n\t\n\n\nSeason 8, Episode 7: Affinity\n\nTeal'c saves a young man from a vicious beating. This is just the latest in a \n\nseries of &quot;incidents&quot; since he took an apartment off-base and the Air Force is not \n\npleased. Daniel Jackson attempts to explain why and how to keep a low profile, but \n\nTeal'c cannot help getting involved with a young woman whose boyfriend abuses her. \n\nIn doing so he inadvertently plays into the hands of a mysterious group with \n\naccess to Stargate knowledge...\n\t\n\n\nSeason 8, Episode 8: Covenant\n\nOwner and CEO of Colson Industries declares in a press conference that there is \n\nalien life and that he has proof. SGC fails in its attempts to keep him quiet on \n\nthe battle over the Antarctic. However, they are greatly surprised when the proof \n\nhe shows the media are not his satellite images, but a living Asgard.\n\t\n\n\nSeason 8, Episode 9: Sacrifices\n\nTeal'c is unhappy with his son's plans to marry. Ishta arrives bringing news that \n\nHak'tyl may be compromised. Complications arise when O'Neill allows Hak'tyl to \n\ninhabit SGC until a new homeworld is found for them.","torrent":{"xt":"urn:btih:8a6c4bea6eb762b82f69e35c7bb8fc5d27c51b21","amp;dn":"STARGATE.SG-1.S08E06-09.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a6c4bea6eb762b82f69e35c7bb8fc5d27c51b21","infoHashBuffer":{"type":"Buffer","data":[138,108,75,234,110,183,98,184,47,105,227,92,123,184,252,93,39,197,27,33]},"announce":[],"urlList":[]}}