{"title":"Ozzy Osbourne - Crazy Babies (2nafish)","uid":5837777,"size":157595652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8a8c660a1b7d39c4a41a186f82eaffa728e54b55&amp;dn=Ozzy+Osbourne+-+Crazy+Babies+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284797316,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNo Rest for the Wicked is the fifth studio album by Ozzy Osbourne. It was released on October 22, 1988 and was re-issued / remastered on August 22, 1995 and again on June 25, 2002. The album was certified gold in December 1989 and has since gone double platinum. No Rest for the Wicked is the first album to feature Zakk Wylde on guitar. It peaked at number 13 on the Billboard 200. As of 2010, the album has sold over 2.5 million copies worldwide.\n\n&quot;Miracle Man&quot;, &quot;Crazy Babies&quot;, and &quot;Breaking All the Rules&quot; were released as singles with accompanying music videos.\n\nJohn Michael &quot;Ozzy&quot; Osbourne (born 3 December 1948) is a Grammy Award-winning English singer-songwriter whose career has spanned over 40 years.\n\nOsbourne initially rose to prominence as lead vocalist and part lyricist of the pioneering English heavy metal band Black Sabbath, a band whose radically different, intentionally dark, doom sound spearheaded the heavy metal genre. In his subsequent solo career Osbourne achieved a multi-platinum status in addition to the one he had earned with Black Sabbath. These things are what led Osbourne to become known as the &quot;Godfather of Heavy Metal&quot;. It was during his Sabbath days that, because of their dark style of music, Osbourne became known as the &quot;Prince of Darkness.&quot; Osbourne has over 15 tattoos, the most famous of which are the letters O-Z-Z-Y across the knuckles of his left hand. This was his first tattoo, created by himself as a teenager with a sewing needle and pencil lead.\n\nIn the early 2000s, Osbourne's career expanded to a new medium when he became a star in his own reality show, The Osbournes, alongside wife/manager Sharon and two of their three children, Kelly and Jack. As a solo artist, Osbourne has sold over 32 million albums worldwide.\n\nOsbourne is currently on a worldwide tour to promote his new album Scream, released on 22 June 2010.\n\nDespite only a modest investment from their US record label Warner Bros. Records, Black Sabbath met with swift and enduring success. Built around Tony Iommi 's guitar riffs, Geezer Butler 's lyrics, Bill Ward 's dark tempo drumbeats, and topped by Osbourne's eerie vocals, early records such as their debut album Black Sabbath and Paranoid  sold huge numbers, as well as getting considerable airplay. Osbourne's recalls a band lament, &quot;in those days, the band wasn't very popular with the women.&quot;\n\nJust six months after the release of Paranoid the band released Master of Reality. The album reached the top ten in both the US and UK, and was certified gold in less than two months. In the 1980s it received platinum certification and went Double Platinum in the early 21st century. Reviews of the album were unfavorable. Lester Bangs of Rolling Stone dismissed Master of Reality as &quot;naÃƒÂ¯ve, simplistic, repetitive, absolute doggerel&quot;, although the very same magazine would later place the album at number 298 on their 500 Greatest Albums of All Time list, compiled in 2003. Black Sabbath's Volume 4 was released in September 1972. Critics were again dismissive of the album, yet it achieved gold status in less than a month. It was the band's fourth consecutive release to sell a million copies in the US. In November 1973, Black Sabbath released the critically acclaimed Sabbath Bloody Sabbath. For the first time, the band received favourable reviews in the mainstream press. Gordon Fletcher of Rolling Stone called the album &quot;an extraordinarily gripping affair&quot;, and &quot;nothing less than a complete success&quot;. AllMusic's Eduardo Rivadavia call the album a &quot;masterpiece, essential to any heavy metal collection,&quot; while also claiming the band displayed &quot;a newfound sense of finesse and maturity&quot;. The album marked the band's fifth consecutive platinum selling album in the US,. Sabotage was released in July 1975. Again there were favourable reviews. Rolling Stone stated, &quot;Sabotage is not only Black Sabbath's best record since Paranoid, it might be their best ever.&quot; Allmusic was not so favorable. They noted that &quot;the magical chemistry that made such albums as Paranoid and Volume 4 so special was beginning to disintegrate&quot;. Technical Ecstasy, released on 25 September 1976, was also met with mixed reviews. AllMusic gave the album two stars, and noted that the band was &quot;unravelling at an alarming rate&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8a8c660a1b7d39c4a41a186f82eaffa728e54b55","amp;dn":"Ozzy+Osbourne+-+Crazy+Babies+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a8c660a1b7d39c4a41a186f82eaffa728e54b55","infoHashBuffer":{"type":"Buffer","data":[138,140,102,10,27,125,57,196,164,26,24,111,130,234,255,167,40,229,75,85]},"announce":[],"urlList":[]}}