{"title":"Bloods And Crips - Bagin On Wax (Music Video)","uid":5714689,"size":26017821,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8ab9c89851803379a0dfdb5376306073a286c48a&amp;dn=Bloods+And+Crips+-+Bagin+On+Wax+%28Music+Video%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"XHandHeld","files":1,"time":1280031904,"description":"Bloods And Crips - Bagin On wax (MUsic Video)\n\nOfficial Gangsta Music\n\nLyrics\n\n[GENUINE DRAFT a.k.a DOMINO]\nGenuine Draft with the Gat\nCan you see the Slob slippin' as I aim for the heart by connect with the level\nThat I'ma bust to this nigga now he's slippin'\nTwo to the head now if he ?toiled? like a Simpson\nNow them Snoops from them switch block\n?? with the Slobs on the muthafuckin' Crip track\nI don't know but he feels me when laughter\nSo peep this Crip shit for this bitch line Slob-ass nigga\n\n[LIL' STRETCH]\nFuck all these Crab niggas\nGuess what, guess who, Crab killa's back\nThe AK-47 mix with the maniac\nA nigga with a problem\nA nigga ain't back tight\nSo I'll be rollin' on these Crab niggas everynight\nCrip, Crip, Crip, buck buck, time to go off\nCrabs got throw off niggas to get hauled off\nCrab got lived it out, mixed out or ship it out\nTec-9 bullets for the hoes is still spittin' out\n\n[AWOL]\nWell if I'm not killin' a Snoop\nI'm runnin' from the police\nI'm at the spot just hangin' with the homies\nAin't no ?? where the Kelly is down for\nWhen I'm hangin' on 3-8 double O\nA homicide when a nigga ride\nAin't naythin' good about shit with dip out\nI kill a punk for the color is wearing\nAnd kill his bitch cause keep on staring\n\n[RED RAG]\nI throw low blows in elbows on low-lows ?? tight shit\nThat nigga Red Rag wreck it straight\nC-sick flavor like the rest of my peer\nI'm a magician and you punk Crab bitches are my trick\nYou Sissy muthafuckas stay heat out your ??\nYou wild up like the Ten Deuce Rice Cryspis\nKelly Park stay in Compton\nCause see you was a clip water\nSlay stay down lookin' ??\n\n[BLUE RAG]\nFuck it, it's time to catch your hands up\nPut the barrel of my Gauge in a Slob mouth with one shot\nBlowin' them brains out and watch this shatter\nIs splatter on the concrete\nAnother Slob\nAdded to my murder beat, I'm Blue Rag\nA Crip for life fool\nBangin' On Wax with a Charles Manson attitude\n\n[LIL' STRETCH]\nIn 1975\nA nigga was raised on the streets of Watts to survive\nWhere I live it was nuthin' but a living hell\nSo at the age of nine I rebel\nI was growin' up my mom was solo\nBut Crabs ?of piece?\nOut of niggas don't give a fuck\nRollin' with the street gang knockin' out Crabs\nCause it's an everyday muthafuckin' thang\n\n[SIN LOC]\nSin Loc - quick to put one in your forehead\nShootin' every muthafucka that I catch wearing red\nIt's only must ain't stoppin' this\nI gotta do it on wax\nSo I can put the caps in it\nAnd if you wanna knock the mind frame ???\nSin Loc'll have put a slug in your forehead\nAnd for the hood I'ma still keep stompin'\nEast Sider C Cuz, this is Compton\n\n[REDRUM 781]\nFour Crabs down and you know as soon to go\nNiggas gotta dump so I shoot 'em at the funeral\nI don't give a damn about another nigga's life\nI roll by and squeeze on a fuckin' trigga type\nPeople started to fall up a bitch's calling for the One-Time\nAimin' from his momma he better walk the chalk line\nAnd I'm servin' Crips to rest like a hoe cell\nFlue-ass fools are goin' down to a red hell\n\n\n\nEnjoy And seed.\n\nI will take requests for music videos or Music so leave a comment.","torrent":{"xt":"urn:btih:8ab9c89851803379a0dfdb5376306073a286c48a","amp;dn":"Bloods+And+Crips+-+Bagin+On+Wax+%28Music+Video%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ab9c89851803379a0dfdb5376306073a286c48a","infoHashBuffer":{"type":"Buffer","data":[138,185,200,152,81,128,51,121,160,223,219,83,118,48,96,115,162,134,196,138]},"announce":[],"urlList":[]}}