{"title":"Emerson, Lake and Palmer-Take A Pebble (Xvid-2nafish)","uid":5688898,"size":301010614,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8b7234e6d29b17b32dfe46c66508e4829e0de2d6&amp;dn=Emerson%2C+Lake+and+Palmer-Take+A+Pebble+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1278996419,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:12:58\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2772 Kbps\nQuality Factor : 0.24 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\n&quot;Take a Pebble&quot; is a song by theprogressive rock group Emerson, Lake &amp; Palmer. It is the second track of their eponymous debut album. It was written by Greg Lake.\n\nThe song starts as a soft ballad... On the original recording it begins with Keith Emerson holding down voicings on the piano keys (without having the hammers strike the notes) while strumming the grand piano strings with a plectrum, while Greg Lake enters on electric bass guitar, and Carl Palmer on subtle percussion;\n\nEmerson switches to fast Eb-Minor and F-Minor ascending and descending hand-over-hand piano runs (not to be confused with piano glissandos - See: Glissando) in the first 8 bars of the first &quot;A&quot; section (when Lake first enters singing &quot;Just take a pebble... And cast it to the sea&quot;, etc.);\n\nEmerson switches back to strumming the grand piano strings with a plectrum between the first and second &quot;A&quot; sections, while the bass and drums play;\n\nThen, Emerson improvises behind Lake's singing in the first 8 bars of the second &quot;A&quot; sections;\n\nA short piano interlude leads into a composed band jazz section - where the theme Lake has previously sung is developed and expanded much further;\n\nThen on the original recording, another piano interlude leads into strumming the grand piano strings;\n\nThe short Greg Lake folk-style acoustic guitar section that follows in the middle of the original recording (where Lake briefly switches from playing electric bass guitar, with Palmer playing water-like percussion sounds, then a rhythmic hoedown-like strummed guitar chord section, with hand-clapping on 2 and 4, followed by plucked guitar arpeggios), gives an idea of what the original style of song may have sounded like, before Emerson's arrangement of the majority of the piece;\n\nThen another piano interlude leads into a modal jazz band improvisation, followed by the &quot;head out&quot; and coda.\n\nThe jazz-style sections are reminiscent in some ways of Keith Emerson's late-1960s jazz-style adaptation for his band &quot;The Nice&quot; of &quot;Hang On To A Dream&quot; aka &quot;How Can We Hang On To A Dream? How Can We Hang On to a Dream?&quot; (composed by American folk musician Tim Hardin).\n\nIn later versions of &quot;Take A Pebble&quot;, the Greg Lake song &quot;Lucky Man (Emerson, Lake &amp; Palmer song)&quot; (and later, &quot;Still, You Turn Me On&quot; followed by &quot;Lucky Man&quot; - as recorded on Welcome Back My Friends to the Show That Never Ends... Ladies and Gentlemen) was added to the Greg Lake folk-style acoustic guitar section, followed by a solo Keith Emerson jazz and blues piano medley of tunes (that the band would join in on the very end of), followed by a &quot;Take A Pebble&quot; band improvisation moving between F-minor and Eb-Minor (often featuring Palmer on Timpani), and then the conclusion of the piece.\n\nThe Greg Lake folk-style acoustic guitar section and/or the format of inserting of other Greg Lake songs inside &quot;Take A Pebble&quot; was later completely dropped, and Emerson usually performs a shorter solo piano improvisation (not a medley of tunes) based on an F-minor ostinato, followed by the &quot;Take A Pebble&quot; band improvisation, and then the conclusion of the piece (as seen in the &quot;Emerson, Lake &amp; Palmer - Live at Montreux 1997&quot; DVD http://www.eaglerockent.com/eaglerockUSA/media_detail.php?media_id=554).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8b7234e6d29b17b32dfe46c66508e4829e0de2d6","amp;dn":"Emerson%2C+Lake+and+Palmer-Take+A+Pebble+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b7234e6d29b17b32dfe46c66508e4829e0de2d6","infoHashBuffer":{"type":"Buffer","data":[139,114,52,230,210,155,23,179,45,254,70,198,101,8,228,130,158,13,226,214]},"announce":[],"urlList":[]}}