{"title":"WEIDORJE - 1978 - Weidorje (Zeuhl)","uid":5728076,"size":359209028,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b928fbd054f5dc87e4b4bccab1faf88f1b35d76&amp;dn=WEIDORJE+-+1978+-+Weidorje+%28Zeuhl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"lonesomecowboy","files":-1,"time":1280538461,"description":"W E I D O R J E\n- Weidorje (1978) -\n\nWEIDORJE, formed in 1977 by two ex-MAGMA members, Bernard Paganotti and Patrick Gauthier (also keyboardist for HELDON, a group that featured Richard Pinhas) is one of Zeuhl's children, probably the most faithful and the closest musically and spiritually to MAGMA...\n\n...WEIDORJE's music will be :\n- same hypnotical power as MAGMA but more rock-based, more accessible at first listen even if by mistake (as was the case with MAGMA) the music was regarded as dark or even unhealthy despite the melodical beauty of the themes.\n- incantatory repeats with a powerful bass and put very forward, brass and MAGMA-esque voices (although lyrics are not in \tKobaÃƒÆ’Ã‚Â¯an they are a kind of Zheul scat)\n- polyrhythmicity in keyboard and guitar playing\n\nFor some people, WEIDORJE would be a follower to 'UDU WUDU', Bernard Paganotti forming his band just after MAGMA released this album. First and only album released in 1978, 'WEIDORJE', even if some new stuff was ready for a second album. But following difficulties to find a producer, WEIDORJE disbanded, although they were popular with the French audience. Initially constituted with three long tracks : 'ELOHIM's VOYAGE', 'VILNA' and 'BOOLDEMUG' on the Ep released for Cobra, two new tracks 'RONDEAU' and 'KOLINDA' appeared on the CD reedition by Musea in 1992 (these two tracks were released live with a bad sound but the bass solo is wonderful, waving between jazz-fusion and Zheul accents)...\n\nfrom Tauhd Zaia, FRANCE,\nhttp://www.progarchives.com/artist.asp?id=1075","torrent":{"xt":"urn:btih:8b928fbd054f5dc87e4b4bccab1faf88f1b35d76","amp;dn":"WEIDORJE+-+1978+-+Weidorje+%28Zeuhl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b928fbd054f5dc87e4b4bccab1faf88f1b35d76","infoHashBuffer":{"type":"Buffer","data":[139,146,143,189,5,79,93,200,126,75,75,204,171,31,175,136,241,179,93,118]},"announce":[],"urlList":[]}}