{"title":"Star.Trek.III.The.Search.for.Spock.1984.Bluray.720p.DTS.x264-CHD","uid":5855948,"size":4733925557,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8c6950a06778d4480bbca5e5fe4de60094fbd8cc&amp;dn=Star.Trek.III.The.Search.for.Spock.1984.Bluray.720p.DTS.x264-CHD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"avalonbss","files":-1,"time":1285615364,"description":"Star Trek III: The Search for Spock\n\nGenre: Action, Adventure, Sci-Fi, Thriller\nYear: 1984\nCountry: USA\nRuntime: 105 min\nDirector: Leonard Nimoy\nCast: William Shatner, Leonard Nimoy, DeForest Kelley, James Doohan, Walter Koenig, George Takei\n\n.: Plot :.\nWith most of the Enterprise's battle damage repaired after defeating Khan at Genesis, the ship's crew returns home to bad news from Starfleet Commander Morrow: the Enterprise is to be decommissioned. Even worse, Dr. McCoy begins acting bizarrely. A visit to Kirk from Sarek - Spock's father &amp; the Vulcan ambassador - reveals that McCoy is carrying Spock's Kattra, or living spirit. Immediately, Kirk meets with Admiral Morrow to plead for permission to return to Genesis and rescue Spock. When permission is denied, Kirk &amp; his crew steal the Enterprise and head for Genesis - by now a quarantined planet. Unknown to them, the Klingons, led by the psychopathic Commander Kruge, are planning to steal the secrets of Genesis for their own twisted purpose. The Enterprise is crippled in a fight with the Klingon ship, and worse, the Klingons murder Kirk's son, who was among the science team that rescued Spock. Kirk eliminates the remaining Klingons by tricking them aboard the Enterprise and then blowing it up with the auto-destruct, then steals the Klingon Bird of Prey and heads for Vulcan for a ceremony to re-fuse Spock's body and Kattra.\t\t","torrent":{"xt":"urn:btih:8c6950a06778d4480bbca5e5fe4de60094fbd8cc","amp;dn":"Star.Trek.III.The.Search.for.Spock.1984.Bluray.720p.DTS.x264-CHD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c6950a06778d4480bbca5e5fe4de60094fbd8cc","infoHashBuffer":{"type":"Buffer","data":[140,105,80,160,103,120,212,72,11,188,165,229,254,77,230,0,148,251,216,204]},"announce":[],"urlList":[]}}