{"title":"Yo.Soy.el.Amor[DVDS][Spanish]","uid":5917509,"size":1359169536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8c8703a89c4ce05e4a5bdd9144943a8bfff658aa&amp;dn=Yo.Soy.el.Amor%5BDVDS%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sonyds","files":1,"time":1288282304,"description":"Titulo: Yo Soy El Amor\nAÃƒÂ±o: 2010\nCategoria: Drama\nCalidad: DVDScreener/R5\nIdioma: espaÃƒÂ±ol\n\n\nEl cine es un campo de batalla (Samuel Fuller). El campo de batalla es la casa de los Recchi, llena de espejos, flores, dinero y frialdad. Emma y Tancredi, sus hijos Elisabetta, Edoardo y Gianluca, los companeros y prometidos de estos, los abuelos, el linaje y las futuras generaciones celebran entre habitaciones y pasillos, jardines cubiertos de nieve y las espaciosas cocinas de Villa Recchi la sucesion y entrega del negocio familiar y la consolidacion, una consolidacion progresiva de los papeles que cada vez es mas temida pues son conscientes de la clase a la que pertenecen la gran burguesia industrial de Lombardia. El joven cocinero Antonio, completamente ajeno a este mundo y no muy inclinado al compromiso, condensa emociones en platos que no deberian estar en la tradicion culinaria de la familia. Tanto Emma como Antonio son personajes que no encajan en el universo al que pertenecen y la pasion desemboca en una colision que hara que ambos rompan con todas las ataduras y entren en contacto directo con la naturaleza. Gracias a esto Antonio encuentra la inspiracion para sus creaciones; gracias a esto Emma consigue distanciarse y crear una nueva identidad. El precio a pagar es desorbitante y solo hay un remedio: el amor. \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:8c8703a89c4ce05e4a5bdd9144943a8bfff658aa","amp;dn":"Yo.Soy.el.Amor%5BDVDS%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c8703a89c4ce05e4a5bdd9144943a8bfff658aa","infoHashBuffer":{"type":"Buffer","data":[140,135,3,168,156,76,224,94,74,91,221,145,68,148,58,139,255,246,88,170]},"announce":[],"urlList":[]}}