{"title":"STARGATE.SG-1.S08E14-17.SWESUB. -Lindoff.ISO","uid":5845299,"size":2860023808,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8d141cdf725c926c3df96450c402dba4841c725d&amp;dn=STARGATE.SG-1.S08E14-17.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lindoff41","files":1,"time":1285147488,"description":"Season 8, Episode 14: Full Alert\n\nEx-Vice President Kinsey comes to Jack informing him of the Trust's activities \n\nincluding what seems to be a plan for the Russians to reclaim the Stargate they \n\nlent to the United States. He decides to use Kinsey as their inside man with the \n\nTrust. Kinsey wears a wire for his meeting with the Trust to set up a meeting with \n\na high-ranking Russian general. The plan goes south when the signals get jammed \n\njust as the Trust makes an astounding revelation to Kinsey and they beam out.\n\n\n\t\nSeason 8, Episode 15: Citizen Joe\n\nA man breaks into Jack's house and hold him at gunpoint claiming that Jack ruined \n\nhis life. Seven years ago he came upon an Ancient artifact at a garage sale that \n\nallows him to see all of SG-1's missions.\n\t\n\n\nSeason 8, Episode 16: Reckoning: Part 1\n\nWhen a goa'uld cargo ship is caught entering a neutral zone, it is learned that \n\nCarter is the pilot and is taken before the system lords. Then it is soon learned \n\nthat she is the replicator version and has launched an all out war against the \n\ngoa'uld. If the goa'uld can't stop the replicators, the replicators will overrun \n\nthe galaxy in a matter of weeks. Can the people of the Milky Way find a way to \n\nstop them or will the galaxy fall to an enemy worse than the goa'uld.\n\t\n\n\nSeason 8, Episode 17: Reckoning: Part 2\n\nThe replicators are taking over the galaxy and are killing off the goa'uld. The \n\nreplicators are becoming immune to any attack that is thrown at them. Then a way \n\nto destroy them is found: A weapon capable to destroy all life in the galaxy and \n\ndialing all the gates in the galaxy at once so that the replicators cannot adapt. \n\nThe device can be altered to only destroy the replicators. That is why Baal and \n\nthe real Carter join forces and the awesome battle for the galaxy begins.\n\t\n\n\n","torrent":{"xt":"urn:btih:8d141cdf725c926c3df96450c402dba4841c725d","amp;dn":"STARGATE.SG-1.S08E14-17.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d141cdf725c926c3df96450c402dba4841c725d","infoHashBuffer":{"type":"Buffer","data":[141,20,28,223,114,92,146,108,61,249,100,80,196,2,219,164,132,28,114,93]},"announce":[],"urlList":[]}}