{"title":"Honey West Disc 4","uid":5744888,"size":1430647808,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8d59ea1a15c7a24e4443e7889917fed2d0c0038d&amp;dn=Honey+West+Disc+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CharlieTann","files":1,"time":1281174800,"description":"As televisions first title roll female Private Eye, Honey West would take on any tough case. After the death of her father, the sexy private detective took over his high-tech PI firm. Being assisted by the rugged Sam Bolt and her pet ocelot Bruce, she could handle herself mingling with millionaires just as well as scaling a thirty foot wall.\n\nAnne Francis, John Ericson, Bruce the Ocelot\n\n\nDISC FOUR: \n\n&quot;Slay, Gypsy, Slay&quot; - written by Tony Barrett, directed by James Brown: A wealthy business man is kidnapped by a group of gypsies. Can Honey find him before its too late? John Ericson is hilarious in one scene disguised as an elderly man. There's also an amusing fight sequence with a gorilla. (25:27)\n\n&quot;The Fun-Fun Killer&quot; - written by Art Weingarten, directed by Murray Golden: Things turn deadly at a toy factory when a metallic robot turns to murder. TRIVIA FACT: The same robot would later show up, that same year, in the Gilligan's Island Season Two episode: &quot;Gilligan's Living Doll.&quot; (25:28)\n\n&quot;Pop Goes The Easel&quot; - teleplay by Lila Garrett &amp; Bernie Kahn, story by Gail Allen &amp; Chris Christensen, directed by James Brown: Aunt Meg has her can of chicken gumbo soup stolen at a supermarket in what appears to be a huge publicity stunt involving an eccentric painter. (25:26)\n\n&quot;Little Green Robin Hood&quot; - written by Ken Kolb, directed by Sidney Miller: A deluded jewel thief, who claims to be Robin Hood, preys on a rich woman...and charms Honey. Can she figure out this mystery? The episode features a homing beacon ring gadget. Eleanor Audley (the voice of Maleficent in Walt Disney's Sleeping Beauty) guest stars. (25:27)\n\n&quot;Just The Bear Facts, Ma'am&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by James Brown: Honey and Sam go undercover as stunt doubles on a movie set in order to discover the truth behind a woman's death. The episode features an amusing Silent Movie dream sequence. (25:16)\n\n&quot;There's A Long, Long, Fuse a Burning&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by Thomas Carr: An ex-con &amp; bomb expert is the police's prime suspect when a recent tirade of explosions begins to occur all over town. Dick Clark (American Bandstand) guest stars. (25:28)\n\n&quot;An Eerie, Airy, Thing&quot; - written by William Link &amp; Richard Levinson, directed by James Brown: An old war buddy of Sam's threatens to jump to his death unless his wife takes him back. (25:26)\n\nExtra Features:\nVintage Commercials - Sweeta Sweetener, Old Spice cologne (X2), El Producto cigars, PSA, High Sierra After Shave, Baby Magic Lotion, The United Way, Dippity-Do Setting Gel, White Rain Hairspray, Muriel cigars, Voyage To The Bottom of The Sea &amp; The FBI (X2) TV promos, Twelve O'Clock High + The Legend of Jesse James &amp; A Man Called Shenandoah, Breck Shampoo &amp; Hairspray, ABC TV Schedule by Honey West, TV Guide. 17 commercials total.\n\nTotal Running Time Approximately 189 Min.","torrent":{"xt":"urn:btih:8d59ea1a15c7a24e4443e7889917fed2d0c0038d","amp;dn":"Honey+West+Disc+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d59ea1a15c7a24e4443e7889917fed2d0c0038d","infoHashBuffer":{"type":"Buffer","data":[141,89,234,26,21,199,162,78,68,67,231,136,153,23,254,210,208,192,3,141]},"announce":[],"urlList":[]}}