{"title":"Penoza (2010) S01E01-S01E02 NL TV DMT","uid":5849182,"size":922611990,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8e019b8425c78876807a400db481befa348f8d12&amp;dn=Penoza+%282010%29+S01E01-S01E02+NL+TV+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Qiuckly","files":-1,"time":1285316780,"description":"[center][img]http://img39.imageshack.us/img39/7619/penozaflyeralg.jpg[/img]\nPenoza (2010) \n\nS01E01-S01E02\n\nGeorganiseerde misdaad is mannenwerk. Slechts een hoogst enkele keer dringt een vrouw door tot de top van een misdaadsyndicaat. De hoofdpersoon in deze serie, Carmen van Walraven de Rue (Monic Hendrickx), is zo?n vrouw. Maar de rol die ze verovert, is niet de rol die ze voor zichzelf in gedachten had. Opgegroeid als dochter van een Amsterdamse penoze kent ze het milieu als geen ander, maar voor haar kinderen heeft ze een andere toekomst in gedachten. Als Carmen er in de eerste aflevering achter komt dat haar man (Thomas Acda) een groter aandeel in de misdaad heeft dan ze voor zichzelf durft toe te geven, dwingt ze hem met de onderwereld te breken.\n\nNet als haar leven zich ten goede lijkt te keren, wordt haar man voor de ogen van hun jongste zoon geliquideerd. Het leven van Carmen verandert ingrijpend. Overal duiken schuldeisers op en bedreigingen aan haar adres volgen. Ook Justitie zet haar Verdietige Carmen met kinderen stevig onder druk; als zij getuigt tegen de compagnons van haar man garandeert Justitie haar bescherming. Carmen wil niet leven als beschermd getuige, ver weg van haar familie en ?vrienden?, en neemt daarom een drastisch besluit. Ze vecht zich een plek naar de top van de misdaad, waar niemand aan haar of haar gezin durft te komen. Alleen zo kan ze achterhalen wie verantwoordelijk is voor de dood van haar man. Maar al snel weet ze niet meer wie ze kan vertrouwen en vervagen de grenzen tussen goed en kwaad.\n\n\nCategorie : Beeld \nFormaat : DivX \nBron : TV DUTCH.WS.PDTV.XViD-DiFFERENT\nOndertitels : Geen\nGenre : Misdaad\nDrama\nTV Shows/Series\n  &lt;a href=&quot;\nhttp://www.kro.nl/penoza/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kro.nl/penoza/&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:8e019b8425c78876807a400db481befa348f8d12","amp;dn":"Penoza+%282010%29+S01E01-S01E02+NL+TV+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e019b8425c78876807a400db481befa348f8d12","infoHashBuffer":{"type":"Buffer","data":[142,1,155,132,37,199,136,118,128,122,64,13,180,129,190,250,52,143,141,18]},"announce":[],"urlList":[]}}