{"title":"Belladonna Slut [PORNO][HARDCORE]","uid":5866090,"size":1465462784,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8e2666a72b816fc256f0b1c0e9da23d7afefd88b&amp;dn=Belladonna+Slut+%5BPORNO%5D%5BHARDCORE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"zurera","files":-1,"time":1286176135,"description":"\nStarring:  Andy San Dimas,  Charley Chase,  Tara Lynn Foxx,  Charlotte Vale,  Amy Brooke,  James Deen,  John Strong,  Mark Ashley,  Mark Wood,  Mick Blue,  Mr. Pete.\nRated: XXX\nCategory: Double Penetration\nShips: Check Inventory\nRun Time: 163 min.\nReleased: 6/28/2010\nBy: Evil Angel\nDirector: Belladonna\n\nBelladonna Slut Movie\nBelladonna Slut Description: &quot;Belladonna Entertainment's Aiden Riley has written and directed a highly stylized, fetish-laden movie that evokes an Orwellian/alternative/industrial reality, while steadfastly clutching its sexual purpose. The willingness of &quot;the Sluts&quot; and &quot;the Fuckers&quot; redefines the boundaries performers will traverse for the sake of hardcore pornography. The graphic display of humiliation -- nipple tweaking, choking, deep-throating, cock-gagging, fingering, dildo insertion, double penetration, orifice stretching, gaping anuses, anal-squirting, spanking, anal sex and cum-swallowing -- should divest us of any fear that the sex is sacrificed for the style. Despite the bounty of intense sucking and fucking, there's plenty of drama. The premise is a six-step primer in how to prepare a slut for proper carnal presentation. The setting is a cold cinderblock prison with a decidedly harsh medical experimentation component, thanks to Belladonna and her rough assistants. In each scene we're treated to a slo-mo &quot;tease&quot; sequence of the slut to highlight her freshly watered body, and in Charley Chase's case, her delectable bouncing boobs. The tease segments are fueled by industrial-trance beats and an occasional classical music interlude for ironic effect. Dressed in surgical scrubs and masks, Belladonna and the faceless guards deliver the sluts, pulled from their cells one at a time, to the interrogation room (a concrete cell). Naked but for their wrist and ankle shackles, the sluts meet their waiting fuckers (two at a time in five of the six scenes). Each slut is an object lesson in one of the six steps of slut preparation: &quot;finding the slut; training the slut; stretching the slut; feeding the slut; cleaning the slut,&quot; and last, &quot;selling the fucking slut.&quot; The opening voice-over explains the moral of the story: &quot;...A slut is a girl who lives for the fuck. She breathes fuck, eats fuck and shits fuck. Her life is fuck. She is, was and always will be SLUT!&quot;&quot; ","torrent":{"xt":"urn:btih:8e2666a72b816fc256f0b1c0e9da23d7afefd88b","amp;dn":"Belladonna+Slut+%5BPORNO%5D%5BHARDCORE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e2666a72b816fc256f0b1c0e9da23d7afefd88b","infoHashBuffer":{"type":"Buffer","data":[142,38,102,167,43,129,111,194,86,240,177,192,233,218,35,215,175,239,216,139]},"announce":[],"urlList":[]}}