{"title":"[PS3].Virtua.Fighter.5.[2007].EUR.PS3-NextLevel.iso","uid":5841847,"size":4289855488,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:8e5484914ce9f149f21d18758c2341225dae649a&amp;dn=%5BPS3%5D.Virtua.Fighter.5.%5B2007%5D.EUR.PS3-NextLevel.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tomasz81","files":1,"time":1284992421,"description":"Virtua Fighter 5 is the latest game in Sega's Virtua Fighter series and direct sequel to Virtua Fighter 4: Evolution. The original version was released on July 12, 2006 into Japanese arcades. A revised version (called &quot;Version B&quot;) was ported on the PlayStation 3 on February 20, 2007 (despite the advertised date of February 23) and was a launch title for the console's European release on March 23, 2007. The Xbox 360 port of arcades' &quot;Version C&quot;, was released in February 2007 in North America and October 2007 in Europe.\nThrow speed has been reduced, from 8 frames to 12 frames. In addition, &quot;Instant&quot;, or 0-frame throws re-appear from Virtua Fighter 3 in guaranteed throw situations (such as during an evade).\nTo encourage a more &quot;moral&quot; style of play, Sega introduce the Clash System: when initiated with the right timing, an attack can be canceled out with a throw, creating a clash and leaving both players at +0 frame advantage (neutral).\nOffensive Move: pressing Punch + Kick + Guard during an evade will initiate an angled forward dash. In addition, pressing Punch or Kick during OM will initiate an attack which can lead to side or back stagger or crumple, leading to a guaranteed combo opportunity.\nThe Xbox 360 version introduced online support via Xbox Live, which allowed two players from around the world to battle over the internet. Developers have also suggested that the PS3 version could also be online-enabled in the form of a downloadable patch. This was later discounted by Sega's Jay Boor who told : &quot;at this time SEGA has no plans to release a patch for the PS3 version of Virtua Fighter 5.&quot;\nVersion C of Virtua Fighter 5 was used for the 360 version which fixed up some gameplay issues, while the PS3 version used version B.\nDifferent items are available in the Xbox 360 port of the game in Quest mode, as it is based upon Version C.\nOn January 16, 2008 the Xbox 360 version received an update, which made improvements and changes to online play and quest mode.","torrent":{"xt":"urn:btih:8e5484914ce9f149f21d18758c2341225dae649a","amp;dn":"%5BPS3%5D.Virtua.Fighter.5.%5B2007%5D.EUR.PS3-NextLevel.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e5484914ce9f149f21d18758c2341225dae649a","infoHashBuffer":{"type":"Buffer","data":[142,84,132,145,76,233,241,73,242,29,24,117,140,35,65,34,93,174,100,154]},"announce":[],"urlList":[]}}