{"title":"Ghostbusters 2","uid":5710206,"size":4536016896,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8e7634da3d1f24e918f29833013b422baee3a402&amp;dn=Ghostbusters+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiagofavi2612","files":1,"time":1279862806,"description":"Desde a batalha contra Gozer jÃƒÂ¡ se passaram cinco anos. Uma ordem judicial proibiu que Peter Venkman (Bill Murray), Ray Stantz (Dan Aykroyd), Egon Spengler (Harold Ramis) e Winston Zeddemore (Ernie Hudson) trabalhassem como caÃƒÂ§a-fantasmas e, como resultado, tiveram que arrumar outros trabalhos. Assim Ray ÃƒÂ© dono da Rays, uma pequena livraria especializada em livros mÃƒÂ­sticos, e com Winston se apresenta em festas de aniversÃƒÂ¡rios de crianÃƒÂ§as. Egon conduz experimentos para o instituto de pesquisa teÃƒÂ³rica avanÃƒÂ§ada e Peter ÃƒÂ© o apresentador do Mundo PsÃƒÂ­quico, um programa de televisÃƒÂ£o. Dana Barrett (Sigourney Weaver) rompeu com Peter e se casou, mas jÃƒÂ¡ estÃƒÂ¡ divorciada e tem um filho com oito meses, Oscar (William T. Deutschendorf), trabalhando no momento no departamento de restauraÃƒÂ§ÃƒÂ£o do Museu de Arte de Manhattan. AtÃƒÂ© que coisas estranhas comeÃƒÂ§am a acontecer, como quando o carrinho de bebÃƒÂª de Oscar anda sozinho e pÃƒÂ¡ra no meio da 1Ã‚Âª Avenida. Enquanto isso Janosz Poha (Peter MacNicol), o chefe de Dana, estÃƒÂ¡ restaurando uma pintura do sÃƒÂ©culo XVI do PrÃƒÂ­ncipe Vigo (Wilhelm von Homburg), um soberano dos CÃƒÂ¡rpatos e da MoldÃƒÂ¡via e um tirano louco e genocida. Sua pintura acaba ganhando vida, pois Vigo quer viver outra vez atravÃƒÂ©s do corpo de Oscar. Vigo controla completamente Janosz e lhe ordena que consiga que Dana coopere com seus planos. Janosz, por sua vez, tem seus planos, pois quer Dana por estar apaixonado por ela. Peter, Ray e Egon tentam ajudar Dana, mas sÃƒÂ£o presos e levados a julgamento por violarem uma ordem, sendo que jÃƒÂ¡ tinham sido condenados por um juiz que nÃƒÂ£o acreditava em nada sobrenatural. Mas quando os fantasmas dos IrmÃƒÂ£os Scoleri (que quando vivos eram assassinos) aparecem no tribunal o juiz fica apavorado, pois ele tinha condenado os irmÃƒÂ£os ÃƒÂ  cadeira elÃƒÂ©trica. EntÃƒÂ£o ÃƒÂ© revogada a ordem que proibia Peter, Ray e Egon de serem caÃƒÂ§a-fantasmas e assim a firma ÃƒÂ© reaberta.","torrent":{"xt":"urn:btih:8e7634da3d1f24e918f29833013b422baee3a402","amp;dn":"Ghostbusters+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e7634da3d1f24e918f29833013b422baee3a402","infoHashBuffer":{"type":"Buffer","data":[142,118,52,218,61,31,36,233,24,242,152,51,1,59,66,43,174,227,164,2]},"announce":[],"urlList":[]}}