{"title":"Call of Duty World at War [PC-DVD][Multi5][Spanish][www.consolas","uid":5868793,"size":7825391970,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8f222824f09e122a34940be5bf883d742a249a85&amp;dn=Call+of+Duty+World+at+War+%5BPC-DVD%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":4,"time":1286386231,"description":"Call of Duty: World at War es un videojuego de disparos en primera persona desarrollado por Treyarch y publicado por Activision para Microsoft Windows, PlayStation 3, Wii, Xbox 360, Nintendo DS, y PlayStation 2.Es el quinto tÃƒÂ­tulo de la serie Call of Duty. El juego retorna a la Segunda Guerra Mundial, despuÃƒÂ©s del entorno moderno del tÃƒÂ­tulo anterior Modern Warfare. Se enfoca en el teatro de la guerra del PacÃƒÂ­fico y en a el frente oriental de la Segunda Guerra Mundial en la versiÃƒÂ³n de Windows, PS3, Wii y Xbox 360. El tÃƒÂ­tulo, detalles del juego y la fecha estimada de lanzamiento fueron anunciadas el 23 de junio de 2008 y el juego fue lanzado mundialmente el 11 de noviembre y el 14 de noviembre de 2008. Se realizaron diferentes argumentos en las versiones de PS2 y Nintendo DS, pero permanecÃƒÂ­an en el ambiente de la Segunda Guerra Mundial. El juego usa una versiÃƒÂ³n mejorada del motor de juego de Modern Warfare con desarrollado incrementado en efectos de audio.\n\nLa historia para PC, PS3, Wii y Xbox 360 se desarrolla en las batallas finales de la Segunda Guerra Mundial en el PacÃƒÂ­fico y Europa occidental involucrando a los Estados Unidos, el Imperio de JapÃƒÂ³n, la UniÃƒÂ³n SoviÃƒÂ©tica, y la Alemania Nazi.[2] EstÃƒÂ¡ contado desde las perspectivas de un Marine Raider y un soldado del EjÃƒÂ©rcito Rojo, y estÃƒÂ¡ basado en varias batallas histÃƒÂ³ricas, incluyendo la incursiÃƒÂ³n a la isla Makin, la batalla de Stalingrado, la batalla de Peleliu, y la batalla de BerlÃƒÂ­n. La porciÃƒÂ³n multijugador del juego contiene varios modos de juego, y contiene un sistema de niveles que permite al jugador desbloquear armas y recompensas adicionales mientras progresa, el cual ya fue usado en Call of Duty 4: Modern Warfare. Una nueva caracterÃƒÂ­stica aportada a la saga Call of Duty es el modo cooperativo, que soporta hasta cuatro jugadores en lÃƒÂ­nea y dos desconectados.\n\nEl juego fue el segundo mÃƒÂ¡s vendido de noviembre de 2008 en los Estados Unidos con mÃƒÂ¡s de 1.41 millones de unidades vendidas y vendiÃƒÂ³ el doble de unidades en el Reino Unido en su primera semana comparado a Modern Warfare volviÃƒÂ©ndose el tercer videojuego mÃƒÂ¡s rÃƒÂ¡pidamente vendido en el Reino Unido. RecibiÃƒÂ³ una mezcla de crÃƒÂ­ticas. Algunos criticaron el regreso a la Segunda Guerra Mundial y no mejorar sobre Modern Warfare, mientras que otros elogiaron su representaciÃƒÂ³n del lado crudo y oscuro de la guerra. TambiÃƒÂ©n fue criticado por saltar aÃƒÂ±os en el argumento, pero fue elogiado por el nuevo modo cooperativo introducido.\n","torrent":{"xt":"urn:btih:8f222824f09e122a34940be5bf883d742a249a85","amp;dn":"Call+of+Duty+World+at+War+%5BPC-DVD%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f222824f09e122a34940be5bf883d742a249a85","infoHashBuffer":{"type":"Buffer","data":[143,34,40,36,240,158,18,42,52,148,11,229,191,136,61,116,42,36,154,133]},"announce":[],"urlList":[]}}