{"title":"Bulletin of Concerned Asian Scholars 1968-2000","uid":5882811,"size":647872915,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9170cbd8bc86c8068103a89a0b761d4b0b51c84a&amp;dn=Bulletin+of+Concerned+Asian+Scholars+1968-2000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"asc11","files":130,"time":1286896501,"description":"Get the .pdf files here via torrent, or else download directly:\ncriticalasianstudies.org/bcas/back-issues.html\n\n===================================================================\n                       CCAS Statement of Purpose\n  \nCritical Asian Studies continues to be inspired by the statement of purpose\nformulated in 1969 by its parent organization, the Committee of Concerned\nAsian Scholars (CCAS). CCAS ceased to exist as an organization in 1979,\nbut the BCAS board decided in 1993 that the CCAS Statement of Purpose\nshould be published in our journal at least once a year.\nWe first came together in opposition to the brutal aggression of\nthe United States in Vietnam and to the complicity or silence of\nour profession with regard to that policy. Those in the field of\nAsian studies bear responsibility for the consequences of their\nresearch and the political posture of their profession. We are\nconcerned about the present unwillingness of specialists to speak\nout against the implications of an Asian policy committed to ensuring\nAmerican domination of much of Asia. We reject the legitimacy\nof this aim, and attempt to change this policy. We\nrecognize that the present structure of the profession has often\nperverted scholarship and alienated many people in the field.\nThe Committee of Concerned Asian Scholars seeks to develop a\nhumane and knowledgeable understanding of Asian societies\nand their efforts to maintain cultural integrity and to confront\nsuch problems as poverty, oppression, and imperialism. We realize\nthat to be students of other peoples, we must first understand\nour relations to them.\nCCAS wishes to create alternatives to the prevailing trends in\nscholarship on Asia, which too often spring from a parochial\ncultural perspective and serve selfish interests and expansionism.\nOur organization is designed to function as a catalyst, a\ncommunications network for both Asian and Western scholars, a\nprovider of central resources for local chapters, and a community\nfor the development of anti-imperialist research.\n  \nPassed, 28--30 March 1969\nBoston, Massachusetts\n","torrent":{"xt":"urn:btih:9170cbd8bc86c8068103a89a0b761d4b0b51c84a","amp;dn":"Bulletin+of+Concerned+Asian+Scholars+1968-2000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9170cbd8bc86c8068103a89a0b761d4b0b51c84a","infoHashBuffer":{"type":"Buffer","data":[145,112,203,216,188,134,200,6,129,3,168,154,11,118,29,75,11,81,200,74]},"announce":[],"urlList":[]}}