{"title":"Radio 2 Comedy Season - All Round Bob Monkhouse - Audio Comedy -","uid":5720602,"size":54127013,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:91adcfff4c26498ec3d7476c4b2295b7ba4b5015&amp;dn=Radio+2+Comedy+Season+-+All+Round+Bob+Monkhouse+-+Audio+Comedy+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"_Slimoo_","files":1,"time":1280276941,"description":"All Round Bob Monkhouse - Audio Comedy - BBC Radio 2 \n1 x 60 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nFor the first time, we hear the real story behind a giant of comedy, as Bob's friend Barry Cryer celebrates the fascinating life of a consummate professional, whose public persona never once revealed his private heartaches.\n\nStar of film, TV and radio, stand up comedian, game show presenter, joke writer for Bob Hope - the list goes on and this programme will showcase examples of all of them as Barry profiles Bob's remarkable career and contrasts it with his personal problems off stage and screen.\n\nBob was one of the best stand-up comedians of his generation but to many he was king of the game show. Along with Bruce Forsyth, he made the genre his own. He had a gift for putting people at their ease whilst remaining completely in control of events\n\nThe programme examines Bob the actor - noting appearances in everything from the very first Carry On film, through sitcom, to an episode of Jonathan Creek. Barry also recalls how in 1979 his classic comedy film collection landed him in court and how he made the news again, a few years later, when his joke books were stolen!\n\nBehind the famous smile, Bob's private life was sometimes turbulent and this programme traces his off-screen tribulations, and examines, with some of those who worked with him at the time, his bravery in front of the cameras.\n\nThe programme includes classic clips of Bob in action, new interviews, and archive interviews with Bob himself from the BBC extensive collection. Contributors including Denis Norden, Bradley Walsh, Anita Harris, Ted Robbins, Sheila Steafel, Jimmy Cricket, and Tom Edwards (Bob's friend and voiceover man on Wipeout) are united by one word throughout - genius.\n\n\nAll Round Bob Monkhouse\n\n\nAudio Format    : MP3\nDuration        : 54mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:91adcfff4c26498ec3d7476c4b2295b7ba4b5015","amp;dn":"Radio+2+Comedy+Season+-+All+Round+Bob+Monkhouse+-+Audio+Comedy+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91adcfff4c26498ec3d7476c4b2295b7ba4b5015","infoHashBuffer":{"type":"Buffer","data":[145,173,207,255,76,38,73,142,195,215,71,108,75,34,149,183,186,75,80,21]},"announce":[],"urlList":[]}}