{"title":"Kiss - Let's Put The X In Sex (2nafish)","uid":5735849,"size":196927492,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:922b50b4b7e79a822a180f0fe7394e813c23e952&amp;dn=Kiss+-+Let%5C%27s+Put+The+X+In+Sex+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280812230,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nSmashes, Thrashes &amp; Hits is a greatest hits album by the American hard rock band Kiss. It was the third hits album overall but the second such album released by the band in the United States (Killers  was not released in the United States originally). Of the 15 songs on the album, two were new compositions and three were released after the band's unmasking in 1983. The remaining ten were all released during the band's years in makeup.\n\nIt was certified 2x Platinum on February 26, 1996, when it sold 2,000,000 copies, Kiss' only album of the non-makeup era to achieve that RIAA status officially.\n\nThe two new songs on Smashes, Thrashes &amp; Hits were &quot;Let's Put The X In Sex&quot; and &quot;(You Make Me) Rock Hard,&quot; which feature the same polished production style as 1987's Crazy Nights. They were both produced and co-written by guitarist/vocalist Paul Stanley, and were accompanied by videos that received moderate airplay on MTV.\n\nNearly all of the songs recorded by the band's original lineup were altered in one way or another. One song, &quot;Beth,&quot; was re-recorded with lead vocals by then-drummer Eric Carr, who had replaced the original drummer Peter Criss in 1980.\n\nKiss, often written as KISS, is an American hard rock band formed in New York City in January 1973. Easily identified by its members' face paint and flamboyant stage outfits, the group rose to prominence in the mid to late 1970s on the basis of their elaborate live performances, which featured fire breathing, blood spitting, smoking guitars, and pyrotechnics. Kiss has been awarded 24 gold albums to date in the USA. The band has sold over 19 million albums in the United States (according to the RIAA), and their worldwide sales exceeded 100 million albums.\n\nThe 1973-'80 lineup of Paul Stanley (vocals and rhythm guitar), Gene Simmons (vocals and bass guitar), Ace Frehley (lead guitar and vocals), and Peter Criss (drums, percussion and vocals) is the most successful and identifiable. With their makeup and costumes, they took on the personae of comic book-style characters: The Demon (Simmons), Starchild (Stanley), Spaceman (Frehley), and Catman (Criss). The band explains that the fans were the ones who ultimately chose their makeup designs. The &quot;Demon&quot; makeup reflected Simmons's cynicism and dark sense of humor, as well as his affection for comic books. Paul Stanley became the &quot;Starchild&quot; because of his tendency to be referred to as the &quot;starry-eyed lover&quot; and &quot;hopeless romantic.&quot; Ace Frehley's &quot;Spaceman&quot; makeup was a reflection of his fondness for science fiction and supposedly being from another planet. Peter Criss's &quot;Catman&quot; makeup was in accordance with the belief that Criss had nine lives because of his rough childhood in Brooklyn. Because of creative differences, both Criss and Frehley were out of the group by 1982. The band's commercial fortunes had also waned considerably by that point.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:922b50b4b7e79a822a180f0fe7394e813c23e952","amp;dn":"Kiss+-+Let%5C%27s+Put+The+X+In+Sex+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"922b50b4b7e79a822a180f0fe7394e813c23e952","infoHashBuffer":{"type":"Buffer","data":[146,43,80,180,183,231,154,130,42,24,15,15,231,57,78,129,60,35,233,82]},"announce":[],"urlList":[]}}