{"title":"Video Cache View v 1.72","uid":5925581,"size":96097,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:92bcbe37b38eea90e4876b7e81e53057f72dd5aa&amp;dn=Video+Cache+View+v+1.72&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KlixXxo","files":4,"time":1288593947,"description":"Description\n===========\n\nAfter watching a video in a Web site, you may want to save the video file\ninto your local disk for playing it offline in the future. If the video\nfile is stored in your browser's cache, this utility can help you to\nextract the video file from the cache and save it for watching it in the\nfuture.\nIt automatically scans the entire cache of Internet Explorer and\nMozilla-based Web browsers (Including Firefox) and finds all video files\nthat are currently stored in it. It allows you to easily copy the cached\nvideo files into another folder for playing/watching them in the future.\nIf you have a movie player that is configured to play flv files, it also\nallows you to play the video directly from your browser's cache.\n\nWith VideoCacheView, you can easily save the downloaded .flv files of\nmany popular video sharing sites, like YouTube, Metacafe, Putfile, and\nmore...\n\nUsing VideoCacheView\n====================\n\nVideoCacheView doesn't require any installation process or additional DLL\nfiles. In order to start using it, simply run the executable file\n(VideoCacheView.exe)\nAfter running VideoCacheView, it scan the cache folders of your Internet\nExplorer and Mozilla browsers, as well as the temporary folder of\nWindows. Wait 5 - 30 seconds until the scanning process is finished, and\nthe main window of VideoCacheView should display all the video files that\nare currently in cache.\n\nAfter the video list is displayed, you can use one of the following\noptions, assuming that the video files are stored in the cache ('In\nCache' = Yes):\n* Play Selected File: Allows you to play the video file directly from\nthe cache, assuming that you have a video player that is configured to\nplay .flv files.\n* Copy Selected Files To: Allows to copy the video files from the cache\ninto another folder, so you will be able to play them in the future.\n\nIf you have a video file that is not stored in the cache ('In Cache' =\nNo), you can use the 'Open Download URL In Browser' option (F8) in order\nto download the video file. You can also use the 'Copy Download URLs'\noption (Ctrl+U) to copy the download URLs to the clipboard, and then use\nthen in your browser or in other download software.\nBe aware that some Web sites may not allow you to download a video file\nin this way.","torrent":{"xt":"urn:btih:92bcbe37b38eea90e4876b7e81e53057f72dd5aa","amp;dn":"Video+Cache+View+v+1.72","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92bcbe37b38eea90e4876b7e81e53057f72dd5aa","infoHashBuffer":{"type":"Buffer","data":[146,188,190,55,179,142,234,144,228,135,107,126,129,229,48,87,247,45,213,170]},"announce":[],"urlList":[]}}