{"title":"Fairy Tail 1Ã‚Âª Temporada.rar","uid":5877307,"size":4041746965,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:930ea2addd11c52d62ed9cc666ddcc4bc1b64525&amp;dn=Fairy+Tail+1%C3%82%C2%AA+Temporada.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marsobrio","files":1,"time":1286689385,"description":"   A sÃƒÂ©rie de Fairy Tail gira em torno das aventuras de seus protagonistas, Lucy e Natsu, tendo o gato falante Happy como coadjuvante.Lucy Heartphillia ÃƒÂ© uma jovem maga de 17 anos que deseja tornar-se uma maga evoluÃƒÂ­da. Para isso, ela terÃƒÂ¡ que entrar em uma guilda  de magos,para ganhar dinheiro, sobreviver e tambÃƒÂ©m aprimorar suas habilidades. Ela chega atÃƒÂ© a cidade de Harujion, onde Natsu Dragneel e Happy desembarcam para procurar Igneel, o dragÃƒÂ£o  que criou Natsu como se fosse um filho, e que um dia, repentinamente, sumiu. Lucy, encontra Natsu e Happy ocasionalmente,\napÃƒÂ³s se envolverem com um perigoso criminoso que tenta transformar Lucy em sua escrava. ApÃƒÂ³s salvar Lucy, Natsu, que ÃƒÂ© mago de uma das guildas maisfamosas, a Fairy Tail, convida a garota a juntar-se a guilda. Assim, Lucy entra para a Fairy Tail, onde comeÃƒÂ§a a viver todo tipo de missÃƒÂ£o perigosa junto com Natsu e Happy A histÃƒÂ³ria se passa em um lugar conhecido como Mundo MÃƒÂ¡gico, uma terra onde a magia ÃƒÂ© usada em larga escala e os magos gozam de um alto status. Para organizar e facilitar a vida dos magos, surgem as guildas, organizaÃƒÂ§ÃƒÂµes de magos controladas pelo Conselho que, por sua vez, controlado pelo governo.\n   Uma guilda funciona como uma agÃƒÂªncia de empregos: um cliente encomenda um serviÃƒÂ§o, um mago escolhe este serviÃƒÂ§o e se o completar com sucesso recebe uma recompensa que varia de acordo com a periculosidade e grau de dificuldade da &quot;missÃƒÂ£o&quot;. PorÃƒÂ©m, assim como existem guildas pacÃƒÂ­ficas como a Fairy Tail, tambÃƒÂ©m existem guildas de mercenÃƒÂ¡rios, com fins e objetivos escusos.\n","torrent":{"xt":"urn:btih:930ea2addd11c52d62ed9cc666ddcc4bc1b64525","amp;dn":"Fairy+Tail+1%C3%82%C2%AA+Temporada.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"930ea2addd11c52d62ed9cc666ddcc4bc1b64525","infoHashBuffer":{"type":"Buffer","data":[147,14,162,173,221,17,197,45,98,237,156,198,102,221,204,75,193,182,69,37]},"announce":[],"urlList":[]}}