{"title":"Democracy Now - 15 sep 2010","uid":5833374,"size":451670474,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:939738f7e396bc9c84e551a744c3ec0025b82ad5&amp;dn=Democracy+Now+-+15+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1284644433,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 15, 2010\n\n- Sarah Shourd Freed from Iranian Prison\n- Tea Party-Backed O'Donnell Wins Senate GOP Nod in Delaware; Rangel Wins Renomination\n- 12 Killed Amidst Record Month for US Drone Strikes in Pakistan\n- Verdict Delayed in Trial for Anti-Drone Protest\n- US Forces Battle Iraqi Militants\n- UN: Despite Decline, Chronic Hunger Levels &quot;Unacceptable&quot;\n- Ban Defends MDG Goals as UN General Assembly Begins\n- Jury Selection Begins in Blackwater Trial\n\n\nSpecial reports\n\n- Final Primaries Held Before November Midterms, Tea Party Gains Ground in GOP\n\nThe final primaries before the November elections were held Tuesday in seven states and the District of Columbia. In Delaware, tea party-backed candidate Christine O'Donnell scored an upset by winning the Republican Senate nomination. In New York, tea party-backed Republican candidate Carl Paladino beat former Rep. Rick Lazio. We speak with Will Bunch, senior writer at the Philadelphia Daily News and author of The Backlash: Right-Wing Radicals, High-Def Hucksters, and Paranoid Politics in the Age of Obama.\n\n\n- Right Livelihood Award Celebrates 30th Anniversary with Gathering of Laureates in Bonn\n\nWe broadcast from Bonn, Germany, where the thirtieth anniversary of the Right Livelihood Awards is being held. The Right Livelihood Award was established in 1980 to honor and support those &quot;offering practical and exemplary answers to the most urgent challenges facing us today.&quot; It has become widely known as the &quot;Alternative Nobel Prize,&quot; and there are now 137 laureates from fifty-eight countries. We speak with Jakob von Uexkull, the founder of the Right Livelihood Award.\n\n\n- Another 9/11 Anniversary: September 11, 1973, When US-Backed Pinochet Forces Took Power in Chile\n\nWhile memorials were held across the US for the ninth anniversary of 9/11, we remember another 9/11: September 11th, 1973, when Salvador Allende, the democratically elected president of Chile, died in the palace as US-backed Pinochet forces rose to power. We speak with Juan GarcÃƒÂ©s, a personal adviser to Allende. He was the sole adviser to survive the coup and its aftermath.\n\n\n- From &quot;Little Tibet&quot; to Kenya, Right Livelihood Laureates Fight for Peace and Social Justice\n\nWe speak with two Right Livelihood laureates, Mohammad Hasnain of the Ladakh Ecological Development Group of India, which won the award for &quot;preserving the traditional culture and values of Ladakh against the onslaught of tourism and development,&quot; and Dekha Ibrahim Abdi of Kenya, who won for &quot;showing in diverse ethnic and cultural situations how religious and other differences can be reconciled, even after violent conflict, and knitted together through a cooperative process that leads to peace and development.&quot;\n\n\n- France Comes Under Mounting Pressure over Mass Deportation of Roma\n\nThe French government of Nicolas Sarkozy is coming under mounting pressure over the mass deportation of Roma, or Gypsies. Since late July, France has deported more than 1,000 people to Romania and Bulgaria. On Tuesday, the European Union's Justice Commissioner, Viviane Reding, urged the EU to take legal action against France for violating EU laws that ban discrimination against any ethnic group or nationality. We speak with AndrÃƒÂ¡s BirÃƒÂ³, the founder of the Hungarian Foundation for Self-Reliance.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:939738f7e396bc9c84e551a744c3ec0025b82ad5","amp;dn":"Democracy+Now+-+15+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"939738f7e396bc9c84e551a744c3ec0025b82ad5","infoHashBuffer":{"type":"Buffer","data":[147,151,56,247,227,150,188,156,132,229,81,167,68,195,236,0,37,184,42,213]},"announce":[],"urlList":[]}}