{"title":"Lene Lovich - Blue Hotel (2nafish)","uid":5736705,"size":136716292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:93b35675b21ee9c93dd100837e55e40fcae2644b&amp;dn=Lene+Lovich+-+Blue+Hotel+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280843355,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nLene Lovich (born 30 March 1949) is an American singer based in England, who first gained attention as part of the New Wave music scene of the late 1970s and early 1980s. Her most popular hit single was &quot;Lucky Number&quot;, first released in 1979.\n\nLovich was born Lili-Marlene Premilovich in Detroit, Michigan, to an English mother and a Serbian father. After her father had health problems, her mother took her and her three siblings to live in Hull, England. Lovich was 13 years old at the time. She met the guitarist/songwriter Les Chappell when they were teenagers, and he became her longtime collaborator and life partner. In autumn 1968, they went to London, England  to attend art school. It was there that Lovich first tied her hair into the plaits that later became a visual trademark, though at first she did it to keep her hair out of the clay when studying sculpture.\n\nOver the following decade, Lovich attended several art schools, busked around the London Underground and appeared in cabaret clubs as an &quot;Oriental&quot; dancer. She also travelled to Spain, where she visited Salvador DalÃƒÆ’Ã‚Â­ in his home. She played acoustic rock music around London, sang in the mass choir of a show called Quintessence at the Royal Albert Hall, played a soldier in Arthur Brown's show, worked as a &quot;go-go&quot; dancer with the Radio One Roadshow, toured Italy with a West Indian soul band, and played saxophone for Bob Flag's Balloon and Banana Band and for an all-girl cabaret trio, The Sensations. She recorded screams for horror films, wrote lyrics for French disco star Cerrone (including the sci-fi dance smash &quot;Supernature&quot;, later recorded by Lovich herself) and worked with various fringe theatre groups. She was also one of thousands of audience members invited to sing along at the 1972 Lanchester Arts Festival at the Locarno Ballroom in Coventry when Chuck Berry recorded &quot;My Ding-a-Ling&quot; for Chess Records.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:93b35675b21ee9c93dd100837e55e40fcae2644b","amp;dn":"Lene+Lovich+-+Blue+Hotel+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93b35675b21ee9c93dd100837e55e40fcae2644b","infoHashBuffer":{"type":"Buffer","data":[147,179,86,117,178,30,233,201,61,209,0,131,126,85,228,15,202,226,100,75]},"announce":[],"urlList":[]}}