{"title":"Coast to Coast AM - 07-20-10 - The Djinn &amp; Paranormal Phenomena","uid":5710176,"size":55244984,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:93bcb04222c46eea1dc723c604c44cb4c4869f7f&amp;dn=Coast+to+Coast+AM+-+07-20-10+-+The+Djinn+%26+Paranormal+Phenomena&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lyrian","files":5,"time":1279860790,"description":"Date:\n 07-20-10\n \nHost:\n George Noory\n \nGuests:\n Rosemary Ellen Guiley, Philip Imbrogno, Richard C. Hoagland \n \n\n\nParanormal researcher Rosemary Ellen Guiley and UFO investigator Philip Imbrogno discussed their forthcoming book about the djinn (or jinn), secretive entities that may play a role in a variety of paranormal phenomena. The beings exist in a parallel dimension to ours but seem to have the ability to enter our dimension via portals and interact with us and observe us even when we cannot see them, said Imbrogno. Accounts of them began in the ancient Middle East, where an assortment of beings who were not considered angels, such as fairies and earth spirits, were classified as djinn. King Solomon was said to enslave some of them to help build his temple, he added. \n\nGuiley described the djinn as masterful shape-shifters who sometimes masquerade as entities like Shadow People, demons, ETs, and Mothman. They can be thought of as tricksters who have their own self-serving agenda, which for some of them involves domination over humans and the earthly plane, she said. Guiley further suggested that intense, persistent, or annoying ghostly phenomena like poltergeists may actually be the work of the djinn, rather than spirits of the deceased. The djinn are very territorial and some of the unexplained phenomena people experience may occur near the locations of their portals, she explained. \n\nImbrogno recounted details of his research into the djinn that he conducted in the Middle East in the mid 1990s. He was taken to an enormous cave in Oman called the &quot;Meeting Place of the Djinn,&quot; and as he was rappelling into the cave, his tour guides took off, after hearing voices of the djinn telling them to leave. A local told him that after he encountered a female djinn while hiking in the mountains, he was apprehended by Saudi Arabian government agents who debriefed him at a base and were interested in learning about the dimensional abilities of the djinn. Imbrogno noted that this was similar to US govt. involvement in a UFO incident in Pine Bush, NY. \n\nNASA &amp; Oil Spill\nFirst hour guest, Richard C. Hoagland talked about the 41st anniversary of the Moon Landing, and the decline of NASA since that era. We don't have the technology at our disposal to fix the Gulf oil spill, and &quot;that's what happens when you put a shining jewel like NASA on the back burner for 30 years, from the end of Apollo till now, and not keep it where you need it, because you never know what you might need it for. Technology is the way we live or die on this planet,&quot; he commented. \n\n\nWebsite(s):\n-visionaryliving.com\n-enterprisemission.com\nBook(s):\n-Files From the Edge: A Paranormal Investigator's Explorations into High Strangeness\n-Interdimensional Universe\n-Encyclopedia of the Strange, Mystical, &amp; Unexplained\n-The Encyclopedia of Demons and Demonology \n-The Encyclopedia of Ghosts and Spirits\n-Dark Mission","torrent":{"xt":"urn:btih:93bcb04222c46eea1dc723c604c44cb4c4869f7f","amp;dn":"Coast+to+Coast+AM+-+07-20-10+-+The+Djinn+%26+Paranormal+Phenomena","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93bcb04222c46eea1dc723c604c44cb4c4869f7f","infoHashBuffer":{"type":"Buffer","data":[147,188,176,66,34,196,110,234,29,199,35,198,4,196,76,180,196,134,159,127]},"announce":[],"urlList":[]}}