{"title":"Two and a Half Men - Season 7 (2009) DVDRip Xvid Eng AC3 MKV [Bi","uid":5929031,"size":5115863450,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:94103c2d8c45f34b2093666293bc4f3c276e428c&amp;dn=Two+and+a+Half+Men+-+Season+7+%282009%29+DVDRip+Xvid+Eng+AC3+MKV+%5BBi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bigjazz.h33t","files":24,"time":1288705853,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nTwo and a Half Men - Season 7 (2009) DVDRip Xvid Eng AC3 MKV\n\nTitle:\t\tTwo and a Half Men\nSeason:\t\t7 (Complete)\nRelease:\tTV: 2009 DVD: 2010\nRuntime:\teach episode approx 20mins\n\nEncoding\n\nVideo;\nResolution:\t640x352\nBitrate:\t~1350kbps @ 25fps\nCodec:\t\tXvid, v1.2.2\nFormat:\t\tMatroska (.mkv)\n\nAudio;\nTrack 1:\t2.0 Channel AC3 @ 192kbps, English\n\nSubtitles:\tEnglish, Danish, Dutch, Finnish, French, Norwegian, Spanish, Swedish\n\nScene Markers:\tNot encoded\n\nFile Size:\t~225MB\n\nSource Info;\nType:\t\tPAL DVD (R4)\nFrame Type:\tWidescreen, Progressive\n\nTorrent Files:\t24\n\nTwo and a Half Men - Season 7\n\n701 - 818-jklpuzo\nCharlie bumps into Mia at the coffee shop and she asks Charlie to help her out with some music she has been working on.\n\n702 - Whipped Unto the Third Generation\nWhen Charlie's fiance, Chelsea, convinces him to let Melissa, Alan's girlfriend, move in, the girls take over the house.\n\n703 - Mmm, fish. Yum\nAlan plays nursemaid to Judith's baby and her tipsy mother (Annie Potts) while Judith and Herb take a &quot;romantic&quot; getaway. Meanwhile, Charlie runs over a cat which he believes to be Sir Lancelot, and Jake takes a photo of the scene to blackmail Charlie in letting him drive his Mercedes.\n\n704 - Laxative Tester, Horse Inseminator\nSick of not having a place of his own to get with Melissa, Alan takes a job working for Evelyn and invites Melissa over to a house he and Evelyn are selling and tells her (Melissa) he is renting it.\n\n705 - For the Sake of the Child\nWhile Jake has been learning to drive, Charlie and Alan have been bickering nonstop; when this ultimately embarrasses Jake in front of a group of girls he likes, he refuses to stay with them anymore, and they must find a way to convince him to continue spending weekends at the beach house or face Judith's unparalleled fury.\n\n706 - Give Me Your Thumb\nChelsea has been dealing with back pain, and Alan suggests she alleviate the pain with breast reduction surgery.\n\n707 - Untainted by Filth\nEvelyn announces that she will take care of Charlie and Chelsea's wedding as a gift, and they finally have a set date. Later that night, Charlie and Alan go out drinking and wake up in the same bed with a woman and they can't remember what happened.\n\n708 - Gorp. Fnark. Schmegle\nChelsea invites her beautiful college roommate, Gail (Tricia Helfer), to stay at the house while she gets over a bad breakup.\n\n709 - Captain Terry's Spray-On Hair\nCharlie is upset when he finds out he hasn't been satisfying Chelsea, and contemplates the reasons and tries to solve the problem; Alan tries to fix his baldness with a cheap hair product and pills that he bought online; Jake breaks his curfew and then sneaks out.\n\n710 - That's Why They Call It Ball Room\nCharlie and Chelsea get into an argument about dancing at the wedding, and the two end up going to dance lessons together, where Charlie finds out Chelsea has been keeping secrets about her finances.\n\n711 - Warning, It's Dirty\nWith Celeste (Tinashe Kachingwe) away for Christmas, Charlie teaches Jake how to cheat on her, but this backfires when Celeste returns.\n\n712 - Fart Jokes, Pie and Celeste\nJake, in a bid to win back Celeste, writes love songs to woo her until he tries Charlie's apology tactic, which fails.\n\n713 - Yay, No Polyps\nCharlie schedules a colonoscopy to get out of visiting Chelsea's parents, Tom and Martha, in Illinois, but Chelsea figures out he was lying and flies them in instead.\n\n714 - Crude and Uncalled For\nAlan ends up in jail after a bar fight and Charlie worries that Chelsea might be interested in Alans' lawyer, Brad (Steven Eckholdt), who takes the case because he claims to be a family man.\n\n715 - Aye, Aye, Captain Douche\nCharlie becomes worried and jealous after Chelsea is late returning from a charity event with Brad. When Chelsea does return, she and Charlie argue.\n\n716 - Tinkle Like a Princess\nAfter Chelsea breaks up with him, a depressed Charlie takes a trip to Las Vegas and returns home with a new wife.\n\n717 - I Found Your Moustache\nChelsea has started dating Brad. Charlie stalks her with the help of Alan, and after having a post-breakup one-night stand, the two are left re-thinking about if it was right for them to break up.\n\n718 - Ixnay on the Oggie Day\nCharlie runs into Chelsea's friend Gail (Tricia Helfer) and has sex with her, but then learns that Chelsea is having problems with Brad.\n\n719 - Keith Moon is Vomiting in His Grave\nJake's new friend, Eldridge, is a bad influence and talks Jake into stealing beer from Charlie, getting drunk and sneaking out when grounded.\n\n720 - I Called Him Magoo\nAfter being interrupted at Lyndsey's house by her son, Eldridge, Alan tries for an intimate night at a hotel with her, but nothing goes as planned.\n\n721 - Gumby with a Pokey\nCharlie finds himself with insomnia, and is given prescription marijuana by his pharmacist (Martin Mull) to help him sleep.\n\n722 - This is Not Gonna End Well\nWhen Charlie loses his license due to several unpaid traffic violations and failure to show up in court, Jake drives him around.\n\n-------------------------------------------------------------------\nPlease share....Don't hit and run...Seed it back at least once.\n\nOf course, if you want to seed it back more than once, that would be ok too :)\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:94103c2d8c45f34b2093666293bc4f3c276e428c","amp;dn":"Two+and+a+Half+Men+-+Season+7+%282009%29+DVDRip+Xvid+Eng+AC3+MKV+%5BBi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94103c2d8c45f34b2093666293bc4f3c276e428c","infoHashBuffer":{"type":"Buffer","data":[148,16,60,45,140,69,243,75,32,147,102,98,147,188,79,60,39,110,66,140]},"announce":[],"urlList":[]}}