{"title":"Man On Wire.(Docu.Spanish).","uid":5694235,"size":730593280,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:94622425dcc27098d372c1785a6b029192560cc7&amp;dn=Man+On+Wire.%28Docu.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cholo24","files":1,"time":1279225951,"description":"Man on wire\n\nEl 7 de agosto de 1974, un joven francÃƒÂ©s llamado Philippe Petit caminÃƒÂ³ por un cable colgado ilegalmente entre las Torres Gemelas de Nueva York, entonces los edificios mÃƒÂ¡s altos del mundo. Tras una hora caminando por el cable, fue arrestado, examinado psicolÃƒÂ³gicamente y encarcelado antes de ser finalmente liberado. Tras seis aÃƒÂ±os y medio soÃƒÂ±ando con las torres, Petit pasÃƒÂ³ ocho meses en Nueva York planeando la ejecuciÃƒÂ³n del golpe. Ayudado por un equipo de amigos y cÃƒÂ³mplices, Petit se enfrentÃƒÂ³ a numerosos y extraordinarios desafÃƒÂ­os: tuvo que encontrar la manera de burlar la seguridad del World Trade Center, colar el pesado cable de acero y el equipo necesario. Tender el cable entre los tejados de las dos torres, anclar el cable y tensarlo para soportar los vientos y el movimiento de vaivÃƒÂ©n de los edificios. El tendido del cable se hizo de noche, en completo secreto. A las 7:15 de la maÃƒÂ±ana, Philippe comenzÃƒÂ³ a pasear por el cable a 1.350 pies de altura por encima de las calles de Manhattan. El documental de James Marsh da vida a esta extraordinaria aventura a travÃƒÂ©s del testimonio de Philipe y alguno de los conspiradores que le ayudaron a crear el espectÃƒÂ¡culo magnÃƒÂ­fico y ÃƒÂºnico que se conociÃƒÂ³ como &quot;el crimen artÃƒÂ­stico del siglo&quot;.","torrent":{"xt":"urn:btih:94622425dcc27098d372c1785a6b029192560cc7","amp;dn":"Man+On+Wire.%28Docu.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94622425dcc27098d372c1785a6b029192560cc7","infoHashBuffer":{"type":"Buffer","data":[148,98,36,37,220,194,112,152,211,114,193,120,90,107,2,145,146,86,12,199]},"announce":[],"urlList":[]}}