{"title":"Kingdom of Heaven(subs dutch)Juultje(2Lions-Team)","uid":5702677,"size":4681321416,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9568ce59dbe58202bb06206e8cde1a9a2cc9f00b&amp;dn=Kingdom+of+Heaven%28subs+dutch%29Juultje%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"juutje","files":47,"time":1279566472,"description":"Kingdom of Heaven (2005) \n\nVerenigde Staten / Spanje / Verenigd Koninkrijk\nDrama / Oorlog\n145 minuten / 192 minuten (director's cut)\n\ngeregisseerd door Ridley Scott\nmet Orlando Bloom, Eva Green en Liam Neeson\n\nIn de twaalfde eeuw heeft de nederige Franse smid Balian (Orlando Bloom) net zijn vrouw en kind verloren, wanneer ridder Godfrey van Ibelin (Liam Neeson) hem opzoekt en vertelt dat hij zijn vader is. Godfrey vraagt Balian mee te gaan naar het Heilige Land om Jeruzalem voor het westen te behouden. Als vreemdeling in een vreemde omgeving wordt hij verheven in de ridderstand, moet hij een melaatse koning dienen en koestert hij een verboden liefde voor een exotische koningin. In een poging om de broze vrede te bewaren, moet Balian van Ibelin uiteindelijk de mensen van Jeruzalem zien te beschermen tegen een overmachtige vijand.\n\nWeblink http://www.moviemeter.nl/film/22398\n\nEngels\n\nt is the time of the Crusades during the Middle Ages - the world shaping 200-year collision between Europe and the East. A blacksmith named Balian has lost his family and nearly his faith. The religious wars raging in the far-off Holy Land seem remote to him, yet he is pulled into that immense drama. Amid the pageantry and intrigues of medieval Jerusalem he falls in love, grows into a leader, and ultimately uses all his courage and skill to defend the city against staggering odds. Destiny comes seeking Balian in the form of a great knight, Godfrey of Ibelin, a Crusader briefly home to France from fighting in the East. Revealing himself as Balian's father, Godfrey shows him the true meaning of knighthood and takes him on a journey across continents to the fabled Holy City. In Jerusalem at that moment--between the Second and Third Crusades--a fragile peace prevails, through the efforts of its enlightened Christian king, Baldwin IV, aided by his advisor Tiberias, and the military restraint of the legendary Muslim leader Saladin. But Baldwin's days are numbered, and strains of fanaticism, greed, and jealousy among the Crusaders threaten to shatter the truce. King Baldwin's vision of peace--a kingdom of heaven--is shared by a handful of knights, including Godfrey of Ibelin, who swear to uphold it with their lives and honor. As Godfrey passes his sword to his son, he also passes on that sacred oath: to protect the helpless, safeguard the peace, and work toward harmony between religions and cultures, so that a kingdom of heaven can flourish on earth. Balian takes the sword and steps into history. \n\nWeblink http://www.imdb.com/title/tt0320661/\n\nVideo                : Retail DVD Rip\nAudio                :  AC 3 5.1-ch English   DTS  5.1-ch English\nSubs                 : English Dutch\nID                   : 224 (0xE0)\nFormat               : MPEG Video\nFormat version       : Version 2\nBit rate mode        : Variable\nWidth                : 720 pixels\nHeight               : 576 pixels\nDisplay aspect ratio : 16:9\nFrame rate           : 25.000 fps\nStandard             : PAL\nCover                : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl/index.php&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:9568ce59dbe58202bb06206e8cde1a9a2cc9f00b","amp;dn":"Kingdom+of+Heaven%28subs+dutch%29Juultje%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9568ce59dbe58202bb06206e8cde1a9a2cc9f00b","infoHashBuffer":{"type":"Buffer","data":[149,104,206,89,219,229,130,2,187,6,32,110,140,222,26,154,44,201,240,11]},"announce":[],"urlList":[]}}