{"title":"The Police - Message In A Bottle (Live) (2nafish)","uid":5918674,"size":179286020,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:95a7dba9aec1b58ac84fdfa7e8b6e43e0bee1b5c&amp;dn=The+Police+-+Message+In+A+Bottle+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1288328390,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Message in a Bottle&quot; is a 1979 song by The Police, from their second album, Reggatta de Blanc.\n\nThe song is ostensibly about a castaway on an imagined island, who sends out a message in a bottle to seek love. A year later, he feels that there is no need for love. Later on, he sees &quot;a hundred billion bottles&quot; on the shore, finding out that there are more people like him out there. The Police debuted the song on a live television show called &quot;Rock Goes to College&quot;, filmed at Hatfield Polytechnic College in Hertfordshire, England.\n\nThe single was The Police's first number one hit in the United Kingdom, but only reached #74 in the United States. An alternate &quot;Classic Rock&quot; mix is available on Every Breath You Take: The Classics. This is Sting's favorite song as confessed to Jools Holland of BBC fame.\n\nThe Police reformed at Live Earth, a 2007 charity concert to raise awareness of global warming and other environmental hazards and performed &quot;Message in a Bottle&quot; as the US finale, with John Mayer playing guitar with Andy Summers (who described the track as a personal favourite in his book One Train Later) and Kanye West performing a rap verse over the chorus of the song.\n\nReggatta de Blanc is the second album by The Police, released in 1979.\n\nThe Police were an English rock band from London, formed in 1977. The band consisted of Sting (lead vocals, bass guitar), Andy Summers (guitar, vocals) and Stewart Copeland (drums, vocals, percussion). The Police became globally popular in the late 1970s and are generally regarded as one of the first New Wave groups to achieve mainstream success, playing a style of rock that was influenced by jazz, punk and reggae music. Their 1983 album, Synchronicity, was number one in the UK and the US and sold over 8,000,000 copies in the US. The band broke up in 1984, but reunited in early 2007 for a one-off world tour lasting until August 2008, in celebration of the 30th anniversary of their hit single &quot;Roxanne&quot; and also, to a lesser extent, their formation as a group. The Police have sold more than 50 million albums worldwide, and became the world's highest-earning musicians in 2008, thanks to their reunion tour. Rolling Stone ranked The Police number 70 on their list of the 100 Greatest Artists of All Time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:95a7dba9aec1b58ac84fdfa7e8b6e43e0bee1b5c","amp;dn":"The+Police+-+Message+In+A+Bottle+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95a7dba9aec1b58ac84fdfa7e8b6e43e0bee1b5c","infoHashBuffer":{"type":"Buffer","data":[149,167,219,169,174,193,181,138,200,79,223,167,232,182,228,62,11,238,27,92]},"announce":[],"urlList":[]}}