{"title":"Coast to Coast AM - 07-21-10 - Voltage and Health","uid":5711274,"size":55040189,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:96af6dbe1de5b78d5e71007e2313fcac29f76c2e&amp;dn=Coast+to+Coast+AM+-+07-21-10+-+Voltage+and+Health&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1279906608,"description":"Date:\n 07-21-10\n \nHost:\n George Noory\n \nGuests:\n Dr. Jerry Tennant, Dr. Mark Starr, Catherine Austin Fitts \n \n\n\nDr. Jerry Tennant talked about how he developed a method of using voltage to diagnose and treat a variety of health problems. A successful eye surgeon, he came down with encephalitis, and it was during this period that he correlated lowered voltage in specific body areas with illness. Pain is actually a symptom of abnormal voltage, and &quot;all you have to do to get rid of it is insert enough electrons to get the voltage back up into the operating range,&quot; he said. Dr. Tennant has developed a device called the Biomodulater which can transfer the electrons to cell membranes. \n\nMany ailments referred to as auto-immune are not caused by the body attacking itself, but from bacteria releasing digestive enzymes that get into the bloodstream and attack low voltage areas, he explained. Dr. Mark Starr, who has studied with Dr. Tennant, joined the discussion to talk about how he was successfully treated with the Biomodulater, and how hyothyroidism (previous show recap) is often associated with low voltage. A lot of the hypothyroidism is due to fluoride exposure, Tennant added. \n\nHe also pointed toward root canals as a source of health problems-- one infected root canal can shut down 63% of the immune system, he cited. Another cause of having low voltage is not having enough stomach acid (sometimes brought about by a deficiency of iodine and zinc), he detailed. \n\nNew Finance Regulations\nFirst hour guest, investment advisor Catherine Austin Fitts shared her critical reaction to the new financial regulations just signed into law. &quot;We have a couple thousand pages of legislation from the federal government&quot; that still doesn't account for the $4 trillion missing from federal accounts. And the new regulations will essentially increase the amount of centralization, and give vast new powers to the Federal Reserve, she cautioned. \n\n\nWebsite(s):\n-tennantinstitute.com\n-21centurymed.com\n-solari.com\nBook(s):\n-Healing is Voltage","torrent":{"xt":"urn:btih:96af6dbe1de5b78d5e71007e2313fcac29f76c2e","amp;dn":"Coast+to+Coast+AM+-+07-21-10+-+Voltage+and+Health","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96af6dbe1de5b78d5e71007e2313fcac29f76c2e","infoHashBuffer":{"type":"Buffer","data":[150,175,109,190,29,229,183,141,94,113,0,126,35,19,252,172,41,247,108,46]},"announce":[],"urlList":[]}}