{"title":"Four.Corners.2010.07.15.A.Dog.Act.SDTV.VP6.MPEG.flv","uid":5724163,"size":229206561,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:96c5374491efd94ca001d54b1bbf907c399ca894&amp;dn=Four.Corners.2010.07.15.A.Dog.Act.SDTV.VP6.MPEG.flv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1280398707,"description":"ABC Four Corners\n\nReporter: Liz Jackson\n\nBroadcast: 15/07/2010\n\nLiz Jackson reports on a killing that has had a devastating impact on six families and that has forced the town of Alice Springs to confront the ugly side of racism.\n\nIt was almost a year ago, just after sunrise in Alice Springs on July 25th 2009, that an Aboriginal man was killed by a group of white youths travelling in a white twin cab ute. As soon as the police arrested and identified the five men, emotions were unleashed in Alice Springs and race relations came under the spotlight.\n\nAs the editor of the local newspaper told Liz Jackson: &quot;(It was) huge, huge. I mean once the arrests were made, you got a sense that Alice Springs spoke about nothing else.&quot;\n\nAnother local said: &quot;The hardest thing is knowing that this could happen in this town, in this community, not only that but to find out that they were local young men was very, very distressing.&quot;\n\nFor the first time, families of the victim and the young men who are now in jail, speak to Liz Jackson as they struggle to come to terms with the devastating aftermath of a shocking killing.\n\n&quot;Where's my son? My son had a future and he didn't get the chance to have that future,&quot; - Therese Ryder\n\nFor Heather Swain, nothing could prepare her for what her son was about to tell her: &quot;Don't stress Mum. Exactly this, don't stress Mum, but I've been charged with murder. Imagine my reaction, you know, was pretty hard.&quot;\n\nWitnesses to the killing also speak for the first time, as they attempt to understand how this could have happened.\n\nFour Corners also gains exclusive access to police records of interviews and re-enactments that document a confronting crime.","torrent":{"xt":"urn:btih:96c5374491efd94ca001d54b1bbf907c399ca894","amp;dn":"Four.Corners.2010.07.15.A.Dog.Act.SDTV.VP6.MPEG.flv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96c5374491efd94ca001d54b1bbf907c399ca894","infoHashBuffer":{"type":"Buffer","data":[150,197,55,68,145,239,217,76,160,1,213,75,27,191,144,124,57,156,168,148]},"announce":[],"urlList":[]}}