{"title":"Shaken and Stirred","uid":5683582,"size":12506804,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9705f934a468063de7a365b4a3303c218ba1a5a2&amp;dn=Shaken+and+Stirred&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1278884353,"description":"Shaken and Stirred: Through the Martini Glass and Other Drinking Adventures\n\n\nCollins Living | 240 pages | PDF | 12 MB\n\n\nWilliam L. Hamilton loves a good gimlet. Rose's and lime. Straight up. Perfectly iced. Make the glass pretty too. &quot;It ruined my reputation for thinking before I speak,&quot; he writes of that love. &quot;I accept the trade-off.&quot; Like Lewis Carroll's Alice, when Hamilton sees it, he drinks it -- and tells the incredible tale.\n\nIn &quot;Shaken and Stirred,&quot; his biweekly Sunday Styles column, now an original book of his drinking adventures, the intrepid New York Times reporter offers a gimlet-eyed look at contemporary culture through the panoptic view of a cocktail glass. From the venerable martini to the young Dirty Jane, Hamilton shares his tip on the sip.\n\nYou hold in your hands a guide to &quot;how it goes down.&quot; Not a cocktail manual or a Baedeker to the bar scene but a drinker's guide to drinking. These are four-ounce adventures of cocktails and the people who make them, from the bartenders and chefs to the patrons, the politicians and the power players of the liquor industry.\n\nThere are tales of the Champagne high life, the Long Island Iced Tea low life; men like Dr. Brown and his celery soda, and women like Eve and her Apple Martini. Hamilton's weekly Runyanesque rounds cover all the watering holes and their poisons, from the East Side's Southside to the Incredible Hulk in the Bronx, and monitors the latest trends, from the ultra-premium vodka wars to the Red Bull market. Shaken and Stirred is a report on a popular culture that comes alive after five, when the mood turns social and the moment is sweet (or sour, or bitter, or dry).\n\nHamilton has also picked up the best (or the most unbelievable) cocktail recipes from bars, lounges and restaurants in New York City and beyond. There is common sense and creativity in the classics, and new inventions with their eye on the prize, such as the Huckleberry Ginn and the Bleeding Heart. &quot;drink me,&quot; said the bottle in Alice's Adventures in Wonderland. Hamilton has, in every instance, and bottled his thoughts in sixty-four essays that are as readable as they are drinkable. Mix a gimlet, or a Minnesota Anti-Freeze, or a Gibson or a Bone. And spend a night in, on the town.","torrent":{"xt":"urn:btih:9705f934a468063de7a365b4a3303c218ba1a5a2","amp;dn":"Shaken+and+Stirred","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9705f934a468063de7a365b4a3303c218ba1a5a2","infoHashBuffer":{"type":"Buffer","data":[151,5,249,52,164,104,6,61,231,163,101,180,163,48,60,33,139,161,165,162]},"announce":[],"urlList":[]}}