{"title":"Democracy Now - 18 oct 2010","uid":5895167,"size":452440683,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:983c9ee11d55f8b012150cdd0a39c020504d6267&amp;dn=Democracy+Now+-+18+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1287424274,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 18, 2010\n\n- GOP Gains Fundraising Advantage Ahead of Midterm Election\n- Alaskan Journalist Detained &amp; Handcuffed by Private Guards for GOP Candidate\n- 1,500 French Gas Stations Run Out of Fuel as Labor Protests Intensify\n- Hundreds of Hilton Hotel Workers Go on Strike\n- Scores of Stimulus Opponents Sought Money out of Public View\n- Al-Maliki Visits Iran to Meet Ahmadinejad\n- Soldier to Face Court-Martial over &quot;Kill Team&quot; Charges\n- Tides Foundation CEO Urges Advertisers to Boycott Fox News\n- EPA Official: Reject Permit for Mountaintop Removal Mine in WV\n- US Accuses China of Illegally Subsidizing Clean Energy Projects\n- China Demonized in Dozens of US Campaign Ads\n- Burma Bars Foreign Observers and Reporters from Election\n\n\nSpecial reports\n\n- War's Hidden Death Toll: After Service, Veteran Deaths &amp; Suicides Surge\n\nAs of this month, over 5,700 American soldiers have been killed in Iraq and Afghanistan. That count does not include those veterans who commit suicide or die from war-related issues after returning home from military service. Well, a new investigation into California veterans and active service members reveals that three times as many veterans are dying soon after returning home than those being killed in Iraq and Afghanistan combined. According to the report published in the Bay Citizen and the New York Times, more than 1,000 California veterans under 35 died between 2005 and 2008.\n\n\n- Big Oil Goes to College: BP, ExxonMobil, Chevron, Shell Fund &amp; Influence Research at Major Universities\n\nOver the past five years ExxonMobil, Chevron, BP, Royal Dutch Shell, and ConocoPhillips have given millions of dollars over the past decade to support energy research at top U.S. universities. The private funds might fill a gap left by declining public investment, but a new report from the Center for American Progress warns that they also pose the risk of hijacking the universities' research agenda and compromising academic independence. In the largest deal, British oil giant BP has a $500 million collaboration with three major publicly financed research institutions: the University of California at Berkeley, the University of Illinois at Urbana-Champaign, and Lawrence Berkeley National Laboratory.\n\n\n- Slavoj Zizek: Far Right and Anti-Immigrant Politicians on the Rise In Europe\n\nWe turn now to Europe where many are concerned about the growing acceptability of anti-immigrant rhetoric and policies. Far from just being expressed by the extreme right wing, the anti-immigrant trend has entered the mainstream. German Chancellor Angela Merkel told a gathering of young members of her conservative Christian Democratic Union party this weekend that multiculturalism has utterly failed. A recent German poll found 13 percent of Germans would welcome the arrival of a new &quot;Fuhrer&quot; and more than a third of Germans feel the country is &quot;overrun by foreigners.&quot; We speak to the world renowned philosopher Slavoj Zizek, who has the been called the Elvis of cultural theory.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:983c9ee11d55f8b012150cdd0a39c020504d6267","amp;dn":"Democracy+Now+-+18+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"983c9ee11d55f8b012150cdd0a39c020504d6267","infoHashBuffer":{"type":"Buffer","data":[152,60,158,225,29,85,248,176,18,21,12,221,10,57,192,32,80,77,98,103]},"announce":[],"urlList":[]}}