{"title":"Democracy Now - 10 aug 2010","uid":5753163,"size":456197304,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:98a3d7542ab8096899040d2168430f5af4347034&amp;dn=Democracy+Now+-+10+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1281466171,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 10, 2010\n\n- UN: 13 Million People Affected by Floods in Pakistan\n- Google and Verizon Propose Two-Tiered Internet System\n- Gates Outlines Pentagon Budget Cuts\n- UN: Civilian Casualties Jump 31% in Afghanistan in 2010\n- Medical Charity Identifies Aid Workers Killed in Afghanistan\n- Trial of Omar Khadr to Begin at Guantanamo\n- Vicente Fox Calls for Legalization of Drugs\n- Number of Oiled Wildlife Increasing in Gulf of Mexico\n- Hezbollah Blames Israel for 2005 Assassination of Al-Hariri\n- Mia Farrow Testifies at Charles Taylor War Crimes Trial\n\n\nSpecial reports\n\n- Meterologist: Record Heat Wave in Russia Could Kill Tens of Thousands\n\nWildfires across Russia. Devastating floods in Pakistan. Deadly landslides and flash floods in India and China. Heat wave across the United States. Severe drought in Niger. Taken together, scientists warn the events match predictions for extreme climate events caused by global warming. This year is on track to be the warmest since reliable temperature records began over a century ago, mainly due to a buildup of greenhouse gases from fossil fuels. We speak to Jeff Masters, co-founder and director of meteorology for Weather Underground, a weather information website.\n\n\n- Bolivian UN Ambassador: Despite Extreme Weather, US and Other Developed Countries Failing to Make Serious Pledges to Cut Greenhouse Gas Emissions\n\nEven as the world faces a series of extreme weather events that scientists warn is related to global warming, international climate negotiations are moving at a glacial pace. The latest round of climate talks in Bonn, Germany, ended last week, and diplomats have just one more short meeting in China in the coming months to hash out their differences before the critical high-level climate conference in Cancun, Mexico, at the end of the year. We speak to Ambassador Pablo Solon. He is Bolivia's permanent representative to the United Nations and was in Bonn last week.\n\n\n- Latin American Historian Greg Grandin on Colombia After Alvaro Uribe\n\nColombia and Venezuela are expected to reestablish trade and diplomatic ties after their leaders meet today to defuse a simmering crisis. Colombia's new president Juan Manuel Santos, who was inaugurated Saturday, will meet Venezuelan President Hugo Chavez in Santa Marta, Colombia, the site where South American liberation hero Simon Bolivar died in 1830. In his inaugural address, Santos, who was defense minister under former President Alvaro Uribe, called for &quot;frank and direct&quot; dialogue with Chavez. Venezuelan President Hugo Chavez responded by calling for Colombian guerrillas to free all their hostages and give up their armed conflict.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:98a3d7542ab8096899040d2168430f5af4347034","amp;dn":"Democracy+Now+-+10+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98a3d7542ab8096899040d2168430f5af4347034","infoHashBuffer":{"type":"Buffer","data":[152,163,215,84,42,184,9,104,153,4,13,33,104,67,15,90,244,52,112,52]},"announce":[],"urlList":[]}}