{"title":"El profesor.(ebook)","uid":5925659,"size":3955258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99ce28fb05f5324b27994c1cbee81fa5bb960184&amp;dn=El+profesor.%28ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1288597206,"description":"Adrian Thomas es un profesor universitario retirado, al que acaban de diagnosticarle una demencia degenerativa que lo llevarÃƒÂ¡ pronto a la muerte. Ha dedicado toda su vida a estudiar los procesos de la mente y a transmitir a sus alumnos todo su conocimiento. Ahora, jubilado, viudo y enfermo cree que lo mejor que puede hacer es quitarse la vida. Pero al salir del consultorio del mÃƒÂ©dico es testigo involuntario del secuestro de Jennifer Riggins, una conflictiva adolescente de diecisÃƒÂ©is aÃƒÂ±os con un largo historial de huidas, que desaparece sin dejar rastro dentro de una camioneta conducida por una mujer rubia. El profesor Thomas se debate entre poner fin a su vida y ser ÃƒÂºtil una ÃƒÂºltima vez antes de morir. Decide ayudar a encontrar a Jennifer, intentar darle la oportunidad de vivir su joven vida. Para eso debe sumergirse en el oscuro mundo de la pornografÃƒÂ­a en Internet, un mundo perverso y criminal donde todo su saber acadÃƒÂ©mico se pone en juego, y donde debe utilizar los pocos momentos de lucidez para avanzar en una investigaciÃƒÂ³n para la que hay muy poco tiempo?\n","torrent":{"xt":"urn:btih:99ce28fb05f5324b27994c1cbee81fa5bb960184","amp;dn":"El+profesor.%28ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ce28fb05f5324b27994c1cbee81fa5bb960184","infoHashBuffer":{"type":"Buffer","data":[153,206,40,251,5,245,50,75,39,153,76,28,190,232,31,165,187,150,1,132]},"announce":[],"urlList":[]}}