{"title":"Bangles - The Real World (2nafish)","uid":5844865,"size":94732292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9e0c787d118d54518726bcab866031fb90046c94&amp;dn=Bangles+-+The+Real+World+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1285127613,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBangles is the eponymous first EP by Bangles; it was released in 1982 by Faulty Products and reissued in 1983 by I.R.S. Records when Faulty Products went out of business.\n\nThe Bangles are an American all-female band that originated in the early 1980s, scoring several hit singles during the decade.\n\nThe Bangles have contributed to many other artists' works and to compilations. They provided the song &quot;I Got Nothing&quot; for the soundtrack album for the 1985 film The Goonies, and made a cameo appearance in Cyndi Lauper's music video for &quot;Goonies 'R' Good Enough&quot;. Lauper later enlisted them for backup vocals in her 1986 hit song &quot;Change of Heart&quot;. In 1988, while recording his album Full Moon Fever, Tom Petty and his lead guitarist Mike Campbell  called on the group to provide backing vocals for the song &quot;Waiting for Tonight&quot;. The song never made it to the album, but instead made the compilations Playback and Anthology: Through the Years. A cover version of &quot;Eternal Flame&quot; was a 2001 UK #1 for Atomic Kitten. In February 2001, the first-season Gilmore Girls episode &quot;Concert Interruptus&quot; involved a trip to see a Bangles concert, and featured cameos and music by the band. There were also several references to the Bangles throughout the rest of the series. Excerpts of the songs &quot;Hero Takes a Fall&quot; and &quot;Eternal Flame&quot; were featured in the concert that the Gilmore party attended. They also covered the Beatles hit &quot;Good Day Sunshine&quot; for the 2006 album All Together Now: Beatles Stuff for Kids of All Ages. The song &quot;Eternal Flame&quot; appears in the 2009 Japanese drama &quot;Love Shuffle&quot;.\n\nIn 2009, The Bangles covered Lowen &amp; Navarro's &quot;We Belong&quot; on &quot;Keep The Light Alive: Celebrating The Music of Lowen &amp; Navarro&quot;. The proceeds of the album benefit The Eric Lowen Trust, ALS Association Greater Los Angeles, and Augie's Quest.\n\nSeveral artists have referred to the Bangles in their own songs. The Saw Doctors include an irreverent tribute to them, &quot;I'd Love to Kiss the Bangles&quot;, on their 2003 album Play It Again Sham!. Alternative-country artist Robbie Fulks sings a wistful ode to &quot;That Bangle Girl&quot;, a song identified as one of his &quot;personal favorites&quot;, on his 2000 Very Best album. Although Fulks never says her name, the line &quot;When the little one took the mike, I knew I'd fallen&quot; suggests the particular &quot;Bangle girl&quot; he pines for is Susanna Hoffs, the shortest member of the group and frequent lead singer. Susanna Hoffs lent her voice for the video &quot;We Are The Ones&quot; supporting the presidential election campaign of Barack Obama.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9e0c787d118d54518726bcab866031fb90046c94","amp;dn":"Bangles+-+The+Real+World+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e0c787d118d54518726bcab866031fb90046c94","infoHashBuffer":{"type":"Buffer","data":[158,12,120,125,17,141,84,81,135,38,188,171,134,96,49,251,144,4,108,148]},"announce":[],"urlList":[]}}