{"title":"Planet Alcatraz","uid":5719418,"size":2832125952,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9e9b1734843cb601563e253df8ee1fd058946118&amp;dn=Planet+Alcatraz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1280192012,"description":"Title: Planet Alcatraz\nDeveloper: 1C Company\nPublisher: 1C Company\nGenre: RPG\nReleased: 2009\nDescription:\nPlanet Alcatraz is a real-time post-apocalyptic RPG. It has been described by the developers as a mixture between Neverwinter Nights and Fallout, on a smaller scale. The game features a non-linear plot, extensive dialogues, a character development system that affects the plot, as well as a real-time with pause combat system. It uses the same graphical engine as the hack'n'slash game Dawn of Magic.\n\nThe protagonist is one of the four imperial troopers sent to a post-apocalyptic prison-planet under the guise of convicts to investigate the construction of a spaceship by the prisoners. The pods carrying the convicts crash, scattering the four troopers all over the planet. The primary objective of the game is to reunite with the remaining three soldiers, who will join the group as playable characters, and to get on with the investigation.\n\nThe politically incorrect setting of the game, as well as its black humour, has been a subject to much praise by the Russian gaming press, as well as by fans of Dmitry 'Goblin' Puchkov, a Russian celebrity famous for his translation theories, whose only book serves as the basis for the game. Racial segregation, misogyny, homophobia, debauchery, slavery, and cannibalism run rampant on the planet.\n\nInstallation:\n1) Mount or burn game image;\n2) Install the game;\n3) Play the game without the DVD.\n\nMetacritic: http://www.metacritic.com/games/platforms/pc/planetalcatraz\n\nIf you like the game, buy the original.","torrent":{"xt":"urn:btih:9e9b1734843cb601563e253df8ee1fd058946118","amp;dn":"Planet+Alcatraz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e9b1734843cb601563e253df8ee1fd058946118","infoHashBuffer":{"type":"Buffer","data":[158,155,23,52,132,60,182,1,86,62,37,61,248,238,31,208,88,148,97,24]},"announce":[],"urlList":[]}}