{"title":"Martina McBride-Cry On The Shoulder Of The Road (2nafish)","uid":5726090,"size":110524420,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9ef962c9ffd9a13351294d98db38ec8006acdcaf&amp;dn=Martina+McBride-Cry+On+The+Shoulder+Of+The+Road+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1280467788,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nWild Angels is a 1995 album by Martina McBride. The album produced the singles &quot;Safe in the Arms of Love&quot;, &quot;Wild Angels&quot;, &quot;Swingin' Doors&quot;, &quot;Phones Are Ringin' All Over Town&quot;, and &quot;Cry on the Shoulder of the Road&quot;. &quot;Wild Angels&quot; was McBride's first Number One on the Hot Country Songs charts.\n\nAlso included is a cover of &quot;Two More Bottles of Wine&quot;, which was previously a Number One hit for Emmylou Harris in 1978. &quot;Safe in the Arms of Love&quot; was originally recorded by Baillie &amp; the Boys on their 1989 album Turn the Tide, and in 1994 by Michelle Wright on her 1994 album The Reasons Why. Wright's version of the song was a Top Ten hit in Canada.\n\nMartina McBride (born Martina Mariea Schiff on July 29, 1966, in Sharon, Kansas) is an American country music singer and songwriter. McBride has been called the &quot;CÃƒÆ’Ã‚Â©line Dion of Country Music&quot; for her big-voiced ballads and soprano range.\n\nMcBride was signed to RCA Records in 1991 and made her debut the following year as a neo-traditionalist country singer with the single, &quot;The Time Has Come.&quot; It was not until 1997, when she released her fourth album, Evolution, that she broke through into the country music industry with a new pop-styled crossover sound, similar to that of Faith Hill and Shania Twain. From that point on, McBride has had a string of major hit singles on the Billboard country chart and occasionally on the adult contemporary chart. Five of these singles went to #1 on the country chart between 1995 and 2001, and one peaked at #1 on the adult contemporary chart in 2003.\n\nMcBride has recorded a total of nine studio albums, one &quot;greatest hits&quot; compilation, one &quot;live&quot; album, a &quot;Christmas&quot; compilation, as well as two additional compilation albums. Seven of her studio albums and two of her compilations have received an RIAA certification of &quot;Gold&quot;, or higher. Worldwide, she has sold over 16 million albums. In addition, Martina has won the Country Music Association's &quot;Female Vocalist of the Year&quot; award four times (tied with Reba McEntire for the most wins) and the Academy of Country Music's &quot;Top Female Vocalist&quot; award three times.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9ef962c9ffd9a13351294d98db38ec8006acdcaf","amp;dn":"Martina+McBride-Cry+On+The+Shoulder+Of+The+Road+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ef962c9ffd9a13351294d98db38ec8006acdcaf","infoHashBuffer":{"type":"Buffer","data":[158,249,98,201,255,217,161,51,81,41,77,152,219,56,236,128,6,172,220,175]},"announce":[],"urlList":[]}}