{"title":"T","uid":5727491,"size":35163564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0ac689853af239076bbc5216ac74c547516f8bb&amp;dn=T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chusca","files":3,"time":1280513235,"description":"Una cocina de contrastes profundamente enraizada en la tradiciÃƒÂ³n andaluza: asÃƒÂ­ se define la cocina de Dani GarcÃƒÂ­a en Tragabuches. A partir de la interpretaciÃƒÂ³n y evoluciÃƒÂ³n de los sabores primarios, combinaciones reconocibles, Dani crea potenciando el contraste, ya sea de textura, de temperatura y, sobre todo, de sabor. Y ahÃƒÂ­ es donde mÃƒÂ¡s afina el cocinero marbellÃƒÂ­. Porque la suya es una cocina de contrastes pero tambiÃƒÂ©n de matices, sutiles contraposiciones de sabores que se potencian y suavizan mutuamente. El resultado es sorprendente pero armonioso, emociona al tiempo que despierta sensaciones contrastadas en el comensal. El presente libro recoge la etapa de la consolidaciÃƒÂ³n de Dani en Tragabuches, con una cocina madura y de fuerte personalidad propia. Entre los muchos valores aÃƒÂ±adidos de esta obra, destacan la poco convencional estructura de las recetas (especialmente concebida para dar un espacio prioritario a los comentarios de Dani, destinados al lector ÃƒÂ¡vido de una informaciÃƒÂ³n que vaya mÃƒÂ¡s allÃƒÂ¡ de la mera fÃƒÂ³rmula), la clasificaciÃƒÂ³n de las mismas en bloques de contrastes gustativos (dulce-salado, dulce-salado-tercer sabor y sabores matizados, eje de su filosofÃƒÂ­a culinaria), y la presentaciÃƒÂ³n de los desarrollos cientÃƒÂ­fico-gastronÃƒÂ³micos mÃƒÂ¡s punteros de Dani. La principal innovaciÃƒÂ³n es el uso del NitrÃƒÂ³geno LÃƒÂ­quido, una tÃƒÂ©cnica que permite cocciones en frÃƒÂ­o hasta el punto de congelaciÃƒÂ³n y se convierte en un perfecto aliado del recetario andaluz, que siempre ha combatido las altas temperaturas a base de sopas frÃƒÂ­as y ligeros entrantes. El excelente material fotogrÃƒÂ¡fico de Mikel Alonso plasma la cocina de Dani en forma de contrastes de color, de luz y de textura.","torrent":{"xt":"urn:btih:a0ac689853af239076bbc5216ac74c547516f8bb","amp;dn":"T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0ac689853af239076bbc5216ac74c547516f8bb","infoHashBuffer":{"type":"Buffer","data":[160,172,104,152,83,175,35,144,118,187,197,33,106,199,76,84,117,22,248,187]},"announce":[],"urlList":[]}}