{"title":"En Pata de Guerra [BR-Screener][Spanish]","uid":5741405,"size":1452110904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1cb253ceee15c5f83aa3be1fb3cdfc06e9093fd&amp;dn=En+Pata+de+Guerra+%5BBR-Screener%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Morck22","files":1,"time":1281047810,"description":"Despues de trasladar a su familia de Chicago a los bosques de Oregon por su nuevo trabajo como supervisor en la construccion de una nueva urbanizacion que supuestamente respeta el medio ambiente, Dan Sanders (Brendan Fraser) cree que su mayor problema sera ayudar a su urbanita mujer Tammy (Brooke Shields) y a su hijo adolescente que siente fobia por la naturaleza (Matt Prokop) a ajustarse a su nuevo entorno, a la vez que mantiene contento a su exigente jefe (Ken Jeong). Pero los problemas de Dan no habran hecho mas que empezar cuando los animales descubran su gran parte de responsabilidad en la destruccion de su habitat natural. No tardara en acabar en lo mas alto de su lista de los mas buscados y descubrira, para su pesar, cuantos problemas pueden provocar unas cuantas criaturas del bosque con malas pulgas. Los ingeniosos animalejos le hacen la vida imposible a Dan dia y noche, sabotean su trabajo, su tranquilidad e incluso su vestuario. Bajo este constante acoso, Dan ve pronto como su otrora perfecta vida se viene abajo. Fracasa por completo en sus intentos de atrapar, disuadir o incluso fotografiar al equipo de asalto animal y, sin pruebas de la conspiracion encubierta de la naturaleza contra el, nadie cree sus afirmaciones. Con su mujer y su hijo a punto de abandonarlo y su proyecto de construccion en la cuerda floja, Dan lleva el conflicto mas alla todavia, para convertirlo en una guerra total entre especies de la que no saldra mas que un unico vencedor.","torrent":{"xt":"urn:btih:a1cb253ceee15c5f83aa3be1fb3cdfc06e9093fd","amp;dn":"En+Pata+de+Guerra+%5BBR-Screener%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1cb253ceee15c5f83aa3be1fb3cdfc06e9093fd","infoHashBuffer":{"type":"Buffer","data":[161,203,37,60,238,225,92,95,131,170,59,225,251,60,223,192,110,144,147,253]},"announce":[],"urlList":[]}}