{"title":"Thief and the Cobbler Scrapbook 3 (Richard Williams Animation)","uid":5717382,"size":2258195014,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a2728e966a7a6ee6c7af22c3a223a4545ee7beed&amp;dn=Thief+and+the+Cobbler+Scrapbook+3+%28Richard+Williams+Animation%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jkahle1","files":993,"time":1280157467,"description":"Richard Williams is the legendary, triple Oscar winning animator \nof Who Framed Roger Rabbit, The Thief and the Cobbler, A \nChristmas Carol, and Raggedy Ann &amp; Andy - A Musical Adventure.\n\nYou can see his work at The Thief Archive at\n\nThis scrapbook is a piece of animation history, an archive \ncollecting an incredible amount of rare original artwork, \narticles and writings, as well as interviews, audio, some video \nand other surprises from and related to Richard Williams' \nremarkable career of over 50 years in animation.\n\nBritish based Williams has won 3 Oscars (for Roger Rabbit and A \nChristmas Carol), 3 British Academy Awards and over 250 other \ninternational awards.\n\nHe is also known for his unfinished masterpiece, The Thief and \nthe Cobbler, which was never released as intended but is \navailable unofficially on the internet as &quot;The Thief and the \nCobbler: Recobbled Cut,&quot; a restoration of the intended version of \nthe film, on which he spent 23 years.\n\nHis credits include The Return of the Pink Panther, The Pink \nPanther Strikes Again, What's New Pussycat, Casino Royale, The \nCharge of the Light Brigade, and hundreds of acclaimed television \nadvertisements.\n\nRichard Williams' current project is a 16-DVD boxed set which \nbrings together his legendary Masterclasses with his best-selling \nbook to create The Animator's Survival Kit - Animated. This has \nover 350 specially animated examples intercut with his 4 day \nMasterclass filmed at Blue Sky Studios in New York.\n\nIn the 1990s he gave the Richard Williams' Animation \nMasterclasses around the world to participants from studios such \nas Disney, Pixar, ILM, Dreamworks/PDI and Warner Bros followed by \nthe best-selling The Animators Survival Kit (2001).\n\nDuring his more than 50 years in the business Williams has been \none of the true innovators and serves as the link between the \nGolden Age of animation by hand and the new computer animation \nsuccesses. Perhaps even more important has been his dedication to \npassing along his knowledge to a new generation of animators so \nthat they in turn can push the medium in new directions.\n\n'Absolute animation genius' - LOS ANGELES TIMES\n\n'Arguably the best animator working in the field today' - \nHOLLYWOOD REPORTER\n\nVoted by peers as 'The Animator's Animator' - OBSERVER\n\n'The only &quot;genius&quot; genius to come along in animation in years ... \nprobably one of the most respected draftsmen in the world.' - LOS \nANGELES TV TIMES\n\nOSCAR: Special Academy Award 1989, Who Framed Roger Rabbit\nOSCAR: Academy Award - Special Effects 1989, Who Framed Roger \nRabbit\nOSCAR: Academy Award 1972, A Christmas Carol\nBRITISH ACADEMY AWARD: Special Achievements 1989, Who Framed \nRoger Rabbit\nEVENING STANDARD SPECIAL AWARD: Distinguished Contribution to \nBritish Cinema 1989, Who Framed Roger Rabbit\nBRITISH ACADEMY AWARD: 1958, The Little Island\nEMMY AWARD: 1982, Ziggy's Gift\nWINSOR McCAY AWARD: 1984, Distinguished Contribution to the Art \nof Animation &quot;Annie&quot;","torrent":{"xt":"urn:btih:a2728e966a7a6ee6c7af22c3a223a4545ee7beed","amp;dn":"Thief+and+the+Cobbler+Scrapbook+3+%28Richard+Williams+Animation%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2728e966a7a6ee6c7af22c3a223a4545ee7beed","infoHashBuffer":{"type":"Buffer","data":[162,114,142,150,106,122,110,230,199,175,34,195,162,35,164,84,94,231,190,237]},"announce":[],"urlList":[]}}