{"title":"Habitacion en Roma.spa.(k.ant-ON.2010)","uid":5855294,"size":460820657,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a45f0371c5c6d96d7b0bf772fa6888937457667d&amp;dn=Habitacion+en+Roma.spa.%28k.ant-ON.2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"koky1024","files":6,"time":1285584794,"description":"Una habitaciÃƒÂ³n de hotel en el centro de Roma es el escenario interior en el que dos mujeres jÃƒÂ³venes que se acaban de conocer, se internan juntas en una aventura fÃƒÂ­sica que les tocarÃƒÂ¡ el alma. \n\nTodo transcurre en una noche y en las primeras horas de la maÃƒÂ±ana de un dÃƒÂ­a del comienzo del verano de 2008, antes de que Roma lance a cada una de ellas al lugar al que pertenecen; por la tarde Alba volarÃƒÂ¡ a EspaÃƒÂ±a, y Natasha a Rusia. \n\nLa habitaciÃƒÂ³n del hotel, que parece haberlas estado esperando siempre con la emociÃƒÂ³n de la Historia incrustada en sus viejas paredes, sugestiona una atmÃƒÂ³sfera cargada de erotismo y sensualidad, con una extraÃƒÂ±a fuerza que engancha sus miradas apuntando hacia lo desconocido. Nacen sentimientos nuevos que Alba y Natasha aceptan, y al mismo tiempo quitan importancia hablÃƒÂ¡ndose con soltura y buen humor. Un pacto natural de ligereza que propicia situaciones tan cÃƒÂ³micas como enigmÃƒÂ¡ticas, antes del ataque inesperado de un amor punzante como una flecha lanzada desde lo alto. \n\nDurante doce horas, de noche y de dÃƒÂ­a, estas dos mujeres desvelarÃƒÂ¡n sus vidas, primero ocultÃƒÂ¡ndose y protegiÃƒÂ©ndose por miedo a la atracciÃƒÂ³n sin retorno, luego dejÃƒÂ¡ndose acompaÃƒÂ±ar hacia el paisaje desconocido de la otra, habitado por sus compromisos y el amor sincero hacia sus respectivas parejas; en el caso de Alba, una mujer que tiene dos hijos; y el de Natasha, su profesor de Renacimiento con el que se va a casar la prÃƒÂ³xima semana. \n\nAmbas girarÃƒÂ¡n sobre si mismas hasta ponerse boca arriba mirando juntas hacia otra verdad, un abismo compartido, el secreto guardado en una habitaciÃƒÂ³n en Roma, una sorpresa del tiempo anterior que les adelanta, un regalo del destino para que hagan con ÃƒÂ©l lo que mÃƒÂ¡s deseen. \n\nAsÃƒÂ­ nace para ellas su nueva libertad. \n","torrent":{"xt":"urn:btih:a45f0371c5c6d96d7b0bf772fa6888937457667d","amp;dn":"Habitacion+en+Roma.spa.%28k.ant-ON.2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a45f0371c5c6d96d7b0bf772fa6888937457667d","infoHashBuffer":{"type":"Buffer","data":[164,95,3,113,197,198,217,109,123,11,247,114,250,104,136,147,116,87,102,125]},"announce":[],"urlList":[]}}