{"title":"Amy Grant - Better Than A Hallelujah (2nafish)","uid":5898116,"size":136804356,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a5ac25417adab9b2a93ddb49525df82aa920e549&amp;dn=Amy+Grant+-+Better+Than+A+Hallelujah+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1287573650,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Better Than a Hallelujah&quot; is a digital MP3 single released in 2010 to promote Amy Grant's album Somewhere Down the Road, which was also released in 2010. The single for &quot;Better Than a Hallelujah&quot; was released to radio for airplay and additionally released commercially as a digital MP3, as the same version to appear on the album. The radio single reached number 8 on the Christian charts.\n\nAlthough not included on the single release, an &quot;Ambient Mix&quot; of the song was released digitally as a bonus track for the album Somewhere Down the Road for those individuals who purchased the album as a pre-release on iTunes.\n\nSomewhere Down The Road is the nineteenth album by Christian music and pop music singer-songwriter Amy Grant, released in 2010. It is a unique album featuring 6 brand new songs, 2 previously unreleased songs, a new recording of the classic song &quot;Arms Of Love&quot;, and rounded out with 3 of Grant's previously released story-songs.\n\nThe album title is taken from the title track, Somewhere Down the Road, also a promotional single from Grant's 1997 album Behind the Eyes. The song was originally also featured on the first and only commercial single from the Behind the Eyes album, Takes a Little Time. The painting featured on the cover of the album includes a painting by Grant, with the inscription Somewhere Down The Road. Grant gave the original painting as gift to her friend and publicist Jennifer Cooke.\n\nMost of the new songs on the album were recorded in the new studio that Grant and her husband Vince Gill recently had built into their home. One of the songs on the album, &quot;Overnight&quot;, is a duet recorded with Sarah Chapman, Grant's daughter. Grant wrote &quot;Unafraid&quot; about her mother. \n\nAmy Grant (born November 25, 1960) is an American singer-songwriter, musician, author, media personality and occasional actress, best known for her Christian music. She has been referred to as &quot;The Queen of Christian Pop&quot;. As of 2009, Grant remains the best-selling contemporary Christian music singer ever, having sold over 30 million units worldwide.\n\nGrant made her debut as a teenager, and gained fame in Christian music during the 1980s with such hits as &quot;Father's Eyes,&quot; &quot;El Shaddai&quot;, and &quot;Angels&quot;. During the 1980s and 1990s, she became one of the first gospel artists to cross over into mainstream pop on the heels of her successful albums Unguarded and Heart in Motion, the latter of which included the number-one singles &quot;Baby Baby&quot; and &quot;Every Heartbeat&quot;.\n\nGrant has won six Grammy Awards, 25 Gospel Music Association Dove Awards, and had the first Christian album ever to go Platinum. Heart in Motion is her highest selling album, with over five million copies sold in the United States alone. She was honored with a star on Hollywood Walk of Fame in 2005 for her contributions to the entertainment industry.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a5ac25417adab9b2a93ddb49525df82aa920e549","amp;dn":"Amy+Grant+-+Better+Than+A+Hallelujah+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5ac25417adab9b2a93ddb49525df82aa920e549","infoHashBuffer":{"type":"Buffer","data":[165,172,37,65,122,218,185,178,169,61,219,73,82,93,248,42,169,32,229,73]},"announce":[],"urlList":[]}}