{"title":"The Fast and the Furious Tokyo Drift(multi subs) 2Lions-Team","uid":5790069,"size":4681737744,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a6cbe3c9d944b575a9c274744874cb62ad763c5d&amp;dn=The+Fast+and+the+Furious+Tokyo+Drift%28multi+subs%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"juutje","files":-1,"time":1282817520,"description":"The Fast and the Furious Tokyo Drift (2006) \n\nVerenigde Staten\nActie / Thriller\n104 minuten\n\ngeregisseerd door Justin Lin\nmet Lucas Black, Nathalie Kelley en Sung Kang\n\nShaun Boswell was altijd al een buitenbeentje. Zijn enige binding met de buitenwereld is illegaal straatracen. Om aan celstraf te ontkomen moet hij naar zijn vader in Tokio die daar in het leger zit. Japan is nu net het land waar het straatracen is uitgevonden... Bij zijn eerste mislukte poging neemt hij het op tegen de &quot;Drift King&quot; die banden heeft met de Japanse maffia, Yakuza. Hij begeeft zich noodgedwongen in de onderwereld van Tokio in een spel op leven en dood.\n\nEngels\n\nSean Boswell, who has always been an outsider. A loner at school, his only connection to the indifferent world around him is through illegal street racing -- which has made him particularly unpopular with the local authorities. To avoid jail time, Sean is sent out of the country to live with his Farther in the military, in a cramped apartment in a low-rent section of Tokyo. In the land that gave birth to the majority of modified racers on the road, the simple street race has been replaced by the ultimate pedal-to-the-metal, gravity-defying automotive challenge ... drift racing, a deadly combination of brutal speed on heart stopping courses of hairpin turns and switchbacks. For his first unsuccessful foray in drift racing, Shean unknowingly takes on D.K., the &quot;Drift King,&quot; with ties to the Yakuza, the Japanese crime machine. The only way he can pay off the debt of his loss is to venture into the deadly realm of the Tokyo underworld, where the stakes are life and death.\n\nWeblink http://www.imdb.com/title/tt0463985/\nWeblink http://www.moviemeter.nl/film/34447\n\nVideo          : Retail DVD Rip\nAudio          : AC 3  2-ch English \nSubs           : English Hungarian Dutch Danish Finnich Hebrew Norwegian Swedish\nID             : 224 (0xE0)\nFormat         : MPEG Video\nFormat version : Version 2\nBit rate mode  : Variable\nWidth          : 720 pixels\nHeight         : 576 pixels\nDisplay aspect ratio : 16:9\nFrame rate     : 25.000 fps\nStandard       : PAL\nCover          : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl/index.php&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n","torrent":{"xt":"urn:btih:a6cbe3c9d944b575a9c274744874cb62ad763c5d","amp;dn":"The+Fast+and+the+Furious+Tokyo+Drift%28multi+subs%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6cbe3c9d944b575a9c274744874cb62ad763c5d","infoHashBuffer":{"type":"Buffer","data":[166,203,227,201,217,68,181,117,169,194,116,116,72,116,203,98,173,118,60,93]},"announce":[],"urlList":[]}}