{"title":"Coast To Coast Am - 09-12-10 - Children's Pararnormal Experienc","uid":5828417,"size":55313744,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a7fe6c4539dd92f78c83ebab7c265d5a6e943b8e&amp;dn=Coast+To+Coast+Am+-+09-12-10+-+Children%5C%27s+Pararnormal+Experienc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1284413997,"description":"Date:  \t09-12-10\nHost: \tIan Punnett\nGuests: \tUrsula Bielski\n\nIn the first half of the show, author and parapsychology expert, Ursula Bielski, discussed children's paranormal experiences. She noticed that her own child, when very young, seemed to perceive things that others couldn't see. This led her to conclude that benevolent spirits like deceased relatives might be interacting and helping out with young children. Conversely, negative entities like Shadow People can also have interactions with children, preying on their positive energy and openness, when they are away from adults, she noted. Typically, kids' paranormal perceptions fade away as they get older, she added.\n\nBielski spoke about some well-known incidents of the paranormal involving children, such as the Tina Resch poltergeist case. As a teenager, the girl had telekinetic episodes, with objects flying around her such as eggs that came out of the refrigerator, and a telephone handset (photo).\n\nInterestingly, a number of toys may be haunted, she revealed. One of the best known cases is that of Annabelle, a giant sized Raggedy Ann doll. Annabelle was said to come to life, attacking two girls, and scratching a boy. Ed &amp; Lorraine Warren conducted an investigation and concluded that an entity had entered the doll, because the owners had spoke to it like a person. Bielski also shared stories about growing up in a haunted house, and Chicago lore, like the case of &quot;Seaweed Charlie,&quot; the ghost of a pilot who crashed in Lake Michigan and was seen covered in seaweed near where he was buried at Calvary Cemetery.\n\nThe latter half of the show featured Open Lines.\nWebsite(s):\n\n    * chicagohauntings.com\n","torrent":{"xt":"urn:btih:a7fe6c4539dd92f78c83ebab7c265d5a6e943b8e","amp;dn":"Coast+To+Coast+Am+-+09-12-10+-+Children%5C%27s+Pararnormal+Experienc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7fe6c4539dd92f78c83ebab7c265d5a6e943b8e","infoHashBuffer":{"type":"Buffer","data":[167,254,108,69,57,221,146,247,140,131,235,171,124,38,93,90,110,148,59,142]},"announce":[],"urlList":[]}}