{"title":"Moby - Wait For Me (2nafish)","uid":5881928,"size":151371780,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a91f2a60cff5c18efedb7c9bc3aab1fcd44c21db&amp;dn=Moby+-+Wait+For+Me+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1286867352,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nWait for Me is the ninth studio album by the musician Moby, released on June 29, 2009. Moby announced the title, track listing and release date of the album on his website on April 14, 2009.\n\nThe first single from the album was &quot;Shot in the Back of the Head.&quot; The song's accompanying music video was directed by David Lynch. The videos to Pale Horses and Mistake feature the alien (shown on the cover) and a dog. The alien is a new design of &quot;Little Idiot&quot; who appeared in earlier videos and is also the name of Moby's own label, which the album was released on.\n\nThe album was re-released on a Deluxe Edition on November 23, 2009 featuring the complete Wait for Me original album, two new songs (including the brand new single &quot;One Time We Lived&quot;), an extra CD of ambient versions of almost all the songs, and a DVD featuring many recent live performances, an intimate EPK of the album, a section of questions and answers, and five music videos made for the album.\n\nRichard Melville Hall (born September 11, 1965), better known by his stage name Moby, is an American DJ, singer-songwriter, and musician.\n\nHe sings and plays keyboard, guitar, bass guitar and drums. Moby became a successful artist on the ambient electronica scene, and achieved eight top 40 singles in the UK during the 1990s. In 1999 he released the album Play, a mix of melancholic chill-out, ambient music, and upbeat electronica, that was critically acclaimed and produced an impressive eight hit singles (including his most popular songs &quot;Porcelain&quot;, &quot;Natural Blues&quot; and &quot;Why Does My Heart Feel So Bad?&quot;). Play became a commercial and cultural phenomenon, selling over 10 million copies worldwide (the best-selling electronica album ever) and with its eighteen songs receiving an unprecedented licensing in films, television and commercial advertisements.\n\nHis follow-up album, 18 (2002) was also successful, receiving positive to mixed response. His next offer, the mostly upbeat Hotel (2005) received lukewarm reviews and poor sales in general. Moby released his most recent albums, Last Night (2008) and Wait for Me (2009), finding good reviews and moderate sales. AllMusic considers Moby &quot;one of the most important dance music figures of the early '90s, helping bring the music to a mainstream audience both in the UK and in America&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a91f2a60cff5c18efedb7c9bc3aab1fcd44c21db","amp;dn":"Moby+-+Wait+For+Me+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a91f2a60cff5c18efedb7c9bc3aab1fcd44c21db","infoHashBuffer":{"type":"Buffer","data":[169,31,42,96,207,245,193,142,254,219,124,155,195,170,177,252,212,76,33,219]},"announce":[],"urlList":[]}}