{"title":"NCIS Complete Season 3 DVD Rip","uid":5831353,"size":14395128460,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a92608c5c44a5c2a3ba706cbf3c24a735886fd1c&amp;dn=NCIS+Complete+Season+3+DVD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tmax666","files":26,"time":1284524570,"description":"NOTICE:  I am seeding this PAINFULLY  slow until the leachers who have DL'd NCIS Season 2 and Season 1 seed the what they have downloaded.\n\n My share ratio for Season 2 is 3.81....BUT I  am the ONLY seeder.  Come on people and GET REAL!\n\nOnce I see 4 seeders (beside myself) for NCIS Season 2 and 1,  I will go FULL THROTTLE on Season 3.  I have the speed to complete a 12 GB seed in 24 hours\n\n\nKEEP SEEDING.\n\nEnough of my rant...\n\n- - - - - - - - - - - - - - - - - - - -\n\nNCIS - TV show  H.264 .m4v/.mp4\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nSEASON 3\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nI downloaded  DVD's of NCIS and ripped H.264 MP4 files of each episode.  The files have a suffix of .m4v as they were ripped using Handbrake with an Apple TV standard so they can be played on any iPod, iPhone, iPad, Apple TV or in iTunes.  They can also be played on any compliant player but you may need to change the suffix from .m4v to .mp4.\nFor whatever reason dark areas of the original DVD appear slightly red.  I also notice this on broadcast episodes and I think this is induced in the production of the show, but is more noticeable on the DVD's.  This is not a rip defect.\n   \nThere are no subtitles or alternate languages.\n\nFull episode descriptions can be found at:\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/List_of_NCIS_episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/List_of_NCIS_episodes&lt;/a&gt;\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \nNCIS, also known as NCIS: Naval Criminal Investigative Service, is an American police procedural drama television series revolving around a fictional team of special agents from the Naval Criminal Investigative Service, which conducts criminal investigations involving the U.S. Navy and Marine Corps.\n\nWith two solid seasons already banked, NCIS returns for a compelling third year with exciting plotlines and a slightly tweaked cast. The show's second season ended with the brutal and shocking death of Caitlin Todd (Sasha Alexander). The first two episodes of this season deal with the aftermath of bringing her killer to justice and examining the emotional impact of her loss on the remaining members of the NCIS team, which is led by Jethro Gibbs (Mark Harmon). The six-disc set includes all 24 episodes, which aired on CBS during 2005-2006. Returning are happy-go-lucky ladies' man Tony DiNozzo (Michael Weatherly, Dark Angel), forensics expert and resident Goth chick Abby Sciuto (Pauley Perrette), medical examiner Dr. Donald &quot;Ducky&quot; Mallard (David McCallum, The Man from U.N.C.L.E), and agent Timothy McGee (Sean Murray). Former Mossad intelligence officer Ziva David (Cote de Pablo) joins the close-knit cast, as does Jennifer Shepard (Lauren Holly, Dumb &amp; Dumber) as the new NCIS director. Working on a daily basis with Shepard initially makes Gibbs wary. Not only is she a former girlfriend, but she also was his underling at one time. Equal parts CSI and JAG, NCIS works primarily because of its quirky cast, which is able to take sometimes regurgitated ideas and rework them into something engagingly watchable. Throughout this season, we will see agents endangered and framed, and one will accidentally kill an undercover detective who may not have been armed. But the explosive two-part season finale will finally shed light on Gibbs' painful history and help explain why he is who is he today.","torrent":{"xt":"urn:btih:a92608c5c44a5c2a3ba706cbf3c24a735886fd1c","amp;dn":"NCIS+Complete+Season+3+DVD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a92608c5c44a5c2a3ba706cbf3c24a735886fd1c","infoHashBuffer":{"type":"Buffer","data":[169,38,8,197,196,74,92,42,59,167,6,203,243,194,74,115,88,134,253,28]},"announce":[],"urlList":[]}}