{"title":"Cubecart v3 Nulled.Lisus","uid":5826501,"size":4739110,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:aad9f82e3e4e3ffceccbe4d65666a90a065b3f50&amp;dn=Cubecart+v3+Nulled.Lisus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lisus91","files":940,"time":1284305572,"description":"CubeCart is an &quot;out of the box&quot; ecommerce shopping cart software solution which has been written to run on servers that have PHP &amp; MySQL support. With CubeCart you can quickly setup a powerful online store which can be used to sell digital or tangible products to new and existing customers all over the world.\n\nThere are a great deal of powerful features enabling your business to trade online successfully. It is easy to modify the look and feel of your store to match your company's branding or to site comfortably beside your existing website due to CubeCart's powerful HTML template system. Our solutions are robust, flexible, affordable and are supported by not only a profitable and stable company but a thriving community of enthusiasts who are keen to recommend it and share their ideas and experience.\n\nTo use CubeCart you will require a compatible web hosting account. If you wish to take credit/debit card payments a merchant account will be required to work with one of the supported modules.\n\nIf you have any questions about our products or services, please be sure to contact a member of staff who will be delighted to help.\n\n\nNulled By Lisus - All Powered by Cubecart removed!","torrent":{"xt":"urn:btih:aad9f82e3e4e3ffceccbe4d65666a90a065b3f50","amp;dn":"Cubecart+v3+Nulled.Lisus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aad9f82e3e4e3ffceccbe4d65666a90a065b3f50","infoHashBuffer":{"type":"Buffer","data":[170,217,248,46,62,78,63,252,236,203,228,214,86,102,169,10,6,91,63,80]},"announce":[],"urlList":[]}}