{"title":"Morehall Fisheries Article www.morehallfisheries.co.uk","uid":5686907,"size":1425,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:aae97725142d15059c4627c79fcc5cade89f5605&amp;dn=Morehall+Fisheries+Article+www.morehallfisheries.co.uk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MorehallFishery","files":1,"time":1278949750,"description":"Morehall Water Gardens and Fishery was once a successful garden centre, with fishing ponds with an on site cafe, but one of the owners pulled out of the partnership and business was too much for the only owner and he sadly closed the site. \nBut it has now re-opened and living a new life as a day ticket fishery with match bookings available.\nMorehall Fisheries has either a 10 peg or a 15 peg pond available for matches. These can be blocked booked for club matches.\nMorehall Fisheries is located between Deepcar and Oughtibridge on Manchester Road (A6102).\nThere are currently 2 ponds available to fish and they are the largest ones in the fishery. Although I am aware that the other 2 ponds should be available to fish soon. \nThe ponds are well stocked with Carp, Bream, Roach, Ide, Golden Orf, Rudd, Chubb and Tench there are fish weighting from Â¾lb to 7lb upon last stocking (April 2010)\nMorehall Fisheries is a very peaceful and friendly site, it is well maintained and looked after. \nThe site is open 6am while 10pm 7 days a week and is always manned.\nThere is plenty of parking available which can be seen from the majority of the pegs.\nThere are female and male toilets available on site and also tea and coffee is sold.\nI also believe the bailiff will allow night fishing upon request.\nIf you are interested in this great little fishery then check out the website it is http://www.morehallfisheries.co.uk","torrent":{"xt":"urn:btih:aae97725142d15059c4627c79fcc5cade89f5605","amp;dn":"Morehall+Fisheries+Article+www.morehallfisheries.co.uk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae97725142d15059c4627c79fcc5cade89f5605","infoHashBuffer":{"type":"Buffer","data":[170,233,119,37,20,45,21,5,156,70,39,199,159,204,92,173,232,159,86,5]},"announce":[],"urlList":[]}}