{"title":"FIFA 2011 [PAL][PS3][Multi5][Spanish][www.consolasatope.com]","uid":5854604,"size":9702833330,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:aaf2df07927df23a679c8d7646b191308cf4b00d&amp;dn=FIFA+2011+%5BPAL%5D%5BPS3%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":59,"time":1285551797,"description":"FIFA 11 reinventa la autenticidad de los jugadores para cada jugador y en cada posiciÃƒÂ³n del campo con Personality+, una nueva caracterÃƒÂ­stica que muestra las habilidades individuales reflejadas en el juego, diferenciando de forma clara a cada jugador.\n\nCon Personality+ cada jugador se distingue del resto gracias a una sofisticada base de datos que evalÃƒÂºa de forma individual las habilidades de los jugadores sobre 36 atributos y 57 rasgos, recogidos por 1700 ojeadores de todo el mundo.\n\nLos porteros tambiÃƒÂ©n mejoran gracias a Personality+. La personalidad real del portero, si es acrobÃƒÂ¡tico o tradicional, dictarÃƒÂ¡ su estilo en el juego.\n\nConstruido sobre la base de FIFA 10, que ganÃƒÂ³ 50 premios de Juego del AÃƒÂ±o, FIFA 11 introduce el nuevo Pro Passing, con el que la precisiÃƒÂ³n del pase estÃƒÂ¡ determinada por la habilidad del jugador con el mando, la habilidad del futbolista y la situaciÃƒÂ³n y el peligro en el campo.\n\nSistema Pro Passing. Un nuevo sistema de pases donde la precisiÃƒÂ³n del pase estÃƒÂ¡ determinada por la habilidad del jugador con el mando, la habilidad del futbolista y la situaciÃƒÂ³n de peligro en el campo, haciendo el juego mucho mÃƒÂ¡s realista.\n\nPersonality+ en la IA de la CPU, en las celebraciones y en los modelos de los jugadores. Las estrellas tienen un arsenal de movimientos ÃƒÂºnicos, con mayor variedad de cuerpos y modelos, y la posibilidad de celebrar los goles e interactuar con los compaÃƒÂ±eros.\n\nCÃƒÂ¡nticos Personalizados. Asigna cÃƒÂ¡nticos personalizados para cada equipo y liga. PodrÃƒÂ¡s incluso oÃƒÂ­r tu propio nombre en las gradas y reproducir tu propia mÃƒÂºsica desde tu disco duro.\n\nAvanzada AtenciÃƒÂ³n de los Porteros. Los porteros reaccionan con mÃƒÂ¡s inteligencia a cada situaciÃƒÂ³n de peligro.\n\nFIFA Theatre. Guarda las jugadas destacadas de cada partido, incluidas las de partidos online en tu disco duro, reprodÃƒÂºcelas o sÃƒÂºbelas a Footballworld.com.\n\nVirtual Pro. Crea un futbolista profesional,con tu propia cara en 3D, utilizando Photo Game Face y desarrolla las caracterÃƒÂ­sticas de tu jugador virtual\n","torrent":{"xt":"urn:btih:aaf2df07927df23a679c8d7646b191308cf4b00d","amp;dn":"FIFA+2011+%5BPAL%5D%5BPS3%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaf2df07927df23a679c8d7646b191308cf4b00d","infoHashBuffer":{"type":"Buffer","data":[170,242,223,7,146,125,242,58,103,156,141,118,70,177,145,48,140,244,176,13]},"announce":[],"urlList":[]}}