{"title":"The Donnas - Take It Off (2nafish)","uid":5790032,"size":106850308,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ab9f1dbcc9290326cfa06609e860dc194d3d1a5e&amp;dn=The+Donnas+-+Take+It+Off+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1282814599,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nSpend the Night is the fifth studio album and major label debut by the American hard rock band The Donnas, released in 2002 on Atlantic Records. It was the band's first charting record on the Billboard Hot 200, peaking at #62, and features their most successful single, &quot;Take It Off&quot;, which peaked at #19 on the Billboard Modern Rock Tracks chart. The track &quot;Who Invited You&quot; was featured in the video game MVP Baseball 2003. \n\nThe Donnas are an American all-female rock band from Palo Alto, California. They draw inspiration from The Ramones, The Runaways, AC/DC, and Kiss. Rolling Stone has stated that &quot;the Donnas offer a guileless take on adolescent alienation; they traffic in kicks, not catharsis, fun rather than rage&quot;. MTV has stated that the band offers &quot;nothing more than a good old-fashioned rock &amp; roll party&quot;. After gathering a cult following in the punk scene since their 1993 debut, the band achieved major label commercial success in the early 2000s and afterward.\n\nIn 2002, The Donnas released Spend the Night  as their Atlantic debut. The album represented their first attempt at mainstream success. With their single &quot;Take it Off&quot; they were booked for appearances on Total Request Live, Saturday Night Live, The Tonight Show with Jay Leno, and The Late Show with David Letterman. In the summer of 2003, they played the main stage at Lollapalooza. In 2004, they released their sixth album Gold Medal. In February 2005, they toured Australia with the Big Day Out music festival, playing from Sydney to Perth.\n\nAtlantic repeatedly placed the Donnas' music in video game soundtracks. &quot;You've Got A Crush On Me&quot; can be heard in the PlayStation 2 game, Splashdown. &quot;Who Invited You&quot; can be found on soundtrack for True Crime: Streets of LA and MVP Baseball 2003. &quot;I Don't Want to Know&quot; is in the Gran Turismo 4 soundtrack also and a cover of the song was also used for Donkey Konga 2 for the Nintendo GameCube. &quot;I Don't Want to Know&quot; was also used as the theme song for the first season of The-N's hit series, &quot;South of Nowhere&quot;. A cover of &quot;Take it Off&quot; is featured in Guitar Hero and added as a downloadable track in Guitar Hero 2 on the Xbox 360 (released in 2006) and Downhill Domination (released in 2004). Rock Band 2 (for the PS3, Xbox 360 &amp; Wii), released by Harmonix in 2008, features the track &quot;New Kid In School&quot; which was released exclusively on Apples iTunes service. &quot;Fall Behind Me&quot; was also used in a national television commercial advertising the Nissan Xterra.\n\nAtlantic also energetically marketed the Donnas through placements in numerous film soundtracks. The band appeared in the movie Drive Me Crazy in 1999 (as The Electrocutes), and later on the TV show Charmed performing the single &quot;Fall Behind Me&quot; at P3. They also appeared in the 1999 teen comedy Jawbreaker as the prom band, contributing two songs to the soundtrack (&quot;Rock 'N' Roll Machine&quot; and &quot;Checkin' It Out&quot;). A cover of &quot;Roll On Down The Highway&quot; was used in a Disney commercial. The Donnas can also be heard on Mean Girls during the end credits playing a cover of the Billy Idol song &quot;Dancing With Myself&quot;, and they also contributed to the soundtrack of the movie Grind. The video &quot;Too Bad About Your Girl&quot; also features the cast of that film. The song &quot;Take It Off&quot; features in the movie Dodgeball. The song &quot;Take Me To The Backseat&quot; can be heard in the movie D.E.B.S. (2004 film). A cover version of the Kiss song &quot;Strutter&quot; was used in the soundtrack to the 1999 movie Detroit Rock City (film). Then Guitar Hero used &quot;Take It Off&quot; for 2009 Guitar Hero Smash Hits. &quot;Take It Off&quot; was also used in the 2009 hit movie The Hangover (film). &quot;Play My Game&quot; was featured in a Season 1 episode of What's New, Scooby Doo?.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ab9f1dbcc9290326cfa06609e860dc194d3d1a5e","amp;dn":"The+Donnas+-+Take+It+Off+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab9f1dbcc9290326cfa06609e860dc194d3d1a5e","infoHashBuffer":{"type":"Buffer","data":[171,159,29,188,201,41,3,38,207,160,102,9,232,96,220,25,77,61,26,94]},"announce":[],"urlList":[]}}