{"title":"Stargate Universe S02E01 (NL EN subs) HDTV DD5.1 2Lions-Team","uid":5866596,"size":1659698341,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:abd6cb3f8685993025615923b24eed73571e8d1d&amp;dn=Stargate+Universe+S02E01+%28NL+EN+subs%29+HDTV+DD5.1+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":15,"time":1286230666,"description":"\nStargate Universe S02E01 (NL EN subs) HDTV DD5.1 2Lions-Team  \n\nSource:HDTV\nFormat: DVD\nNL Subs by: The Thom\nSubs: NL EN instelbaar (Lossless)\nGenre: Sciencefiction\nSound: 5.1 DD\n\n\n\nDe serie geeft antwoord op de functie van de negende 'Chevron' op de Stargate, waarvan de functie in de voorgaande series nog onbekend was.Bij aanvang van de serie blijkt dat het Amerikaanse Leger in het geheim een basis gebouwd heeft op een andere planeet zodat men het geheim van deze negende chevron kan ontrafelen. Wanener de basis onder vuur komt te liggen, lukt het een groep aanwezige militairen en wetenschappers om het enige bruikbare adres te 'draaien'. Men komt zo uit op een onbemand ruimte-vaartuig van de Ancients genaamd 'Destiny'. Dit schip werd samen met andere schepen honderdduizenden jaren terug erop uitgestuurd \nom overal in het universum Stargates te bouwen. Om de stargate op het schip zelf te bereiken dient gebruik te worden gemaakt van de negende chevron op de Stargate. Veel van de systemen aan boord van het schip blijken echter zwaar beschadigd. Het is niet mogelijk voor de groep om naar aarde terug te keren en men zit dus vast op het schip; enkele miljarden lichtjaren van thuis. Wel legt de Destiny van tijd tot tijd automatisch contact met stargates op planeten waar de groep materialen kan vinden om het schip te repareren.\n\nStargate Universe is set on the Ancient ship Destiny, which was launched unmanned hundreds of thousands of years ago. Several ships were sent ahead of it to seed the universe with Stargates. The Ancients had planned on using the Stargate to board Destiny when it was far out enough into the universe, but learned how to ascend before that time. In order to reach this ship, an address would have to be dialed consisting of nine chevrons, a possibility that had been unknown in the previous Stargate series.\nThe series begins when a team of soldiers and scientists from present-day Earth step through the Stargate to find the Destiny after their base is attacked. Many of its primary systems are damaged or failing, and they are unable to maneuver the ship or \neven return to Earth. However, the Destiny periodically stops to dial the Stargate to planets with necessary supplies to repair the ship.\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1286039/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1286039/&lt;/a&gt;\n\n*****************************************\n\nBrought to you by\nB2B\n2Lions Team, Film Terminal\n\nmeer zien??\nKom dan eens kijken op een van onze site's\n       &lt;a href=&quot;\nhttp://2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://2lions-site.nl/index.php&lt;/a&gt;\n\nof\n       &lt;a href=&quot;\nhttp://www.film-terminal.org/forum/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.film-terminal.org/forum/index.php&lt;/a&gt;\n\n\n2Lions-Team and Film Terminal for all your Dutch MOVIES and more\n\n*****************************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.\n\n*****************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team and Film Terminal are not responsible for the fake posts on our name\n\nWij 2Lions-Team en Film Terminal zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site's !!!\nto the fakers , get a life !!!\n\n*****************************************************","torrent":{"xt":"urn:btih:abd6cb3f8685993025615923b24eed73571e8d1d","amp;dn":"Stargate+Universe+S02E01+%28NL+EN+subs%29+HDTV+DD5.1+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abd6cb3f8685993025615923b24eed73571e8d1d","infoHashBuffer":{"type":"Buffer","data":[171,214,203,63,134,133,153,48,37,97,89,35,178,78,237,115,87,30,141,29]},"announce":[],"urlList":[]}}