{"title":"Adolescents after Divorce","uid":5696862,"size":15950030,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ac47d87463424f7873490b2fd195bd15eca45175&amp;dn=Adolescents+after+Divorce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1279337235,"description":"Adolescents after Divorce\nPublisher: Harvard University Press | ISBN: 0674005171 | edition 1996 | PDF | 342 pages | 14,3 mb\n\nWhen their parents divorce, some children falter and others thrive. This book asks why. Is it the custody arrangement? A parent is new partner? Conflicts or consistency between the two households? Adolescents after Divorce follows children from 1,100 divorcing families to discover what makes the difference. Focusing on a period beginning four years after the divorce, the authors have the articulate, often insightful help of their subjects in exploring the altered conditions of their lives. These teenagers come from a wide range of backgrounds. Some are functioning well. Some are faring poorly. The authors examine the full variety of situations in which these children find themselves once the initial disruption has passed--whether parents remarry or repartner, how parents relate to each other and to their children, and how life in two homes is integrated. Certain findings emerge--for instance, we see that remarried new partners were better accepted than cohabiting new partners. And when parents' relations are amicable, adolescents in dual custody are less likely than other adolescents to experience loyalty conflicts. The authors also consider the effects of visitation arrangements, the demands made and the goals set within each home, and the emotional closeness of the residential parent to the child.","torrent":{"xt":"urn:btih:ac47d87463424f7873490b2fd195bd15eca45175","amp;dn":"Adolescents+after+Divorce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac47d87463424f7873490b2fd195bd15eca45175","infoHashBuffer":{"type":"Buffer","data":[172,71,216,116,99,66,79,120,115,73,11,47,209,149,189,21,236,164,81,117]},"announce":[],"urlList":[]}}