{"title":"Carrie Underwood - Mama's Song (Xvid-2nafish) 1080p","uid":5851563,"size":119711100,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:acc0678c37d8090f86069b5d5031d67077f9739b&amp;dn=Carrie+Underwood+-+Mama%5C%27s+Song+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1285404909,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:16\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 3419 Kbps\nQuality Factor : 0.06 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Mama's Song&quot; is the title of a song recorded by American singer Carrie Underwood, co-written by her along with Kara DioGuardi, Martin Frederiksen and Luke Laird. It is the fourth single release from her third studio album, Play On. These songwriters also wrote her previous single, &quot;Undo It.&quot;\n\nIn October 2009, in advance of the album's release, &quot;Mama's Song&quot; charted at #77 on the Billboard Hot 100 and #68 on the Canadian Hot 100. It was the first of three promotional singles from the album. On the Hot Country Songs charts dated for the week ending September 4, 2010, it entered at #55.\n\nPlay On is the third studio album from American country singer Carrie Underwood. It was released in the United States  on November 3, 2009. In addition, three promotional singles were made available to iTunes prior to the release of the album. The album debuted at #1 on the Billboard 200 with first week sales of 318,000 copies; and rated as the highest first week sales for a female artist in 2009, before being overtaken by Susan Boyle a few weeks later. It is her second album to debut at #1 on the Billboard 200, and her third to debut atop the Billboard Top Country Albums chart. Play On charted at #19 on Billboard's year-end chart. As of September 2010, it has sold 1,729,000 copies in the United States, making it Underwood's third album to top the one million mark, and has been certified Platinum by the RIAA and CRIA.\n\nThe album has spawned 3 consecutive #1 singles. The first single, &quot;Cowboy Casanova&quot;, was released to country radio on September 14, 2009, and was certified Platinum by the RIAA. The second single, &quot;Temporary Home&quot;, was released to country radio on December 14, 2009, and has been certified Gold. The third single, &quot;Undo It&quot;, was released to radio on May 24, 2010,  and has sold been certified Gold. The fourth single, &quot;Mama's Song&quot;, was officially released to radio on September 13, 2010.\n\nThe album was originally to have included some songs that Underwood wrote with Ne-Yo. One of the tracks entitled &quot;Look At Me&quot; was previously recorded by country singer, Alan Jackson, on the Billy: The Early Years soundtrack. Vince Gill sang background vocals on the track. &quot;Mama's Song&quot; sold more than 31,000 copies in its debut week.\n\nOn October 16, 2009, Underwood made a promotional stop in Singapore to promote her upcoming album to the Asian media. The album was released on November 2 in Singapore and various parts of Asia, followed by a November 3 release in the United States. Underwood performed on The Late Show with David Letterman on November 2, and performed a special outdoor concert at Lincoln Center on Good Morning America on album release day, and rounded out her week with a visit to Live with Regis and Kelly on November 5.\n\nUnderwood also performed another outdoor concert for Good Morning America at the Sommet Center in Nashville on November 11, 2009, with Brad Paisley.\n\nOn the November 16, 2009 episode of The Tonight Show with Conan O'Brien, Underwood performed &quot;Temporary Home&quot;, which is the second official single from Play On.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:acc0678c37d8090f86069b5d5031d67077f9739b","amp;dn":"Carrie+Underwood+-+Mama%5C%27s+Song+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc0678c37d8090f86069b5d5031d67077f9739b","infoHashBuffer":{"type":"Buffer","data":[172,192,103,140,55,216,9,15,134,6,155,93,80,49,214,112,119,249,115,155]},"announce":[],"urlList":[]}}