{"title":"Extra DVD Ripper Express ver 8.1 incl Key","uid":5833673,"size":7605479,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ad194269bc4025bbdaa2928d3795a08ff23c8fc2&amp;dn=Extra+DVD+Ripper+Express+ver+8.1+incl+Key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pkaji123","files":1,"time":1284650200,"description":"------------------------------Extra DVD Ripper Express ver 8.1----------------------------\n\nDescription:\n============\n\nEnjoy wonderful DVD movies start from here!\n\nExtra DVD Ripper Express is a versatile DVD ripper application, it is extremely easy to use, and it will help you to convert DVD movies into almost every format including AVI, MPEG, WMV, iPod(MPEG4, H.264, MP3, AAC), iPhone(MPEG4, H.264, MP3, AAC), FLV, Sony PSP, Sony PS3, BlackBerry(3GP, AVI, WMV, MP4, MP3, AAC, M4A, WMV), Zune(WMV, MP4, MP3, AAC), Pocket PC(WMV, AVI, FLV, MP4, 3GP), RM, RMVB, Mobile 3GP, Apple TV, Archos Player, Creative Zen Player, Disney Mix Max Player, xBox360, Audio(MP3, AAC, WMA, WAV) and many other formats with no quality loss. The powerful features and unbeatable price make Extra DVD Ripper Express an affordable and powerful DVD ripper solution on personal computer.\n\nKey features in Extra DVD Ripper Express:\n=========================================\n\n\n\n   * Rips DVD movies to AVI with latest DivX CODEC\n   * Rips DVD movies to VCD, SVCD, MPEG\n   * Rips DVD moves to Mobile 3GP\n   * Rips DVD movies to RealPlayer RM, RMVB\n   * Rips DVD movies to Audio MP3, AAC, WM4, WAV\n   * Rips DVD movies to Apple iPod MPEG4, H.264, MP3 Audio, AAC Audio\n   * Rips DVD movies to Apple iPhone MPEG4, H.264, MP3 Audio, AAC Audio\n   * Rips DVD movies to small size Flash FLV Video file for online distribution.\n   * Rips DVD movies to Sony PSP(MPEG4, H.264), Sony PS3(MPEG4, FLV, MPEG2)\n   * Rips DVD movies to BlackBerry 3GP, AVI, WMV, MP4, MP3, AAC, WMV, M4A\n   * Rips DVD movies to Windows Media Video 8, Windows Media Video 9\n   * Rips DVD moves to Microsoft Zune Player WMV, MP4, MP3, AAC\n   * Rips DVD moves to Pocket PC WMV, AVI, FLV MP4 3GP\n   * Rips DVD movies to Apple TV, Archos Players, Creative Zen Player, Disney Mix Max     Player, xBox360, HP iPAQ Series\n\n\n4. Various settings provide the flexibility and effectiveness of output.\n5. Choose subtitles and Audio tracks to rip.\n6. Output file size is adjustable. You can compress movies to any size you need.\n7. Supports preview. You can see the ripping progress in a preview window.\n8. Choose different DVD types: both NTSC and PAL are supported.\n\n\n\nUsage:\n======\n\n1)Unpack\n2)Install\n3)Register with the info in the Readme\n\nHope you guys will like my uploads,so please help me to seed this torrent.","torrent":{"xt":"urn:btih:ad194269bc4025bbdaa2928d3795a08ff23c8fc2","amp;dn":"Extra+DVD+Ripper+Express+ver+8.1+incl+Key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad194269bc4025bbdaa2928d3795a08ff23c8fc2","infoHashBuffer":{"type":"Buffer","data":[173,25,66,105,188,64,37,187,218,162,146,141,55,149,160,143,242,60,143,194]},"announce":[],"urlList":[]}}