{"title":"HISTORY OF POP AND ROCK MUSIC - part 266","uid":5865465,"size":1334363653,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ad2c19ce4fd89b155e6a1149473cc2c758431310&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+266&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zlatkopupovac","files":-1,"time":1286149234,"description":"                PART  266\n\n\n                Groove metal\n\n         PANTERA    -   Cowboys from Hell  (1990)\n         PANTERA    -   Psycho Holiday  (1990)\n         PANTERA    -   5 Minutes Alone  (1994)\n         SEPULTURA    -   Bullet the Blue Sky  (2003)\n         SEPULTURA    -   Mindwar (2003)\n         MACHINE HEAD  - Descend the Shades of Night (2003)  \n         DEVILDRIVER  -   Not All Who Wander Are Lost  (2007)   \n         SEPULTURA    -   Ostia  (2008)\n\n\n      &quot;Cowboys from Hell&quot; is a song by Pantera from the album of the same name.With an instantly recognizable guitar riff, &quot;Cowboys from Hell&quot; is one of the most popular Pantera songs. &quot;Cowboys from Hell&quot; ranked #25 on VH1's 40 Greatest Metal Songs.The video, along with &quot;Psycho Holiday&quot;, also from the &quot;Cowboys from Hell&quot;  album, was shot in a Dallas club that the band was often found at called &quot;the Basement&quot;. The video simply shows the band playing the song live to an audience. &quot;Cowboys from Hell&quot; is Pantera's fifth album and their first Atco Records album, recorded at The Dallas Sound Lab in Irving, TX and released on July 24, 1990. This was their first commercially successful album, exposing the band's groove metal style to mainstream audiences.On the Billboard Music Charts Top Heatseekers, album &quot;Cowboys from Hell&quot; peaked at #27. \n\n     &quot;5 Minutes Alone&quot; is a song by Pantera from their 1994 album &quot;Far Beyond Driven&quot;.It is the seventh album by Pantera. It was released on March 15, 1994 through East West Records. Upon its release, it debuted at #1 on the Billboard 200 and is one of the heaviest albums to do so.The song &quot;5 Minutes Alone&quot; also appears on the bands live album. &quot;5 Minutes Alone&quot; was covered by the bands Lamb of God, DevilDriver, Soilwork, and Killswitch Engage  in Dallas, Texas on December 8, 2007 on the 3rd anniversary of Dimebag Darrell's death. It featured 3 vocalists, 5 guitarists, and 3 drummers. \n\n      &quot;Bullet the Blue Sky&quot; is the fourth track from U2's 1987 album, &quot;The Joshua Tree&quot;. The song was originally written about the United States' military intervention during the 1980s in the El Salvador Civil War.\nSepultura recorded a cover version  of the song on their album &quot;Roorback&quot; released in 2003.Album  received positive reviews, and managed to place on Billboard's Independent Music Chart at #17.The songs &quot;Mindwar&quot; and &quot;Bullet the Blue Sky&quot; were released as singles and music videos.\n\n     &quot;Descend the Shades of Night&quot;  is a song by Machine Head from their &quot;Through the Ashes of Empires&quot; album. &quot;Through the Ashes of Empires&quot; was released in the UK, Europe and Australia on the Roadrunner Records International label on December 16, 2003.The album has since proven to be a success, not only with critics and charts, but also with fans. The album has been well-embraced as an excellent return to form both musically and lyrically.\n \n     &quot;Not All Who Wander Are Lost&quot;, a single off the 2007 album &quot;The Last Kind Words&quot; by American groove metal band Devildriver.The album debuted at number 48 on the U.S. Billboard 200, selling about 14,000 copies in its first week.This is the first album to feature DevilDriver's melodic death metal  influence by using melodic death-like leads on the guitar in some songs, and they make frequent use of guitar solos throughout the album\n\n     &quot;Ostia&quot; is a song by Sepultura from their &quot;Dante XXI&quot; album. It was the tenth studio album by Sepultura, released in 2006. &quot;Dante XXI&quot; was a concept album based on the three sections of Dante Alighieri's The Divine Comedy; Inferno (hell), Purgatorio (purgatory) and Paradiso (paradise). Upon the album's release, the majority of critics said that this is the best Sepultura album featuring Derrick Green on vocals thus far. In January 2008 the band released a music video for the song &quot;Ostia&quot;\n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:ad2c19ce4fd89b155e6a1149473cc2c758431310","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+266","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad2c19ce4fd89b155e6a1149473cc2c758431310","infoHashBuffer":{"type":"Buffer","data":[173,44,25,206,79,216,155,21,94,106,17,73,71,60,194,199,88,67,19,16]},"announce":[],"urlList":[]}}