{"title":"Metal Gear Solid 4 Guns of the Patriots [PAL][PS3][Multi6][Spani","uid":5840254,"size":32363311586,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ad86556d655a3474bcb335d626485ff6813cadba&amp;dn=Metal+Gear+Solid+4+Guns+of+the+Patriots+%5BPAL%5D%5BPS3%5D%5BMulti6%5D%5BSpani&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":329,"time":1284922292,"description":"Plataforma: PS3\nGÃƒÂ©nero: AcciÃƒÂ³n &gt; AcciÃƒÂ³n tÃƒÂ¡ctica\nOnline: Si\nRegiÃƒÂ³n: EUR\nIdiomas: Multi5 incluido EspaÃƒÂ±ol\nMultijugador: No\nSource: FullBlu-Ray\nTamaÃƒÂ±o Sin Comprimir: 32 GB\nTamaÃƒÂ±o Comprimido: 24.73 Gb\nMetodo de carga: Backupmanager, compatible con HD externo e Interno\nCompatibilidad: Compatible con PSJ y derivados (probado con PSGroove)\n\nResumen:\nLa ÃƒÂºltima misiÃƒÂ³n. El ÃƒÂºltimo capÃƒÂ­tulo. Solid Snake cierra su ciclo en Metal Gear Solid con Guns of the Patriots, el juego en el que todas las preguntas eternas de la serie acaban siendo contestadas.\n\nHideo Kojima concluye la historia de Solid Snake de forma exclusiva en PlayStation 3 firmando un contundente ejercicio narrativo que muestra unos excelentes valores de producciÃƒÂ³n y mejora sus propias convenciones jugables dentro del espionaje tÃƒÂ¡ctico. Una clara contribuciÃƒÂ³n a que el cine y los videojuegos estÃƒÂ©n cada dÃƒÂ­a mÃƒÂ¡s cerca.\n\nUn viejo soldado con una cuenta pendiente, en un campo de batalla que ya no reconoce. Snake y la guerra moderna que los Patriots han creado. Un tÃƒÂ­tulo ÃƒÂºnico en un momento de incertidumbre para PlayStation 3. La primera sensaciÃƒÂ³n que Hideo Kojima nos hace experimentar en los primeros minutos de Guns of the Patriots es la tristeza; el hÃƒÂ©roe Solid Snake, el 'Enfant Terrible' engendrado con los mejores genes del legendario Big Boss, sufre vejez prematura y estÃƒÂ¡ muy enfermo. Rememorando unos recuerdos que no son suyos, vemos cÃƒÂ³mo presenta sus respetos ante la tumba de una heroÃƒÂ­na que dio su vida para salvar al mundo cuando ÃƒÂ©l todavÃƒÂ­a no habÃƒÂ­a nacido. En ese momento, cuando sus pensamientos le impulsan a no seguir viviendo, es reclutado por Otacon y Campell para su ÃƒÂºltima misiÃƒÂ³n.\n\nMetal Gear Solid 4 acerca a un terreno comÃƒÂºn y compartido entre ocio electrÃƒÂ³nico y el cine. Pocos videojuegos cimentan la experiencia que ofrecen al jugador en una reparto casi proporcional entre horas de juego y secuencias cinemÃƒÂ¡ticas siendo ÃƒÂ©stas oro puro. Es una fÃƒÂ³rmula que pocos tÃƒÂ­tulos pueden incluir, que pocos estudios y creativos son capaces de levantar, pero con esta gran conclusiÃƒÂ³n ha logrado que su visiÃƒÂ³n sea totalmente sostenible; adictivo como un videojuego y emocionante como la mejor pelÃƒÂ­cula.\n\nEl guiÃƒÂ³n ha sido el elemento que mÃƒÂ¡s ocupado ha tenido a Hideo Kojima en los ÃƒÂºltimos aÃƒÂ±os, en el que ha invertido mÃƒÂ¡s energÃƒÂ­as dentro de toda la serie. Es lÃƒÂ³gico tratÃƒÂ¡ndose de la conclusiÃƒÂ³n de una historia que cada vez que debÃƒÂ­a responder, formulaba nuevas preguntas. Pero aquÃƒÂ­ no hay lugar para evasivas. Todas las respuestas a los enigmas de Metal Gear se contestan con claridad meridiana. Y como era de esperar, ÃƒÂ©stas no son precisamente previsibles. Desde los filÃƒÂ³sofos y su legado, hasta la fundaciÃƒÂ³n de los Patriots y su dominio polÃƒÂ­tico y econÃƒÂ³mico del mundo.\n\nMGS4 es tambiÃƒÂ©n la culminaciÃƒÂ³n de la serie en muchas otras formas, no solamente a nivel narrativo. El gÃƒÂ©nero acuÃƒÂ±ado por ÃƒÂ©l mismo, el 'Tactical Espionage Action', llega a su madurez como lo hace el propio Snake; mejorando sus habilidades previas junto con innovaciones que llevan la experiencia jugable a nuevos lÃƒÂ­mites. El famoso 'No Place to Hide' que lleva la infiltraciÃƒÂ³n a una zona de guerra, el Octocamo, el traje de camuflaje dinÃƒÂ¡mico, el apoyo del androide Metal Gear Mk II, el sistema de mejora y adquisiciÃƒÂ³n del armamento, las nuevas cÃƒÂ¡maras, el estrÃƒÂ©s y la condiciÃƒÂ³n mental, la IA tÃƒÂ¡ctica mejorada de los enemigos, o los movimientos ampliados de Snake. Todos ellos, junto con la base que la serie ha ido barbechando, constituyen una nueva marca en el gÃƒÂ©nero. Y esto sin hablar del modo online, que por sÃƒÂ­ solo es un videojuego totalmente independiente, Metal Gear Online.","torrent":{"xt":"urn:btih:ad86556d655a3474bcb335d626485ff6813cadba","amp;dn":"Metal+Gear+Solid+4+Guns+of+the+Patriots+%5BPAL%5D%5BPS3%5D%5BMulti6%5D%5BSpani","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad86556d655a3474bcb335d626485ff6813cadba","infoHashBuffer":{"type":"Buffer","data":[173,134,85,109,101,90,52,116,188,179,53,214,38,72,95,246,129,60,173,186]},"announce":[],"urlList":[]}}