{"title":"Goldfrapp - Lovely Head (Live) (2nafish)","uid":5911246,"size":126298116,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ad9bda2deb7724cb3082bfde82e7a888b48407f7&amp;dn=Goldfrapp+-+Lovely+Head+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1288065515,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Lovely Head&quot; is an electronic song performed by British group Goldfrapp. The song was written and produced by Alison Goldfrapp and Will Gregory for the duo's debut album Felt Mountain (2000). It was released as the album's first single in May 2000. In November 2001, the song was re-issued as a double A-side single with &quot;Pilots (On a Star)&quot; and reached number sixty-eight on the UK singles chart.\n\nIn 2002, &quot;Lovely Head&quot; appeared in the Guy Ritchie film Swept Away. It appeared in Jan Kounen's 99 francs (2007), as well as in Pawel Pawlikowski's &quot;My Summer of Love&quot; (2004). During 2001 the song was used in a TV and cinema advertising campaign for UK mobile phone company One2One, which featured Gary Oldman.\n\nGoldfrapp began work on &quot;Lovely Head&quot; in September 1999 in a rented bungalow in the Wiltshire countryside. Alison Goldfrapp contributed the song's lyrics, and William Gregory and Goldfrapp composed the music together. The duo recorded the song outside their bungalow, drawing inspiration from nature. The song was originally titled &quot;Your Lovely Head&quot;. &quot;Lovely Head&quot; features high lonesome whistling and cold vocals set to harpsichord and strings. What is often mistaken for a theremin synth in the song is, in fact, Alison's vocals piped through a synthesizer which modulates and distorts them. It was inspired by Welsh singer Shirley Bassey and Italian film director Sergio Leone.\n\nIn August 2009, American music magazine Pitchfork listed Lovely Head in their Top 500 tracks of the 2000s at number 493.\n\nFelt Mountain is the debut album by English electronic duo Goldfrapp. It was released by Mute Records on 11 September 2000 in the United Kingdom. The album features Alison Goldfrapp's synthesized vocals in cinematic scope, and takes influence from a variety of music styles such as 1960s pop, cabaret, folk, and electronica.\n\nFelt Mountain was a top seventy-five album in Goldfrapp's native United Kingdom, and was certified gold in October 2001. It was generally well received by music critics, and it was described as &quot;simultaneously smarmy and seductive, yet elegant and graceful&quot;. In 2001, the album was shortlisted for the Mercury Prize, an annual music prize awarded for the best British or Irish album from the previous year.\n\nGoldfrapp is an English electronic music duo, formed in 1999 in London, England, that consists of Alison Goldfrapp (vocals/synthesizer) and Will Gregory (synthesizer).\n\nDespite favourable reviews and a shortlisting for the Mercury Prize, the ambient sound of their 2000 debut album Felt Mountain did not chart highly. Goldfrapp's second album Black Cherry, which incorporated glam rock and synthpop sounds into their music, was released in 2003. The album influenced the same dance-oriented sound of their third album Supernature. Supernature took Goldfrapp's work further into dance music, and enjoyed international chart success. Supernature produced three number-one U.S. dance singles, and was nominated for Best Electronic/Dance Album at the 49th Grammy Awards. Their fourth album Seventh Tree placed a greater emphasis on ambient and downtempo music, drawing inspiration from nature and Paganism, while their fifth album, Head First, found the group exploring 1980s-influenced synthpop.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ad9bda2deb7724cb3082bfde82e7a888b48407f7","amp;dn":"Goldfrapp+-+Lovely+Head+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad9bda2deb7724cb3082bfde82e7a888b48407f7","infoHashBuffer":{"type":"Buffer","data":[173,155,218,45,235,119,36,203,48,130,191,222,130,231,168,136,180,132,7,247]},"announce":[],"urlList":[]}}