{"title":"Volodos Plays Liszt  (VBR - V0)","uid":5711783,"size":125223315,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:af123434aedfac385a676a47f143e69f0f5dc82e&amp;dn=Volodos+Plays+Liszt++%28VBR+-+V0%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":13,"time":1279925521,"description":"Music : Classical : MP3/Variable\nMost of Arcadi Volodos' first all-Liszt outing for Sony concerns itself with the composer's introspective, poetic, and mystical persona. The main exception occurs at the recital's midpoint, where Volodos updates the 13th Hungarian Rhapsody, adding his own scintillating counterlines, runs, and reharmonizations in the spirit of Vladimir Horowitz (Horowitz, in fact, made his own transcription of the piece). Strange then, that the booklet does not also credit VallÃƒÂ©e d'Obermann as a &quot;Volodos version&quot;, since the pianist freely (and rather garishly, to my taste) amends the climax in the work's second half.\n\nIn the opening section of FunÃƒÂ©railles, Volodos achieves a strong funeral march ambience simply by clipping the chordal accompaniment to more percussive effect than most pianists. While the celebrated central left-hand octave sequence poses no problems in speed or endurance for Volodos' astounding technique, the surface thrills come at the expense of choppy chord playing in the right hand. Here Arnaldo Cohen's nobler phrasing and greater sense of line transforms the virtuosity back into music. Similarly, in the St. Francis LÃƒÂ©gend I find that the awesomely even, beautifully modulated trills upstage the melodies they purportedly decorate.\n\nTo some listeners, Volodos' warm, ample-toned approach to the late-period works might not sufficiently address their stark, lean, open ended qualities, yet I'm won over by the pianist's uncommonly extroverted and sparkling approach to Bagatelle sans tonalitÃƒÂ©. In contrast to the intimately shaded performance from Vladimir Horowitz's last recording, Volodos conceives the &quot;Weinen, Klagen, Sorgen, Zagen&quot; Prelude on a larger dynamic and dramatic scale that makes me curious how he'd play Liszt's imposing variation set based on the same Bach theme. In all, this is an unconventional, carefully thought out, and frequently persuasive Liszt program. The concert hall realism of Sony's sonics come closer than previous releases to capturing what Volodos sounds like from a choice seat in a choice venue.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:af123434aedfac385a676a47f143e69f0f5dc82e","amp;dn":"Volodos+Plays+Liszt++%28VBR+-+V0%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af123434aedfac385a676a47f143e69f0f5dc82e","infoHashBuffer":{"type":"Buffer","data":[175,18,52,52,174,223,172,56,90,103,106,71,241,67,230,159,15,93,200,46]},"announce":[],"urlList":[]}}