{"title":"The Beatstalkers - Scotland's No.1 Beat Group; Stalking The Bea","uid":5735161,"size":99127596,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:afac2a976eb2a02596708451494b49f8d2e04f5e&amp;dn=The+Beatstalkers+-+Scotland%5C%27s+No.1+Beat+Group%3B+Stalking+The+Bea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Iron_Horse","files":21,"time":1280782356,"description":"The Beatstalkers - Scotland's No.1 Beat Group; Stalking The Beat 1962-69\nCD (2005) To MP3 320 Kbit/s.\nIncluded: Front Cover &amp; This Info.\n\nThe result of an extensive effort from Scotland's own 60's archivist/rock n roll scribe Lenny Helsing (of Green Telescope/Thanes/Wildebeests fame) &quot;Scotland's No.1 Beat Group&quot; contains all the recorded output of Glaswegian 60's heroes The Beatstalkers (all three of their Decca 45's, four CBS 45's and two acetate demos).\n\nHailing from Glasgow, Scotland (home to The Poets and Dean Ford and The Gaylords to name but a few) The Beatstalkers are best known for their mod/60's dance floor fave, a version of Joe South's &quot;You'd Better Get A Hold On&quot; (indeed this writer recalls happily acquiring a knackered copy to spin in time for a Mad Mod Ball back in the early 90's). But their career is/was much more interesting and varied as illustrated in print and in music on this compilation. Though horribly disavowed by the band their debut 45 &quot;Ev'rybody's Talkin' Bout My Baby&quot; is an upbeat combo organ/fuzz guitar driven number with a catchy riff and an almost martial beat. A similar recipe is used for &quot;Left Right Left&quot; the A-side of the afore mentioned &quot;You'd Better Get A Better Hold On&quot; (which is included in it's gritty freakbeat meets blue eyed soul glory). The band released two pointless soul cover A-sides, &quot;A Love like Yours&quot; and &quot;Ain't No Soul Left In These Old Shoes&quot;. The real gem is the flipside to the latter, a way out organ/fuzz guitar instrumental written by their producer Tommy Scott . Long sought after by collector's and 60's freaks it was later given lyrics by Bill Martin and recorded by Them, The Troggs etc as &quot;I Can Only Give You Everything&quot;. With a switch to CBS the now London based band was managed by the semi-legendary promoter/Svengali Ken Pitt who's primary client/artist at the time was one David Bowie. Through this the band would reap a wealth of unreleased originals from the pen of the London Boy. None of which were ever afforded to the public by the then mod meets Anthony Newley era Thin White Duke. The first of these resulted in 1967's &quot;Silver Tree Top School For Boys&quot; (also cut with better freakbeat effect by The Slender Plenty three months early in September on Polydor), written by Bowie after reading a tabloid expose on pot smoking at British public schools. The number's air of privileged public school snobbery is interestingly derailed by lead singer Davie Lennox's thick Scottish accent which brings it down to earth from lofty posh airs. The song is a perfectly encapsulated quaint slice of '67 British pop ala the social commentaries of contemporaries Ray Davies and Cat Stevens . It's B-side, the only band original, the ridiculously titled &quot;Sugar Chocolate Machine&quot; is a catchy piece of CBS &quot;pop with feeling&quot; akin to label mates The Tremeloes, Marmalade or Love Affair . The next single, 1968's disposable brassy pop of &quot;Rain Colored Roses&quot; is backed by Bowie's &quot;Everything Is You&quot;, a somewhat quirky and jaunty samba beat style number. The next single is probably one of the band's best and certainly unique. If someone told me 20 years ago that there was a 60's 45 by a Scottish band with a song by The Action on one side and David Bowie on the other I'd have told them they were full of you know what. But sure enough the band's final 45 (released on January 11, 1969) features the Reggie King penned &quot;Little Boy&quot; (from The Action's legendary Brain/Rolled Gold session) on side &quot;A&quot; with very cool results thanks to a slower pace and some heavy (but not too) guitar/bass action. The flipside is a brassy/poppy quaint Bowie composition called &quot;When I'm Five&quot; full of pomp and circumstance as English as village green's and Sunday joint's despite the Glasgow accented vocals, which somehow add to the whimsy and feel of the song.\n\nA must for 60's Bowie fans (like me) or anyone who can appreciate late 60's pop/psych sounds. As with his strangely similar titled CD anthology of The Poets from a few years back Lenny has painstakingly delivered up an impressive array of photos, press clipping and band member interviews to compliment the exciting music contained herein.  &lt;a href=&quot; http://www.uppers.org/showArticle.asp?article=710&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.uppers.org/showArticle.asp?article=710&lt;/a&gt;\n\n\nThis is the first ever anthology of The Beatstalkers: A '60 Scottish pop phenomenon. They were famed for their riotous shows, which attracted hordes of screaming girls wherever they played their authentic brand of r'n'b. This soulful outfit reached Beatle-like status in their homeland. Revered by fans and collectors over the passing decades, only snatches of the groups material has in recent years trickled out on compilations aimed at the beat-mod connoisseur. for this compilation we are proud to present all the groups releases, plus two of their earliest unreleased demo recordings. The Beatstalkers story is told in a staggering 24 page booklet full of their sensational newspaper headlines and a wealth of great photographs. If it's groovy sounds your after from the original era that gave us beat, mod, soul and psychedelic styles, then this CD is a must.  &lt;a href=&quot; http://www.amazon.co.uk/Scotlands-No-1-Beat-Group-Beatstalkers/dp/B0009J4SP0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.co.uk/Scotlands-No-1-Beat-Group-Beatstalkers/dp/B0009J4SP0&lt;/a&gt;\n\nMore info and pictures on: http://www.rockingscots.co.uk/bstalk.htm\n\nTracklist:\n01. Everybody's Talking 'Bout My Baby - 1965\n02. Mr. Disappointed - 1965\n03. Left Right Left - 1966\n04. You'd Better Get A Better Hold On - 1966\n05. A Love Like Yours - 1966\n06. Base Line - 1966\n07. My One Chance To Make It - 1967\n08. Ain't No Soul (Left In These Old Shoes) - 1967*\n09. Silver Tree Top School For Boys - 1967\n10. Sugar Chocolate Machine - 1967\n11. Rain Coloured Roses - 1968\n12. Everything Is You - 1968*\n13. Little Boy - 1969\n14. When I'm Five - 1969*\n15. Ramble On (Previously Unreleased Demo) - 1963\n16. St.Louis Blues (Previously Unreleased Demo) - 1963\n* Written by David Bowie and he sang backing vocals on all three and played acoustic guitar on a couple of them.\n\nLineup:\nDavie Lennox - Vocals\nRonnie Smith - Guitar, Vocals\nAlan Mair - Bass\nEddie Campbell - Organ\nJeff Allen - Drums\nHugh &quot;Tudge&quot; Williamson - Drums (replaced by Jeff Allen in late '60s).\n\nSee my other Torrents: http://thepiratebay.se/user/Iron_Horse/","torrent":{"xt":"urn:btih:afac2a976eb2a02596708451494b49f8d2e04f5e","amp;dn":"The+Beatstalkers+-+Scotland%5C%27s+No.1+Beat+Group%3B+Stalking+The+Bea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afac2a976eb2a02596708451494b49f8d2e04f5e","infoHashBuffer":{"type":"Buffer","data":[175,172,42,151,110,178,160,37,150,112,132,81,73,75,73,248,210,224,79,94]},"announce":[],"urlList":[]}}