{"title":"Coast To Coast Am - 09-13-10 - Colonizing Space","uid":5831734,"size":56064153,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b0354bd007fe86482511e94dce0d1bb25f50f03b&amp;dn=Coast+To+Coast+Am+-+09-13-10+-+Colonizing+Space&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1284543378,"description":"Date: 09-13-10 \n\nHost: George Noory \n\nGuests: James McCanney, Howard Bloom, Maryn McKenna  \n\nProfessor James McCanney argued for the urgent need for humans to colonize outer space, as he believes the survival of the species depends on it. We could be wiped out by a comet at any time, such as what happened in Earth's distant past, he noted. It could take a thousand years to really master living in outer space on a broad scale, with millions of people successfully inhabiting colonies, he said, and NASA's program where we send astronauts to the moon in 20 years is not going to cut it.\n\n\nBy understanding the &quot;electrical nature of the universe,&quot; and pursuing and using it to our advantage, we can move forward with new approaches to space travel, as well as incorporating &quot;Tier 2 science,&quot; which is kept hidden from the public, said McCanney. In developing autonomous space colonies, raw materials such as from comets could be harvested, and hydrocarbon tubes could be constructed in space to serve as housing, he outlined. \n\nAuthor Howard Bloom joined in the conversation for the latter half of the show. A founding member of the Space Development Steering Committee, which has researched space solar power, he too believes it is urgent for the human race to start space colonization, as we face the increasing threat of nuclear weapons falling into the wrong hands. Materials from our moon could be utilized to create giant glass and steel structures called O'Neill Colonies that could house between 30,000 and 3 million people, said Bloom, and our own bacteria can be used to make soil. \n\nSuperbug Threat\nFirst hour guest, journalist Maryn McKenna reported on the global threat posed by an antibiotic-resistant bacteria that has now shown up in several US states, and in a number of countries. The superbug known as NDM-1 is believed to have originated in India, and is difficult to detect because doctors typically only realize a patient has it when their infections don't respond to standard antibiotics, she detailed. \n\nWebsite(s): \n-jmccanneyscience.com\n-HowardBloom.net\n-bigbangtango.net\n-marynmckenna.com\n-superbugtheblog.com\nBook(s): \n-The Diamond Principle\n-Planet-X, Comets and Earth Changes\n-The Genius of the Beast: A Radical Re-Vision of Capitalism\n-Global Brain: The Evolution of Mass Mind from the Big Bang to the 21st Century\n-Superbug: The Fatal Menace of MRSA\n","torrent":{"xt":"urn:btih:b0354bd007fe86482511e94dce0d1bb25f50f03b","amp;dn":"Coast+To+Coast+Am+-+09-13-10+-+Colonizing+Space","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0354bd007fe86482511e94dce0d1bb25f50f03b","infoHashBuffer":{"type":"Buffer","data":[176,53,75,208,7,254,134,72,37,17,233,77,206,13,27,178,95,80,240,59]},"announce":[],"urlList":[]}}