{"title":"Darksiders-SKIDROW","uid":5845492,"size":14638697780,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0556c86793a6c714b6ccdb00d5d5ba0f769f28d&amp;dn=Darksiders-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MAFIAA.","files":-1,"time":1285154608,"description":"RELEASE DATE : 22-09-2010              PROTECTION : Steam\nGAME TYPE    : RPG                    DISKS      : 2 DVD\n\nDeceived by the forces of evil into prematurely bringing about\nthe end of the world, War - the first Horseman of the\nApocalypse - stands accused of breaking the sacred law by\ninciting a war between Heaven and Hell. In the slaughter that\nensued, the demonic forces defeated the heavenly hosts and\nlaid claim to the Earth.\n\nBrought before the sacred Charred Council, War is indicted for\nhis crimes and stripped of his powers. Dishonored and facing\nhis own death, War is given the opportunity to return to Earth\nto search for the truth and punish those responsible.\n\nHunted by a vengeful group of Angels, War must take on the\nforces of Hell, forge uneasy alliances with the very demons he\nhunts, and journey across the ravaged remains of the Earth on\nhis quest for vengeance and vindication.\n\nApocalyptic Power - Unleash the wrath of War, combining brutal\nattacks and supernatural abilities to decimate all who stand\nin your way\n\nExtreme Arsenal - Wield a devastating arsenal of angelic,\ndemonic and Earthly weapons and blaze a trail of destruction\natop Ruin, War's fiery phantom steed\n\nEpic Quest - Battle across the wastelands and demon-infested\ndungeons of the decimated Earth in your quest for vengeance\nand redemption\n\nCharacter Progression - Uncover powerful ancient relics,\nupgrade your weapons, unlock new abilities, and customize your\ngameplay style\n\nBattle Heaven and Hell - Battle against all who stand in your\nway - from war-weary angelic forces to Hell's hideous demon\nhordes\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the cracked content from the SKIDROW folder on DVD2 to\nmain installation folder and overwrite\n\nAdditional Notes:\n\nOur brand new steam installer is included with this release.\nKeep in mind when using it, that if you mount DVD1 as P: drive\nthen DVD2 has to be mounted as P: too during install.\n\nSupport the companies, which software you actually enjoy\n","torrent":{"xt":"urn:btih:b0556c86793a6c714b6ccdb00d5d5ba0f769f28d","amp;dn":"Darksiders-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0556c86793a6c714b6ccdb00d5d5ba0f769f28d","infoHashBuffer":{"type":"Buffer","data":[176,85,108,134,121,58,108,113,75,108,205,176,13,93,91,160,247,105,242,141]},"announce":[],"urlList":[]}}