{"title":"Stephen King: The Mist (2007) PAL DVD9","uid":5894504,"size":16541614477,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b0baaa5f46ddc3363c36d5b2c1fdaf020270aa31&amp;dn=Stephen+King%3A+The+Mist+%282007%29+PAL+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ubehage","files":-1,"time":1287396906,"description":"Stephen King: The Mist (2007)\n-----------------------------\n&quot;Fear changes everything.&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0884328/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0884328/&lt;/a&gt;\n\nAudio: English\n\nSubs: Danish\n\nExtra Materials:\n- Disc 1:\n  - Feature Commentary by Writer/Director Frank Darabont.\n  - A Conversation with Stephen King &amp; Frank Darabont.\n  - Deleted Scenes with Optional Commentary.\n  - Drew Struzan: An Appreciation of an Artist.\n  - Behind-the-Scenes Webisodes.\n  - Trailer Gallery.\n- Disc 2:\n  - Frank Darabont Introduces The Mist in Black &amp; White.\n  - The Director's Vision: The Complete Feature Film in Black &amp; White.\n  - When Darkness Came: The Making of The Mist.\n  - Taming the Beast: The Making of Scene 35.\n  - Monsters Among Us: A Look at the Creature 35 FX.\n  - The Horror of It All: The Visual FX of The Mist.\n\n\nPlot outline:\nAfter a strong storm in the Maine area, the local artist Dave Drayton drives from his house nearby the lake to the supermarket with his son Billy and his arrogant neighbor, the lawyer Brent Norton, to get supplies. Along their way, they see a heavy mist and later, military convoys, police and firefighter trucks, ambulances heading toward it. While in the supermarket, a frantic bleeding local arrives crying that there is something alive in the mist and the manager closes the entrance door while the place is encased by the mist. When David, another client and two employees go to the back of the store to start the generator, they open the back-door and the cashier Norm (Chris Owen) is hold and dragged by fierce tentacles. David and the two survivors succeed to close the loading door, and when they tell the people what happened, Brent does not trust on his words and believes it is a prank and the God-fearing woman Mrs. Carmody preaches the Apocalypse and that she is the vessel of Lord on Earth. Sooner the group discovers that they are under siege of blood thirsty creatures from another dimension that have reached our planet through a window open by a failed military research. Further, the crazy Mrs. Carmody has many followers and is becoming dangerous and dangerous in her speeches. Without alternative, a small group leaded by David decides to take the chance to escape from the supermarket and reach his car, hoping to get out of the mist.","torrent":{"xt":"urn:btih:b0baaa5f46ddc3363c36d5b2c1fdaf020270aa31","amp;dn":"Stephen+King%3A+The+Mist+%282007%29+PAL+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0baaa5f46ddc3363c36d5b2c1fdaf020270aa31","infoHashBuffer":{"type":"Buffer","data":[176,186,170,95,70,221,195,54,60,54,213,178,193,253,175,2,2,112,170,49]},"announce":[],"urlList":[]}}