{"title":"The Aces Kings of Chicago Blues, Vol.1 (blues)(mp3@320)[rogercc]","uid":5842111,"size":92927706,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b2d94b3a0696baec839b4ba1526be43b0590794a&amp;dn=The+Aces+Kings+of+Chicago+Blues%2C+Vol.1+%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rogercc1","files":12,"time":1285008755,"description":"THE ACES KINGS OF CHICAGO BLUES VOL 1\nLabel: Vogue\nRecorded in Chicago, 1971.\nFormat:Mp3@320\n\n\n\nThe Aces was one of the earliest and most influential of the electric Chicago blues bands in the 1950s. Led by brothers Louis and Dave Myers, the pioneering Chicago blues combo The Aces earned their greatest success in support of Little Walter. Natives of Byhalia, Mississippi, guitarist Louis (1929-1994) and bassist Dave (1926-2001) originally performed under the name 'The Little Boys' with the subsequent addition of harpist Junior Wells, they rechristened themselves the 'Three Deuces,' followed by 'The Three Aces'. The 1950 enlistment of drummer Fred Below (1926-1988) prompted another name change, this time to 'The Four Aces', finally, to simplify matters once and for all, the group performed as just 'The Aces'. In 1952, Wells quit to join the Muddy Waters band, filling the vacancy created by the recent departure of harpist Little Walter Jacobs. Ironically, Walter himself quickly signed the remaining Aces as his new backing unit, renaming the trio 'The Jukes'. A series of seminal recordings followed 'Mean Old World,' 'Sad Hours,' 'Off the Wall' and 'Tell Me Mama' among them, before Louis' 1954 exit resulted in the Jukes' gradual dissolution.\n\nThe Aces were considered to be the top blues backing unit in Chicago. What made the Aces so special is that they seemed to fit into any Chicago Blues lineup, and raised the musicianship to that genre's apex. In particular, Below's refined rhythms led to the rise of the blues shuffle beat, and helped launch the drums to a new prominence within the blues band hierarchy. Dave Myers was one of the first Chicago bassist to adopt this relatively new instrument, and helping to popularize it in Chicago blues. Fred Below and the Aces pretty much created the standard for the blues shuffle beat.\n\nDuring the 1960s, 1970s and 1980s the original band reunited for recordings, tours, and festival gigs. They visited Europe several times, rather as a trusty rhythm section for touring acts thaan a standalone band. The Aces performed and recorded hundreds of albums with literally every Chicago blues legend. They appeared on hundreds of records by artists such as Muddy Waters, Willie Dixon, Jimmy Rogers, Roosevelt Sykes, Sunnyland Slim, Eddie Taylor, J.B. Hutto, Earl Hooker, Otis Spann, Otis Rush, Robert Lockwood Jr., and many others, both as a backing band and a crack backing unit.\n\n\n\n01. The Aces Shuffle 3:20\n02. That's Allright 4:52\n03. Baby Please Don't Go 1:50\n04. Money Marbles And Chalk 3:28\n05. You are So Fine 2:58\n06. You Upset Me Baby 2:38\n07. Dust My Broom 2:22\n08. I'll Take Three 3:06\n09. Blues With A Feeling 4:30\n10. It's All Your Fault 4:05\n11. L M Blues 4:35\n\n\nLouis Myers - Vocals, Harmonica &amp; Guitar (4,6)\nDave Myers - Bass Guitar\nFred Below - Drums\nand\nSammy Lawhorn - Guitar","torrent":{"xt":"urn:btih:b2d94b3a0696baec839b4ba1526be43b0590794a","amp;dn":"The+Aces+Kings+of+Chicago+Blues%2C+Vol.1+%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d94b3a0696baec839b4ba1526be43b0590794a","infoHashBuffer":{"type":"Buffer","data":[178,217,75,58,6,150,186,236,131,155,75,161,82,107,228,59,5,144,121,74]},"announce":[],"urlList":[]}}