{"title":"The Book Of Eli [Torrent4nu] HD","uid":5874247,"size":6894009484,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b333db5007a2b6e521e1536df6633a3d14298519&amp;dn=The+Book+Of+Eli+%5BTorrent4nu%5D+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Torrent4nu","files":3,"time":1286549465,"description":"\n\n _____                          _       \n/__   \\___  _ __ _ __ ___ _ __ | |_     _ __  _   _\n  / /\\/ _ \\| '__| '__/ _ \\ '_ \\| __|   | '_ \\| | | |  \n / / | |_| | |  | | |  __/ | | | |_  4 | | | | |_| |\n \\/   \\___/|_|  |_|  \\___|_| |_|\\__/   |_| |_|\\___/\n                                                                                     \n                           \n\n   \n                           \nThe Book of Eli (2010)   \n\n\n +------------+\n | Dutch Info |\n +------------+\n\ngeregisseerd door Albert Hughes en Allen Hughes\nmet Denzel Washington, Gary Oldman en Mila Kunis\n\nIn de nabije toekomst is Amerika een kaal en gevaarlijk niemandsland geworden. \nGewapend met zijn jachtgeweer, zwaard en instinct heeft Eli deze wereld jarenlang afgezworven, zichzelf \nverdedigend tegen uiterst gewelddadige bendes op zoek naar overlevingsmiddelen. In CaliforniÃƒÂ« geeft de zelfverklaarde dictator Carnegie zijn bende opdracht \nEli te overmeesteren. Tijdens dit kat en muis spel ontmoet Eli Carnegie\\'s stiefdochter Solara, die hem vertelt over haar stiefvaders wrede en vernietigende plannen \nom het gebied te veroveren. Samen vervolgen ze Eli\\'s weg naar San Francisco, waar het einddoel ligt van zijn lange reis: het afleveren \nvan belangrijke informatie die de redding van de gehele mensheid kan betekenen\n\n +--------------+\n | English Info |\n +--------------+\n\n\ndirected by Albert Hughes and Allen Hughes\nwith Denzel Washington, Gary Oldman and Mila Kunis\n\n \nIn a violent post-apocalyptic society, the drifter Eli has been wandering to west across \nNorth America for the last thirty years reading a unique book that he brings with him. He survives hunting small animals and seeking goods \nin destroyed houses and vehicles to trade in villages for water and supplies. When he reaches the village ruled by the powerful mobster Carnegie, the man \noffers a job to Eli to join his gang. Carnegie presses his blind lover Claudia to send her daughter Solara to convince Eli spending the night with him. \nThe girl sees the book of Eli, and when Carnegie beats up on Claudia, she reveals that Eli has the sought book. Carnegie sends his gang to take the book from Eli, but \nthe man is up for protecting the book with his life.\n\n\n\n +----------+\n | DVD Info |\n +----------+\n\nMenu...................: Yes\nSubtitles..............: Dutch,frence\nLanguage...............: Engels\nPlaytime...............: 118 Min\\\\1:52:51\nGenre..................: Actie,drama\nBron...................: Retail\nFormat.................: DVD9/HD\nCover..................: Yes\nLabel..................: Yes\nExtra\\'s................: Yes\n\n\nhet is een HD film ook al zou je dat niet denken van 4,30 GB \nIt\\'s an HD movie even if you do not think of 4.30 GB\n\n\nAls je een muziek video wilt. Kun je dat altijd vragen. En ik zal voor\nje kijken. Ik kan niet elke muziek video vinden. Maar ik doe mijn best.\n\n\nIf you want a music video you can always ask that. And i will look for\nyou. I can\\'t find every music video but i do my best.\n\n\nEnjoy This one and seed, \n\n","torrent":{"xt":"urn:btih:b333db5007a2b6e521e1536df6633a3d14298519","amp;dn":"The+Book+Of+Eli+%5BTorrent4nu%5D+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b333db5007a2b6e521e1536df6633a3d14298519","infoHashBuffer":{"type":"Buffer","data":[179,51,219,80,7,162,182,229,33,225,83,109,246,99,58,61,20,41,133,25]},"announce":[],"urlList":[]}}