{"title":"Cyber Update Jul.2010-----HT-9691 Brooke","uid":5731662,"size":351952134,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b39a94218231955b0f04d79dfb96ef2ec519930e&amp;dn=Cyber+Update+Jul.2010-----HT-9691+Brooke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":115,"time":1280674206,"description":"From Kink.com  (Hogtied)  + Pics\n\n\n\n\nWelcome back Brooke Adams to Hogtied. Brooke has a curse or a blessing, depending how you look at it. She is multi-orgasmic, she can cum over and over. This becomes a curse for her in our hands. Her body can't stop it, it has no protection. Bound helpless, with a vibrator stuck to her clit, fingered and made to squirt, Brooke cannot stop the orgasms we rip from her struggling body, but it doesn't stop there. \n\nWe continue to rip orgasm after orgasm out of her body until there is nothing left, no thought process, no cognitive thinking, no sense of self, only Survival. The lungs fill with air, the heart continues to pump blood. The pleasure/pain of the pleasure is an overload of the senses, oh and there is screaming, lots of primitive, primordial screaming.\n\nBrooke is reduced, broken, her brain is offline, she is gone. Somewhere deep inside the horror, in that one moment of total hopelessness, fear manifests itself into tears, a cry for help, the mind reaching for mercy when the brain can't form recognizable speech in it's defense. \n\nWARNING THIS IS A LONG, EXTREME VIDEO, THE MODEL WAS NOT INJURED OR HURT DURING THE FILMING.\n\nWe also included behind the scene footage of the aftercare of this scene. If you really want to see what happens when a girl is made to cum until she is on the verge of unconsciousness, then you need to see this.\n\n\n\n\nScreens &lt;a href=&quot; http://www.hogtied.com/site/shoot.jsp?shootId=9691&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hogtied.com/site/shoot.jsp?shootId=9691&lt;/a&gt;\n\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:b39a94218231955b0f04d79dfb96ef2ec519930e","amp;dn":"Cyber+Update+Jul.2010-----HT-9691+Brooke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39a94218231955b0f04d79dfb96ef2ec519930e","infoHashBuffer":{"type":"Buffer","data":[179,154,148,33,130,49,149,91,15,4,215,157,251,150,239,46,197,25,147,14]},"announce":[],"urlList":[]}}