{"title":"Mafia.II.DVD5RIP-Unleashed (Mafia 2)","uid":5791420,"size":4578098388,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b3f89747a3f12c9f6c91e3ab267a950640f3d3cd&amp;dn=Mafia.II.DVD5RIP-Unleashed+%28Mafia+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thenoobish","files":96,"time":1282858119,"description":"P R E P A R E  T O  B E  U N L E A S H E D ! !\n\nMafia II DVDRIP (C) 2K Games\n\nRelease Date  :  08-26-2010             Protection   :  Steam + CEG\nRelease Type  :  DVDRIP                 Game Genre   :  Action\n\nRelease Notes:\n\nVito Scaletta has started to make a name for himself on the streets of\nEmpire Bay as someone who can be trusted to get a job done. Together with\nhis buddy Joe, he is working to prove himself to the Mafia, quickly\nescalating up the family ladder with crimes of larger reward, status and\nconsequence the life as a wise guy isnt quite as untouchable as it seems.\n\nAction-Packed Gameplay: Intense gunplay, white-knuckle car chases and\nvisceral hand-to-hand combat it will take all that and more to become a\nmade man.\n\nEpic Gangster Story: Inspired by iconic mafia drama, the compelling\ncharacters and cinematic presentation will pull players into the allure\nand impossible escape of life in the Mafia.\n\nImmersive World and Period: Enter the world of Empire Bay - World War II\nis raging in Europe and the architecture, cars, music and clothing all\necho the period in stunning detail. As time passes, hot rod cars, 50s\nfashion and some of the eras best music reflect the birth of a cool new\nera.\n\nIllusion Engine: 2K Czechs proprietary Illusion Engine, allows gamers to\nexplore Empire Bays 10 square miles of beautifully rendered outdoor\nenvironments and intricately designed interiors.\n\nSoundtrack Reflects the Mood of the Era: Players will be immersed in the\nGolden Era of America as Mafia II features tracks from some of the eras\nmost influential artists.\n\nMulti language: English, German, French, Italian and Spanish\n\nRipped  Nothing\n\nInstall Notes:\n\n1. Unpack the release with WinRAR or equivalent\n2. Burn the Iso with Nero Burning ROM or equivalent,\nalternative option is mounting the image with Daemon-Tools.\n3. Install\n4. After install is done: copy ALL the content from Unleashed folder to\nyour installation folder and run runme.exe\n5. Play\n\nUnleashed salutes all friends of the family, contacts and competition!\n\nTo be or not to be Unleashed","torrent":{"xt":"urn:btih:b3f89747a3f12c9f6c91e3ab267a950640f3d3cd","amp;dn":"Mafia.II.DVD5RIP-Unleashed+%28Mafia+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f89747a3f12c9f6c91e3ab267a950640f3d3cd","infoHashBuffer":{"type":"Buffer","data":[179,248,151,71,163,241,44,159,108,145,227,171,38,122,149,6,64,243,211,205]},"announce":[],"urlList":[]}}