{"title":"The Rockin' Berries - They're In Town; The Pye Anthology (1964","uid":5709505,"size":213266595,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b416c1775bab95c4ee6c3914ae33e7c85d94f0e2&amp;dn=The+Rockin%5C%27+Berries+-+They%5C%27re+In+Town%3B+The+Pye+Anthology+%281964&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iron_Horse","files":65,"time":1279833925,"description":"The Rockin' Berries - They're In Town; The Pye Anthology (1964-68 UK Beat)\nCD (2000) To MP3 192 Kbit/s.\nIncluded CD Covers &amp; This Info.\n\nBiography\tby Richie Unterberger\nDespite a couple of British Top Ten hits in 1964-1965, the Rockin' Berries made no dent in the U.S. market at the height of the British Invasion. Much of the Berries' output reflected the lighter pop/rock face of the British beat boom, emphasizing catchy, carefully constructed tunes supplied by British and American songwriters, with high harmonies indebted to the Four Seasons and the Beach Boys. The Berries wrote little of their own material, and this, combined with the wimpiness of some of their recordings, doomed them to little recognition, and little critical respect, even among British Invasion aficionados. For what they were, however, their best pop/rock outings were pretty respectable. A career strategy that put an eye on the &quot;all-around entertainer&quot; niche, however, led them to record many comedy numbers that have dated excruciatingly badly, and also ensured that they were denied artistic credibility and would fall out of the British charts after the mid-'60s.\n\nThe Rockin' Berries were formed in the early '60s when guitarist Brian &quot;Chuck&quot; Botfield was performing with the Bobcats, a Birmingham band, at the Star Club in Hamburg. Several Bobcats (including singer Jimmy Powell, who went on to record with the Five Dimensions in the '60s) broke off to form their own band, and Botfield brought in some Birmingham friends to regroup as the Rockin' Berries. Vocal arrangements were the Berries' forte, with Clive Lea taking the harder-rocking stuff and falsetto-voiced Geoff Turton pacing their most famous, Four Seasons-influenced material.\n\nAfter a couple of flop singles for Decca in 1963, the Rockin' Berries signed with the Pye subsidiary Piccadilly. After a mild hit with a cover of the Shirelles' &quot;I Didn't Mean to Hurt You,&quot; their cover of the Tokens' &quot;He's in Town,&quot; penned by star songwriting team Gerry Goffin and Carole King, took them to number three in the British charts in late 1964. &quot;He's in Town&quot; was a gentle harmony number, like a less shrill Four Seasons, and the group turned to another cover of an American record, the Reflections' &quot;Poor Man's Son,&quot; for their follow-up. More somber than &quot;He's in Town,&quot; this made number five in the U.K.. At around the same time, the Berries' debut LP, In Town, with a manic variety of material encompassing operatic ballads, R&amp;B, harmony pop/rock, comedy, and the German &quot;Ich Liebe Dich,&quot; was a fair success in Britain, making number 15.\n\nThe Rockin' Berries' versatility, though a boon to their live work in enabling them to play more mainstream theaters and cabarets than some British Invasion acts, worked against them on record. They would frequently insert comic routines into their live shows, and their second album, Life Is Just a Bowl of Berries, was half-occupied by terrible novelty/comedy numbers. They continued to record pop/rock by professional tunesmiths on their singles, including Goffin-King's &quot;You're My Girl,&quot; material by British hitmakers John Carter, Ken Lewis, and Perry Ford (who were also writing and recording hits as the Ivy League at the time), and even a little-known tune co-written by a pre-Blues Project Al Kooper, &quot;The Water Is Over My Head.&quot; Goffin-King's &quot;You're My Girl&quot; (which, like their &quot;He's in Town,&quot; was first given to the Tokens) and &quot;The Water Is Over My Head&quot; were minor British hits in 1965, but after that there was no chart success for the band. They continued to get work on the cabaret circuit and record singles for Piccadilly and Pye through 1968, when Turton left for a solo career, getting a Top 30 hit in the U.S. in early 1970 under the name of &quot;Jefferson&quot; (with &quot;Baby Take Me in Your Arms&quot;). Turton eventually rejoined the still-active Rockin' Berries, who continued to play cabaret for the rest of the century and make some more recordings. \n\nReview\tby Richie Unterberger\nJammed-to-the-brim two-CD, 58-track set has almost everything they did in the 1960s, including their In Town and Life Is Just a Bowl of Berries albums, their Piccadilly and Pye singles, their 1965 New From the Berries EP, and eight previously unreleased cuts. Disc one, built around the In Town LP, New From the Berries EP, and several 1964-65 singles, fares considerably better than disc two, which has the frequently dismal Life Is Just a Bowl LP, and some less impressive 1966-68 singles. In addition to the fairly decent In Town LP and the &quot;He's in Town&quot; and &quot;Poor Man's Son&quot; hits, though, there are some enjoyable cuts, like the R&amp;B jive &quot;Flashback,&quot; the moody and poignant &quot;If You Find Somebody to Love&quot; (co-written by Perry Ford), and the uncharacteristic &quot;Yellow Rainbow&quot; (which is not the same as the song of the same name from the Move's first album), which is, hard as it is to believe, pretty fair pop-psychedelia. All that keeps this from being the last word on the Berries' sixties recordings is the absence of their two 1963 Decca singles. \n\nDisc: 1 \n01. I Didn't Mean To Hurt You - 1964\n02. You'd Better Come Home - 1964\n03. He's In Town - 1964 \n04. Flashback - 1964 \n05. What In The World's Come Over You - 1964 \n06. You Don't Know What You Do - 1964 \n07. Let's Try Again  - 1965 \n08. Ich Liebe Dich  - 1965 \n09. Brother Bill (The Last Clean Shirt) - 1965 \n10. Without Your Love - 1965 \n11. All Of Me - 1965 \n12. Crazy Country Hop - 1965 \n13. All I Want Is My Baby - 1965 \n14. Lonely Avenue - 1965 \n15. Shades Of Blue - 1965 \n16. Follow Me - 1965 \n17. Ain't That Lovin' You Baby - 1965 \n18. Funny How Love Can Be - 1965\n19. Poor Man's Son - 1966\n20. You're My Girl - 1965\n21. If You Find Somebody To Love - 1965\n22. From One Who Knows - 1965\n23. What Can I Do? - 1965\n24. Across The Street - 1965\n25. The Water Is Over My Head - 1966\n26. Doesn't Time Fly - 1966\n27. Take A Giant Step (Previously Unreleased)\n28. Barterers And Their Wives (Previously Unreleased)\n29. Without The One [Backing Track] (Previously Unreleased)\n30. That Lucky Old Sun (Previously Unreleased)\n\nDisc: 2 \n01. Everything I Do Is For You - 1966\n02. Harvest Of Love - 1966\n03. The Way You Look Tonight - 1966\n04. I Know An Old Lady - 1966\n05. Happy To Blue - 1966\n06. Iko Iko - 1966\n07. When I'm Cleaning Windows - 1966\n08. I Need You - 1966\n09. Laughing Policeman - 1966\n10. My Little Red Book - 1966\n11. I Could Make You Fall In Love - 1966\n12. Land Of Love - 1966\n13. Midnight Mary - 1966\n14. Money Grows On Trees - 1966\n15. Sometimes - 1967\n16. Needs To Be - 1967\n17. Smile - 1967\n18. Breakfast At Sam's - 1967\n19. Dawn (Go Away) - 1967\n20. She's Not Like Any Girl - 1967\n21. When I Reach The Top - 1968\n22. Pain - 1968\n23. Mr. Blue - 1968\n24. Yellow Rainbow (Previously Unreleased)\n25. Miss Fortune [Backing Track] (Previously Unreleased)\n26. Oh Gosh (Previously Unreleased)\n27. Joe Barla (Previously Unreleased)\n28. Goodnight (Previously Unreleased)\n\nLineup:\nClive Lea - Lead Vocal (Left 1967)\nGeoff Turton - Lead Vocal, Guitar\nBrian &quot;Chuck&quot; Botfield - Lead Guitar\nRoy Austin - Bass Guitar (Left 1965)\nTerry Bond - Drums\nBobby Thompson - Bass Guitar (Joined 1965)\nRod Clarke - Bass Guitar (Joined 1967)\n\nSee my other Torrents: &lt;a href=&quot; http://thepiratebay.se/user/Iron_Horse/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/Iron_Horse/&lt;/a&gt;","torrent":{"xt":"urn:btih:b416c1775bab95c4ee6c3914ae33e7c85d94f0e2","amp;dn":"The+Rockin%5C%27+Berries+-+They%5C%27re+In+Town%3B+The+Pye+Anthology+%281964","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b416c1775bab95c4ee6c3914ae33e7c85d94f0e2","infoHashBuffer":{"type":"Buffer","data":[180,22,193,119,91,171,149,196,238,108,57,20,174,51,231,200,93,148,240,226]},"announce":[],"urlList":[]}}