{"title":"Radicalism and Political Reform in the Islamic and Western World","uid":5850620,"size":1897375,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b47fda231948d453b3caee6c4597ca8f0976eca9&amp;dn=Radicalism+and+Political+Reform+in+the+Islamic+and+Western+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1285370712,"description":"Radicalism and Political Reform in the Islamic and Western Worlds\n\nPublisher: Cambridge University Press \nNumber Of Pages: 264 \nPublication Date: 2010-05-24 \n\nOver the last decade, political Islam has been denounced in the Western media and in the surrounding literature as a terrorist or fascist movement that is entirely at odds with Western democratic ideology. Kai Hafez's book overturns these arguments, contending that, despite its excesses, as a radical form of political opposition the movement plays a central role in the processes of democratization and modernization, and that these processes have direct parallels in the history and politics of the West. By analyzing the evolution of Christian democratization through the upheavals of the Reformation, colonisation, fascism, and totalitarianism, the book shows how radicalism and violence were constant accompaniments to political change, and that these components - despite assertions to the contrary - are still part of Western political culture to this day. In this way, the book draws hopeful conclusions about the potential for political, religious, and cultural transformation in the Islamic world, which is already exemplified by the cases of Turkey, Indonesia, and many parts of South Asia. The book marks an important development in the study of radical movements and their contribution to political change.\n\n","torrent":{"xt":"urn:btih:b47fda231948d453b3caee6c4597ca8f0976eca9","amp;dn":"Radicalism+and+Political+Reform+in+the+Islamic+and+Western+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b47fda231948d453b3caee6c4597ca8f0976eca9","infoHashBuffer":{"type":"Buffer","data":[180,127,218,35,25,72,212,83,179,202,238,108,69,151,202,143,9,118,236,169]},"announce":[],"urlList":[]}}