{"title":"Black Death (2010) DVD NLT-Release","uid":5738698,"size":4216802577,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b48df155e5a344f6c2ab64a65e73783502600117&amp;dn=Black+Death+%282010%29+DVD+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1280920713,"description":"Black Death (2010) DVD NLT-Release\n\n\n[url=http://www.moviemeter.nl/film/58223]Moviemeter[/url]\nVerenigd Koninkrijk / Duitsland\nDrama / Horror\n102 minuten\n\ngeregisseerd door Christopher Smith\nmet Eddie Redmayne, Sean Bean en Carice van Houten\n\nHet Middeleeuwse Engeland wordt geteisterd door de pest. Lijken liggen bij honderden verspreid en het land is ondergedompeld in chaos. De Kerk verliest zijn greep op de bevolking, bij wie de angst overheerst. Alle hoop is gevestigd op een dorp dat vooralsnog gespaard lijkt te blijven voor de ziekte. Het ligt veraf gelegen, omringd door moeras. Er wordt gefluisterd dat het dorp geleid wordt door een tovenares. Deze Langiva (Carice van Houten) zou doden weer tot leven kunnen wekken. De gevreesde ridder Ulrich (Sean Bean) krijgt van de Kerk de opdracht deze geruchten te onderzoeken. Als gids neemt hij de jonge monnik Osmund (Eddie Redmayne) mee, die hem en zijn bende huurlingen als gezant van God veilig door het moerasland naar het dorp moet leiden. De reis is hachelijk en vol gevaren, maar pas in het dorp zelf stuiten ze op de ultieme gruwel.\n\n[url=http://www.imdb.com/title/tt1181791/]IMDB[/url]\nUK / Germany\nDrama / Horror\n102 minutes\n\nDirected by Christopher Smith\nEddie Redmayne, Sean Bean and Carice van Houten\n\nThe medieval England is ravaged by the plague. Hundreds of corpses were scattered and the country was plunged into chaos. The Church loses its grip on the population, who fear predominates. All hopes are pinned on a village that seems to remain as yet spared the disease. It is remote and surrounded by marsh. There are rumors that the village run by a sorceress. This Langiva (Carice van Houten) would create dead to life. The dreaded knight Ulrich (Sean Bean) gets the task of the Church to investigate these rumors. If he takes the young monk guide Osmund (Eddie Redmayne) with which he and his band of mercenaries as a messenger of God safely through the marsh land to the village to lead. The journey is perilous and full of dangers, but only in the place they come on the ultimate horror.\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nVideo : Untouched\nAudio : English DD 5.1\nMenu : Edited where needed\nSubs : Nederlands retail\nExtra's : All stripped\nSource : Black.Death.2010.LiMiTED.NL.PAL.DVDR-DORiTOS \nOndertitels : Nederlands (instelbaar) \nGenre : Drama Horror\n \n\nEnjoy the movie\n\nXX-Men","torrent":{"xt":"urn:btih:b48df155e5a344f6c2ab64a65e73783502600117","amp;dn":"Black+Death+%282010%29+DVD+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b48df155e5a344f6c2ab64a65e73783502600117","infoHashBuffer":{"type":"Buffer","data":[180,141,241,85,229,163,68,246,194,171,100,166,94,115,120,53,2,96,1,23]},"announce":[],"urlList":[]}}