{"title":"Quarterly Reviews of Biophysics, Volume 38","uid":5916319,"size":9029416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b49c0602baef4b34b1ad8128e45a3663656abb5f&amp;dn=Quarterly+Reviews+of+Biophysics%2C+Volume+38&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Theta91","files":-1,"time":1288246577,"description":"Quarterly Reviews of Biophysics covers the whole field of biophysics, from ion channels to DNA topology and from X-ray diffraction to NMR. The journal has gained a worldwide reputation, demonstrated by its high ranking in the ISI Science Citation Index, as a forum for general and specialised communication between biophysicists working in different areas. The majority of reviews published are invited from authors who have made significant contributions to the field, who give critical, readable and sometimes controversial accounts of recent progress and problems in their speciality. Thematic issues are occasionally published.\n\n- journals.cambridge.org\n\nIssue 01:\npp. 1-47. Structure and function of SNARE and SNARE-interacting proteins\npp. 49-95. Homing endonuclease structure and function\n\nIssue 02:\npp. 97-166. Two-photon fluorescence excitation and related techniques in biological microscopy\npp. 167-219. NMR structures of paramagnetic metalloproteins\n\nIssue 03:\npp. 221-243. RNA structural motifs--building blocks of a modular biomolecule\npp. 245-288. The experimental survey of protein-folding energy landscapes\n\nIssue 04:\npp. 289-290. Introduction\npp. 291-301. Unfolding single RNA molecules--bridging the gap between equilibrium and non-equilibrium statistical thermodynamics (Essay)\npp. 303-309. Nucleic acid structure and intracellular immunity--some recent ideas from the world of RNAi (Essay)\npp. 311-320. An extra dimension in nucleic acid sequence recognition (Essay)\npp. 321-330. Transduction of biochemical signals across cell membranes (Essay)\npp. 331-337. Differences between non-specific and bio-specific, and between equilibrium and non-equilibrium, interactions in biological systems (Essay)\npp. 339-344. Recognizing DNA (Essay)\npp. 345-350. Addressing the challenges of cellular delivery and bioavailability of peptide nucleic acids (PNA) (Essay)\npp. 351-361. Destabilization and stabilization of proteins (Essay)\npp. 363-371. DNA enables nanoscale control of the structure of matter (Essay)\npp. 373-383. Lipid microdomains in model and biological membranes--how strong are the connections?\npp. 385-395. Designing ligands to bind proteins (Essay)\npp. 397-403. Assembly of the 30S ribosomal subunit (Essay)\npp. 405-410. Recent successes of the energy landscape theory of protein folding and function (Essay)\npp. 411. Acknolwedgements\n","torrent":{"xt":"urn:btih:b49c0602baef4b34b1ad8128e45a3663656abb5f","amp;dn":"Quarterly+Reviews+of+Biophysics%2C+Volume+38","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b49c0602baef4b34b1ad8128e45a3663656abb5f","infoHashBuffer":{"type":"Buffer","data":[180,156,6,2,186,239,75,52,177,173,129,40,228,90,54,99,101,106,187,95]},"announce":[],"urlList":[]}}