{"title":"LOST Season 6 - DVD 1","uid":5907290,"size":7639531567,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b49e3008e7462771022897f3bdb06692a78a6f69&amp;dn=LOST+Season+6+-+DVD+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"darth-malachi","files":2,"time":1287879852,"description":"Lost: The Complete Sixth Season: DVD 1 of 5\nIncludes the episodes:\n#6.01: LA X, Part (With audio commentary by Damon Lindelof and Carlton Cuse)\n#6.02: LA X, Part 2\n#6.03: What Kate Does\n#6.04 The Substitute\n\nThis is the first of the five DVD's in the complete collection of Sixth and Final Season of LOST. As you can see from the torrent's size, this is the DVD9 image, which means the original, untouched DVD9: Copyright Warnings, DVD adverts, movie trailers are all left there.\n\nNow, with Season 5 DVDs I tried to remove all those no doubt unwanted things and present them as DVD5 ready to be burned. However, I received a lot of criticism for the changes I've made: some were unhappy about removing non-English audio tracks and subtitles, some were having problems burning the images with their software, and one person even declared he wouldn't have downloaded this if he knew it was PAL.\n\nAnd so, for this time, I decided not to mess with it and just upload the images right as they are taken from the original DVDs. Enjoy, and if you want a version that you can burn on a disk, there are plenty of tools and guides on the web to make this happen the way you want it.\n\nOne more thing: PLEASE SEED THE TORRENT AFTER YOU DOWNLOAD IT. My Season 5 uploads barely have any seeders left, think of those who'll come after you!","torrent":{"xt":"urn:btih:b49e3008e7462771022897f3bdb06692a78a6f69","amp;dn":"LOST+Season+6+-+DVD+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b49e3008e7462771022897f3bdb06692a78a6f69","infoHashBuffer":{"type":"Buffer","data":[180,158,48,8,231,70,39,113,2,40,151,243,189,176,102,146,167,138,111,105]},"announce":[],"urlList":[]}}