{"title":"Auf Wiedersehen Pet Seasons 1 &amp; 2 - English .srt subs","uid":5919586,"size":1770962,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b5093abffbe3e263dd506228f8eca447cac33f01&amp;dn=Auf+Wiedersehen+Pet+Seasons+1+%26+2+-+English+.srt+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Vulturama","files":26,"time":1288348157,"description":"English .srt subs for Auf Wiedersehen Pet Seasons 1 and 2\n\nPLEASE READ\n1. These subs are NOT perfect (read on if you want to know why) but they are pretty good\n2. Sync'd with most Season 1 and 2 DIVX and AVI versions - read on if you have trouble\n3. I do NOT have original subs for other seasons, so, sorry but I can't convert those!\n\nINFO\nSeason 1 and 2 English subtitle files in .srt format - should work fine on stand-alone players as well as your computers.\n\nIf you're looking for these you probably know what they're for. Even for English speakers it can be a bit tough trying to understand the dialects in this show!\n\nThese subs are converted from the &quot;Hard Of Hearing&quot; subs included in the DVD's, using SubToSup and DVDSubEdit. That means using OCR, which is far from perfect. So, the most common OCR read errors (and there were many many many) were then fixed using Find And Replace in a text editor. &quot;Hard of hearing&quot; subs were removed (ex &quot;Police siren sounds in background&quot;).\n\nBut a warning - there are still some ERRORS in these subs! In particular, the OCR could NOT recognise text in italics, which is primarily when an actor speaks off-screen, so I'm afraid those sections are illegible. Please don't complain - what I HAVE done took many hours and I don't have the time to manually re-edit all the stuff in italics. If one of you wants to do it, that would be cool!\n\nSync'd with most Season 1 and 2 DIVX and AVI versions I think. If you need to resync them, Subtitle Workshop is great software. And make sure each sub (.srt) file is  named EXACTLY the same as the video file you want it to work with!","torrent":{"xt":"urn:btih:b5093abffbe3e263dd506228f8eca447cac33f01","amp;dn":"Auf+Wiedersehen+Pet+Seasons+1+%26+2+-+English+.srt+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5093abffbe3e263dd506228f8eca447cac33f01","infoHashBuffer":{"type":"Buffer","data":[181,9,58,191,251,227,226,99,221,80,98,40,248,236,164,71,202,195,63,1]},"announce":[],"urlList":[]}}