{"title":"Dead Teenagers 2007 DVDRip XviD-VoMiT","uid":5700314,"size":735090688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b53169c79b962c70b179a64174799b9b29456851&amp;dn=Dead+Teenagers+2007+DVDRip+XviD-VoMiT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1279479095,"description":"REVIEW FROM IMDB\n\nHere is a low-budget, shot on video horror film done anthology style--maybe the only SOV anthology out there so far? It is one of those film-school type productions where it looks like friends, family, and classmates make up the cast. So I thought I should start off by mentioning I had nothing to do with the making of this movie (too many IMDb comments are obviously done by someone who worked on the movie they comment on).\n\nThe film starts off with a student looking through the library shelves where he finds a beat up old composition book. As he looks through it, he reads four stories that make up the different segments of the movie. My strongest recommendation is that you don't give up on this movie after the first story. Titled, &quot;The Boo Men,&quot; it was non-linear and I didn't find it very effective. I enjoyed each story afterward more and more. There was one about a boy becoming a werewolf and has to push his girlfriend away to protect her. &quot;Skeleton Keys&quot; was about a young girl returning to the home where her aunt was murdered and finding pieces of her family's past. The last one is about a movie theater going out of business that happens to have vampires living in an unused room.\n\nI liked the low budget feel and atmosphere, and I liked a lot of the performances--my two favorites were the girl who played piano and the curly haired kid that worked at the theater. I thought it was fun and that the writing was interesting enough to keep me watching to the end. I would like to see more like this.\n\n\nPLEASE COMMENT AND SEED AND BE PATIENT AS MY UPLOAD SPEED IS CAPPED AT 40kbps!\n\nSCREENS - Remove the 'x' from the link - the quality isn't awesome but its here if you want it!!!\n &lt;a href=&quot;\nhttp://i29.tinypic.xcom/23r2zrl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i29.tinypic.xcom/23r2zrl.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i32.tinypic.xcom/snkifc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i32.tinypic.xcom/snkifc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i27.tinypic.xcom/2r3fdqe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i27.tinypic.xcom/2r3fdqe.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b53169c79b962c70b179a64174799b9b29456851","amp;dn":"Dead+Teenagers+2007+DVDRip+XviD-VoMiT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b53169c79b962c70b179a64174799b9b29456851","infoHashBuffer":{"type":"Buffer","data":[181,49,105,199,155,150,44,112,177,121,166,65,116,121,155,155,41,69,104,81]},"announce":[],"urlList":[]}}