{"title":"American.Cowslip.2009.DVDRiP.XViD-VOMiT","uid":5828327,"size":735200764,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b63bf73058827135c680feee1e71d096e8f99411&amp;dn=American.Cowslip.2009.DVDRiP.XViD-VOMiT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"XoLWoX","files":-1,"time":1284411017,"description":"Genre: Comedy\n\nRating:6.4/86(Votes)\n\nCountry:USA\n\nLanguages:English\n\nPlot Outline: In Blythe, California, a small town in the remote California desert, Ethan Inglebrink is an eccentric...\n\n\nPlot: In Blythe, California, a small town in the remote California desert, Ethan Inglebrink is an eccentric, agoraphobic heroin addict who is obsessed with his garden. This dark comedy follows the last days of Ethan's life as he struggles to find purpose at a time when it might be too late to even matter. After convincing his senior poker buddies that he is diabetic, in order to explain his frequent use of syringes, Ethan shoots up while trying to win poker money to fund his gardening hobby and drug use. Nearing eviction, Ethan gardens furiously in hopes of winning the $10,000 first prize in the &quot;Garden of the Year&quot; contest so he can pay his delinquent rent. Between sugar-munching binges and exchanges with a motley crew of neighbors, Ethan tries to grow the perfect &quot;American cowslip&quot;, a beautiful, rare flower that will be the centerpiece of his garden and the floral representation of his life. When his efforts are thwarted by his landlord/high school football coach/next door neighbor, Trevor O'Hart, Ethan faces eviction and the loss of his beloved garden, his sanity and the camaraderie he shares with his best friend and poker buddy, Roe. Believing he has finally found true love, Ethan unknowingly expedites his own demise when he reciprocates the affections of Georgia, a beautiful seventeen-year old girl who lives across the street and dreams of leaving Blythe and her abusive father behind. Head to head in a hilarious battle of the gardens with Trevor, Ethan must rise to the occasion and fix the life that he has screwed up so badly and save Georgia. With a seemingly subconscious awareness of his impending death, he decides that if he's going down, then he's going down in style.","torrent":{"xt":"urn:btih:b63bf73058827135c680feee1e71d096e8f99411","amp;dn":"American.Cowslip.2009.DVDRiP.XViD-VOMiT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b63bf73058827135c680feee1e71d096e8f99411","infoHashBuffer":{"type":"Buffer","data":[182,59,247,48,88,130,113,53,198,128,254,238,30,113,208,150,232,249,148,17]},"announce":[],"urlList":[]}}