{"title":"Star Wars The Force Unleashed 2 [PAL][Spanish][Wii][www.consolas","uid":5917341,"size":4699980130,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:b6cfb86ac91cc70789551f601cf1c81ac234d764&amp;dn=Star+Wars+The+Force+Unleashed+2+%5BPAL%5D%5BSpanish%5D%5BWii%5D%5Bwww.consolas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"consolasatope","files":3,"time":1288273328,"description":"En Star Wars: El Poder de la Fuerza II para Wii los jugadores deberÃƒÂ¡n asumir de nuevo el papel del aprendiz secreto de Darth Vader a lo largo de los sucesos presentados en el inexplorado tiempo que se sucede entre Star Wars Episodio III: La venganza de los Sith y Star Wars Episodio IV: Una nueva esperanza.\n\nEn Star Wars: El Poder de la Fuerza conocÃƒÂ­amos a Starkiller, el aprendiz secreto de Darth Vader, que en esta nueva ediciÃƒÂ³n del juego tendrÃƒÂ¡ un papel protagonista y tenderÃƒÂ¡ los cimientos de una rebeliÃƒÂ³n en la galaxia.\n\nStarkiller regresa con un mayor control sobre la Fuerza, para embarcarse en un viaje que le llevarÃƒÂ¡ a descubrir su verdadera identidad y a reencontrarse con su amor verdadero, Juno Eclipse. En Star Wars: El Poder de la Fuerza II Starkiller serÃƒÂ¡ de nuevo el peÃƒÂ³n de Darth Vader quien, a pesar de haber formado a su protegido como a un asesino despiadado, estÃƒÂ¡ tramando un implacable plan de clonaciÃƒÂ³n para crear al guerrero Sith supremo.\n\nCon mejorados poderes de la Fuerza y la habilidad para blandir un sable de luz doble, Starkiller se enfrentarÃƒÂ¡ a nuevos enemigos, algunos de ellos conocidos por su participaciÃƒÂ³n en las pelÃƒÂ­culas de Star Wars, en una bÃƒÂºsqueda desesperada para encontrar respuesta a las dudas de su pasado.\n\n* ContinÃƒÂºa las aventuras de Starkiller huyendo de las garras de Darth Vader, a lo largo de los acontecimientos sucedidos entre Star Wars: Episodio III y el Episodio IV.\n* Desata la Fuerza con mÃƒÂ¡s poder y precisiÃƒÂ³n, gracias a la mejora de los controles y los nuevos poderes; como las habilidades de la mente y el engaÃƒÂ±o, para convertir a tus enemigos en aliados.\n* Descubre el verdadero poder de Starkiller, considerablemente aumentado.\n* Conoce la integraciÃƒÂ³n mejorada del personaje con los escenarios y puzles.\n* Toma el control del novedoso sable de luz doble y castiga a tus enemigos con nuevos ataques combinados.\n* Experimenta una interacciÃƒÂ³n ÃƒÂºnica entre los elementos gracias a las tecnologÃƒÂ­as Digital Molecular Matter (DMM), el motor Euphoria y al poderoso sistema de fÃƒÂ­sicas Havok.\n* La customizaciÃƒÂ³n de los personajes ha sido ampliada, incluyendo nuevas vestimentas y poderes de los sables de luz.\n* Lucha a travÃƒÂ©s de nuevos niveles diseÃƒÂ±ados para afinar el poder de la Fuerza y sus habilidades.\n* Coordina hÃƒÂ¡bilmente tus tÃƒÂ©cnicas de combate para derrotar a nuevos enemigos, y enfrentarte a poderosos jefes finales.\n* Descubre los nuevos detalles de una historia que ha sido reconocida por la Academy of Interactive Arts and Sciences.\n* Reta a tus amigos para conocer quiÃƒÂ©n es el mejor utilizando la Fuerza en el modo para 4 jugadores, que se incluye en la plataforma Wii.","torrent":{"xt":"urn:btih:b6cfb86ac91cc70789551f601cf1c81ac234d764","amp;dn":"Star+Wars+The+Force+Unleashed+2+%5BPAL%5D%5BSpanish%5D%5BWii%5D%5Bwww.consolas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6cfb86ac91cc70789551f601cf1c81ac234d764","infoHashBuffer":{"type":"Buffer","data":[182,207,184,106,201,28,199,7,137,85,31,96,28,241,200,26,194,52,215,100]},"announce":[],"urlList":[]}}