{"title":"Glengarry Glenn Ross (Std DivX from HD) Michael Rizzo","uid":5926948,"size":715534834,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b756645ca882543eb3ae7da81d4a6a759c9ab875&amp;dn=Glengarry+Glenn+Ross+%28Std+DivX+from+HD%29+Michael+Rizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1288633708,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0104348/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0104348/&lt;/a&gt;\n\nConverted from HD bluray, this is a far far superior picture quality to the\nXvid version that we checked on the net, which looks fuzzy in quality by\ncomparison to what we produced here working with bluray source content.\n\n\nBy the way, our recently launched Godfather Trilogy has 35 seeders on it\nrather than just 6 as the piratebay is showing instead. I wish someone\nwould get their act togethjer down there and stop retardting our numbers\nat every turn. Amen.\n  \n\nThis movie is a brilliant work by David Mamet in what is a Pullitzer Prize\nwinning script  of great insight into the world of high pressure sales \nenvironments - where strictly being paid by &quot;commission&quot; takes its toll on the\nindividuals involved.\n\nDavid Mamet is well known for his work in somewhat esoteric circles of taste\nin this respect - as he was director in &quot;House of Games&quot; the other such great\nmovie starring in this case, his former lovely wife Ms. Lindsay Crouse, and \nstarring as well the talented Mr. Joe Mantegna\n\n\nIt is clear that Mamet has his mind well tuned to the brilliantly insightful \nnuances through well scripted glimpses into the human psyche around such\nsituations as are similarly themed to some extent across such of his works\nas I mention here.\n\nHis genius is done justice with the brilliant acting too of Al Pacino,\nJack Lemmon and a nice show as well by Alec Baldwin and the rest of the\ncrew in this great movie offering. This script would be a great idea for\na permanent run on Broadway too perhaps!\n\nIf you want to learn more about the sort of people who are the sorts\noften drawn into the high stakes game of &quot;large ticket&quot; commission sales\nsuch as real estate and fancy cars and what have you, or in any event want\nto gain more insight into the human condition with this well acted well\nscripted play, you wont want to miss out. \n\nThis movie rates having a &quot;cult following&quot; of sorts - as did &quot;house of Games&quot;\na movie that is also one of my favorites too.\n\nHaving earned my licence to sell Real estate at the age of 19, and having\nhad a successful career in marketing, I can tell you these folks here miss\nthe boat entirely when they choose a High pressure sales approach rather\nthan giving genuine care to their clients instead. Thats the stuff of losers\nrather than the mark of a real winner, no matter how much they get lucky \nenough to put away into the bank in the meantime. This approach is always\ndoomed to fail.\n\nMichael Rizzo Chessman","torrent":{"xt":"urn:btih:b756645ca882543eb3ae7da81d4a6a759c9ab875","amp;dn":"Glengarry+Glenn+Ross+%28Std+DivX+from+HD%29+Michael+Rizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b756645ca882543eb3ae7da81d4a6a759c9ab875","infoHashBuffer":{"type":"Buffer","data":[183,86,100,92,168,130,84,62,179,174,125,168,29,74,106,117,156,154,184,117]},"announce":[],"urlList":[]}}