{"title":"Joe Elliott's Down 'N' Outz - England Rocks (2nafish)","uid":5831846,"size":109668356,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b75ecd46dee41148c85c4296df3b04d427073905&amp;dn=Joe+Elliott%5C%27s+Down+%5C%27N%5C%27+Outz+-+England+Rocks+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284545274,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nJoseph Thomas &quot;Joe&quot; Elliott (born 1 August 1959) is an English singer-songwriter, best known as the lead vocalist of the British rock band Def Leppard. He is also currently playing in the Mott the Hoople related cover band, Down 'n' Outz.\n\nElliott was born in Sheffield, South Yorkshire and was educated at King Edward VII School. Elliott met Pete Willis, a member of a local band called Atomic Mass, in November 1977 when he missed a bus. After finding out that they were both musicians, Elliott met the rest of the band members and auditioned. He admitted it was the greatest thing he had ever done in his life. The band was impressed by his singing and hired him as a vocalist. The other members even took Elliott's suggestion to change their name to &quot;Deaf Leopard,&quot; which was later changed to &quot;Def Leppard&quot; to distinguish them from punk bands, as including an animal in the band name was popular in the punk community in Britain at the time. It has also been suggested that the intentional mis-spelling was partly an homage to &quot;Led Zeppelin.&quot; Elliott soon became an integral part of the band while also contributing his songwriting skills.\n\nAs a songwriter, Elliott has drawn from his eclectic tastes in music (ranging from pop-rock to folk) as sources of inspiration. He also often comments that the lyrics to Def Leppard's music are almost never personal; they are meant to be easily accessible to the listener. He also plays guitar and drums as well as piano and electronic keyboard.\n\nDef Leppard are a hard rock and heavy metal band from Sheffield, England, which formed in 1977 as part of the New Wave of British Heavy Metal movement. Since 1992, the band have consisted of Joe Elliott (vocals), Phil Collen (guitar), Vivian Campbell (guitar), Rick Savage (bass guitar), and Rick Allen (drums).\n\nThe band's strongest commercial success came in the early 1980s to the early 1990s. Their 1981 album High 'n' Dry was produced by Robert John &quot;Mutt&quot; Lange, who helped them begin to define their style, and the album's stand out track &quot;Bringin' On the Heartbreak&quot; became one of the first metal videos played on MTV in 1982. The bands next studio album Pyromania in 1983, with the lead single &quot;Photograph&quot;, turned Def Leppard into a household name. In 2004, the album ranked number 384 on Rolling Stone's 500 Greatest Albums of All Time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b75ecd46dee41148c85c4296df3b04d427073905","amp;dn":"Joe+Elliott%5C%27s+Down+%5C%27N%5C%27+Outz+-+England+Rocks+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b75ecd46dee41148c85c4296df3b04d427073905","infoHashBuffer":{"type":"Buffer","data":[183,94,205,70,222,228,17,72,200,92,66,150,223,59,4,212,39,7,57,5]},"announce":[],"urlList":[]}}