{"title":"Darren Shan - [City Trilogy 01] - Procession of the Dead(FANTASY","uid":5709145,"size":5496899,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b7cec9e6f07dcb31bca7a9a7261dbde7a134febb&amp;dn=Darren+Shan+-+%5BCity+Trilogy+01%5D+-+Procession+of+the+Dead%28FANTASY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kash79","files":11,"time":1279817561,"description":"Darren Shan - [City Trilogy 01] - Procession of the Dead\n\ngenre - Dark Fantasy\n\n\nBOOK ONE - PROCESSION OF THE DEAD.\nThe first volume in a noirish, gritty urban fantasy for adults from the bestselling author otherwise known as Darren Shan.\n\nNew York Times bestselling YA author Darren Shan makes his adult fiction debut with this first book in a new series set in a darkly imagined world called the City.\n\nPROCESSION OF THE DEAD\n\nWhat had I done before coming to the city? I couldn't remember. It sounded crazy but my past was a blank. I could recall every step since alighting from the train, but not a single one before.\n\nYoung, quick-witted and cocksure, Capac Raimi arrives in the City determined to make his mark in a world of sweet, sinister sin. He finds the City is a place of exotic dangers: a legendary assassin with snakes tattooed on his face who moves like smoke, blind Incan priests that no one seems to see, a kingpin who plays with puppets, and friends who mysteriously disappear as though they never existed. Then Capac crosses paths with The Cardinal, and his life changes forever.\n\nThe Cardinal is the City, and The City is The Cardinal. They are joined at the soul. Nothing moves on the streets, or below them, without the Cardinal's knowledge. His rule is absolute.\n\nWhen Capac discovers the extent of The Cardinal's influence on his own life, he is faced with hard choices and his own soaring ambition. To find his way, Capac must know himself and what he is capable of. But how can you trust yourself when you can't remember your past?\n\n\n\nformats - html , epub ,mobi , lit, pdf","torrent":{"xt":"urn:btih:b7cec9e6f07dcb31bca7a9a7261dbde7a134febb","amp;dn":"Darren+Shan+-+%5BCity+Trilogy+01%5D+-+Procession+of+the+Dead%28FANTASY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7cec9e6f07dcb31bca7a9a7261dbde7a134febb","infoHashBuffer":{"type":"Buffer","data":[183,206,201,230,240,125,203,49,188,167,169,167,38,29,189,231,161,52,254,187]},"announce":[],"urlList":[]}}