{"title":"Venus Envy (webcomic) (01-dec-2001 / 16-Mar-2010) ","uid":5744242,"size":132850348,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b9d2b18ed7203c8916f443cff90671425308645e&amp;dn=Venus+Envy+%28webcomic%29+%2801-dec-2001+%2F+16-Mar-2010%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Virga","files":-1,"time":1281141880,"description":"Venus Envy is a typical high school romantic comedy, with the welcome addition of lesbians, crossdressers, and of course transsexuals. The story follows ZoÃƒÂ«, a teenage male-to-female transsexual, as she comes of age, tries to keep her secret, and tackles lifes challenges.\n\n\nYoung Alex has never felt like a boy, and it causes severe depression. After revealing his feelings to his parents, they take him for extensive therapy, and finally agree to let him transition into ZoÃƒÂ«, a teenage girl. This causes problems in their home town of Punxsutawney, PA, and eventually the family relocates to scenic Salem, where they can get a fresh start.\n\nZoes overbearing mother and overprotective father make her new life interesting, and her little brothers resentment of this new lifestyle and general teen angst dont help. Meanwhile, she makes friends with several of Salems most colorful residents, including an estranged lesbian, a deep-stealth female-to-male with way too many connections, and the drool-worthy bad boy who wants to reform.\n\nThe series draws on many of the high-school drama clichÃƒÂ©s we all know and love, and then spins them off in weird new directions.\n  &lt;a href=&quot;\nhttp://www.venusenvycomic.com/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.venusenvycomic.com/index.php&lt;/a&gt;\n\nThis webcomic is copyrighted by Erin Lindsey. If you like it (you will) please donate.\n\nSeeding will be slow at first so please be patient.","torrent":{"xt":"urn:btih:b9d2b18ed7203c8916f443cff90671425308645e","amp;dn":"Venus+Envy+%28webcomic%29+%2801-dec-2001+%2F+16-Mar-2010%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9d2b18ed7203c8916f443cff90671425308645e","infoHashBuffer":{"type":"Buffer","data":[185,210,177,142,215,32,60,137,22,244,67,207,249,6,113,66,83,8,100,94]},"announce":[],"urlList":[]}}