{"title":"The Monterey Quartet - Monterey Jazz Festival (2009)","uid":5695704,"size":495808828,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ba1598f9d2de688b1fc94b1275deb8c941965c29&amp;dn=The+Monterey+Quartet+-+Monterey+Jazz+Festival+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":21,"time":1279296177,"description":"At the 50th anniversary of the Monterey Jazz Festival, held in September 2007,\nbassist Dave Holland, pianist Gonzalo Rubalcaba, saxophonist Chris Potter, and\ndrummer Eric Harland performed the music you hear on this CD twice-first on the\nmain stage, then again at Dizzy's Den, a smaller, more intimate hall on the\nfestival grounds. The main stage premiere thrilled the crowd, to be sure, but\nsomething downright magical happened the second time the band played.\n\n&quot;There was really an electric atmosphere from the audience,&quot; recalls\nHolland. &quot;There was an energy we all felt, that kind of circular energy that\ngoes on between the musicians and the audience. It's a very powerful thing when\nit really takes off.&quot;\n\nFrom the first urgent notes of Harland's &quot;Treachery,&quot; you can feel a special\nsituation unfolding. We are fortunate that tape was rolling.\n\nOver its 52-year history, the Monterey Jazz Festival has done well at capturing\nsuch moments. You probably already know about Charles Mingus' extraordinary 1964\nperformance of Meditations on Integration, the debut of the John Handy Quintet\nthe following year and Charles Lloyd's Forest Flower the year after that.\n\nThough all four players come from vastly different backgrounds, they share at\nleast three important characteristics, not the least of which is a penchant for\nrhythmic complexity (and the dexterity to deal with it). Anyone familiar with\nHolland's work knows that his ability to swing with locomotive momentum through\nodd time signatures (or combinations thereof, within a single piece), jagged\npatterns and polyrhythmic jungles is legendary. Rubalcaba, for his part, has\ninternalized a host of traditional Latin American rhythms, but rather than\nmanifesting them in a folkloric way, he extends them into the modern idiom. Fans\nof Eric Harland-who may know his work with Blanchard-has recently made a\npronounced move toward the world rhythms, as well.\n\n&quot;I'm more influenced by Zakir Hussain these days,&quot; says Eric, who has been\nworking with the Indian tabla player in a trio with Charles Lloyd, on the album\nSangam. &quot;His consciousness of rhythm opens up a realm for us to communicate on\nso many polyrhythmic levels, as well as the discovery of different sounds and\ntextures.&quot;\n\n&quot;We've all been working on how to work within different meters and not have it\nsound like an academic exercise, but make it sound like music,&quot; says Potter,\nwhose mastery of odd time signatures is evident in his work with Holland as well\nas on his own.\n\nAll four of these players also privilege the idea of jazz as a conversation (as\nopposed to oration or, God forbid, soliloquy), which means they are all keen\nlisteners as well as speakers. They can turn on a dime when someone else tosses\nin a dollar, remaining open to the flow of the music as it manifests itself.\n\nFinally, these players also share a third, more elusive quality, one the\nAndalusian poet Garcia Lorca called duende, and which might best be translated\nas soulfulness. There is never a moment on this album when-like the bullfighter\nand bull in the ring-you feel the music is being played for stakes any lower\nthan life and death. This is the real deal.\n\nFrom the liner notes by Paul de Barros\n\n\nThe Music:\n01 - Treachery (Harland) 07:46\n02 - Minotaur (Potter) 11:35\n03 - Otra Mirada (Rubalcaba) 05:16\n04 - Step to It (Holland) 10:11\n05 - Maiden (Harland) 10:33\n06 - 50 (Rubalcaba) 09:59\n07 - Veil of Tears (Holland) 10:47\n08 - Spoken Introduction 00:38\n09 - Ask Me Why (Potter) 11:21\n\nTotal Time: 78:10\n\nThe Players:\n* Dave Holland - bass\n* Gonzalo Rubalcaba - piano\n* Chris Potter - tenor saxophone\n* Eric Harland - drums\n\nRecorded live at the Monterey Jazz Festival, September 22, 2007","torrent":{"xt":"urn:btih:ba1598f9d2de688b1fc94b1275deb8c941965c29","amp;dn":"The+Monterey+Quartet+-+Monterey+Jazz+Festival+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba1598f9d2de688b1fc94b1275deb8c941965c29","infoHashBuffer":{"type":"Buffer","data":[186,21,152,249,210,222,104,139,31,201,75,18,117,222,184,201,65,150,92,41]},"announce":[],"urlList":[]}}