{"title":"The Electric Light Orchestra - Turn To Stone (2nafish)","uid":5839730,"size":137963524,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ba19502f41213f4b414a5ab91f376cba4d7da745&amp;dn=The+Electric+Light+Orchestra+-+Turn+To+Stone+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284893869,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n\\&quot;Turn to Stone\\&quot; is a 1977 song by Electric Light Orchestra.\n\nThe song is the opening track to the double album Out of the Blue. It was the first song released as a single from the LP. The single reached #18 in the U.K. charts and stayed there for 12 weeks. Out of four singles from the album, \\&quot;Turn to Stone\\&quot; was the only song not to reach the top ten in the U.K. singles charts. The song was more successful across the Atlantic, reaching #13 in the U.S and hitting the top spot in Canada in early-1978.\n\nThe song was composed in Switzerland during Jeff Lynne\\'s two week writing marathon for his double album. Lynne played the moog bassline of the song.\n\nOn November 4, 2008, Jeff Lynne was awarded a BMI (Broadcast Music, Inc) Million-Air certificates for \\&quot;Turn To Stone\\&quot; for having one million airplays.\n\nThe song featured in the Doctor Who episode \\&quot;Love &amp; Monsters\\&quot; (2006), along with \\&quot;Mr. Blue Sky\\&quot; and \\&quot;Don\\'t Bring Me Down\\&quot;, both of which were performed by characters in the episode.\n\nThe song is also featured in the movie Detroit Rock City.\n\nOut of the Blue is the seventh studio album by the British rock group Electric Light Orchestra, released in October 1977. Written and produced by ELO frontman Jeff Lynne, the double album is among the most commercially successful records in the group\\'s history.\n\nJeff Lynne  wrote the entire album in three and a half weeks after a sudden burst of creativity while hidden away in his rented chalet in the Swiss Alps. It took a further two months to record in Munich. The album had 4,000,000 pre-ordered copies and quickly went multi-Platinum upon release. Out of the Blue  spawned five hit singles in different countries, and was ELO\\'s most commercially successful studio album. It was also the first double album in the history of the UK music charts to generate four top twenty hit singles. Side three of the original double LP consisted of the symphonic Concerto for a Rainy Day, composed of four separate tracks which together made up a cohesive suite. The inclement weather effects heard on \\&quot;Concerto\\&quot; were real and recorded by Jeff Lynne during a very rainy summer in Munich 1977. The Concerto suite would be Lynne\\'s last dabbling in symphonic rock.\n\nJeff Lynne considers A New World Record and Out of the Blue to be the group\\'s crowning achievements and both sold extremely well, reaching multi-platinum according to RIAA Certification. Capital Radio and The Daily Mirror Rock and Pop Awards (forerunner to The Brit Awards) named it \\&quot;Album of the Year\\&quot; in 1978. Jeff Lynne, the album\\'s composer, received his first Ivor Novello award for Outstanding Contributions to British Music the same year.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ba19502f41213f4b414a5ab91f376cba4d7da745","amp;dn":"The+Electric+Light+Orchestra+-+Turn+To+Stone+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba19502f41213f4b414a5ab91f376cba4d7da745","infoHashBuffer":{"type":"Buffer","data":[186,25,80,47,65,33,63,75,65,74,90,185,31,55,108,186,77,125,167,69]},"announce":[],"urlList":[]}}