{"title":"Machete 2010","uid":5900991,"size":519554059,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb50b69a845396d16bb6a786c87588dd2da652b2&amp;dn=Machete+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cesarx2008","files":1,"time":1287621739,"description":"CaracterÃƒÂ­sticas del video\n\n\n\nTÃƒÂ­tulo: Machete\nGÃƒÂ©nero: AcciÃƒÂ³n\nTamaÃƒÂ±o: 495 mb\nCodificaciÃƒÂ³n: RMVB\nCalidad: Buena\nEstreno: octubre 2010\nSubtÃƒÂ­tlos: pegados, espaÃƒÂ±ol\nLinks: 1\nContraseÃƒÂ±a: no tiene\nDirect/Actores: Michelle Rodriguez, Jessica Alba, Robert De Niro, Lindsay Lohan, Cheech Marin, Jeff Fahey, Steven Seagal, Don Johnson y Rose McGowan\n\n\nSinopsis:\n\n\nPuede que parezca un jornalero mÃƒÂ¡s que trabaja en las calles y el perfecto chivo expiatorio para un retorcido asesinato polÃƒÂ­tico. Pero en realidad es MACHETE, un legendario ex-federale con habilidades que estÃƒÂ¡n mÃƒÂ¡s que a la altura de su actitud mortÃƒÂ­fera.\n\nDado por muerto despuÃƒÂ©s de un enfrentamiento con el cÃƒÂ©lebre rey de la droga mexicano Torrez, Machete huye a Texas para desaparecer y olvidar su trÃƒÂ¡gico pasado. Pero lo que encuentra es una red de corrupciÃƒÂ³n y engaÃƒÂ±o que termina con una bala en el cuerpo de un senador y con Machete como uno de los hombres mÃƒÂ¡s buscados.\n\nMachete se dispone a limpiar su nombre y descubrir la oscura e intricada conspiraciÃƒÂ³n. Pero en su camino se interpone Booth, un implacable hombre de negocios con una interminable nÃƒÂ³mina de asesinos a sueldo; Von, un retorcido vigilante de fronteras que lidera un pequeÃƒÂ±o ejÃƒÂ©rcito; y Sartana, una hermosa oficial de inmigraciÃƒÂ³n que se debate entre hacer cumplir la ley por un lado y en hacer lo correcto por otro.\n\nPara ayudar a equilibrar la balanza, Machete cuenta con Luz, una sexy vendedora ambulante de tacos con espÃƒÂ­ritu rebelde y corazÃƒÂ³n revolucionario, y con Padre, un cura que es bueno con las bendiciones pero mucho mejor con las armas.\n\nEn un camino de balas, sangre y corazones rotos, la odisea de Machete finalmente lo lleva de vuelta a Torrez y a una ÃƒÂ©pica batalla de venganza y redenciÃƒÂ³n.","torrent":{"xt":"urn:btih:bb50b69a845396d16bb6a786c87588dd2da652b2","amp;dn":"Machete+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb50b69a845396d16bb6a786c87588dd2da652b2","infoHashBuffer":{"type":"Buffer","data":[187,80,182,154,132,83,150,209,107,182,167,134,200,117,136,221,45,166,82,178]},"announce":[],"urlList":[]}}