{"title":"Acronis True Image Home 2010 v13 Build 7046(Murlok)","uid":5734797,"size":118289724,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bb704d451d8977b3de27832e67c43e750a064c26&amp;dn=Acronis+True+Image+Home+2010+v13+Build+7046%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Murlok","files":2,"time":1280769628,"description":"Release date:April-2010\nBuild: 7046\n\nAcronis is pleased to announce Acronis True Image Home 2010.\n\n \n\nNew Features\n\n* Integration with Acronis Drive Monitor: Acronis True Image Home backs up data on a hard drive as soon as there is an alarm on Acronis Drive Monitor about a potential problem with the drive.\n* Autoupdate: Acronis True Image Home automatically checks for a new version on the Web site every time you run the application.\n\nList of issues fixed in this update\n\n* Consolidation progress window shows the wrong time that remains till the task is finished.\n* System reboots when you press &quot;Tab&quot; in Acronis True Image Home Restore wizard on bootable media.\n* Some files are not included into the backup when you back up files and folders together with Windows special folders (e.g. &quot;Documents&quot;).\n* Scheduled e-mail backup fails if MS Outlook is running.\n* Acronis True Image Home overwrites full backups even if the &quot;A new full backup overwrites the previous one&quot; option is disabled.\n* Acronis True Image Home does not detect the iOmega REV-70 USB drive.\n* Acronis True Image Home renames an archive with the &quot;-&quot; symbol in its name when the task runs for the second time.\n* Acronis True Image Home 2010 on bootable media reboots the computer when you click the &quot;Next&quot; button in the &quot;Options&quot; window of the Backup wizard.\n* Partition labels are displayed incorrectly in the One-click Backup wizard.\n* The color of the days in the calendar remains blue (scheduled) for the current day even if the backup has already run successfully.\n* Consolidation fails with the &quot;Backup date cannot be found&quot; error in a log file.\n* Acronis True Image Home 2010 creates the &quot;MyBackups&quot; folder while a backup is being created.\n* Acronis True Image Home 2010 asks you to insert the next storage media when the size of the archive, created on the iOmega REV storage device reaches 2 GB.\n* Wireless keyboard and mouse packs do not work with Acronis True Image Home 2010 on bootable media.\n* One-Click Backup operation fails with the &quot;Tag 0x0&quot; error.\n* Acronis True Image Home becomes unresponsive when you delete a large backup from the Acronis Secure Zone.\n* TrueImage.exe process may stop responding after closing Acronis True Image Home.\n* Acronis Time Explorer recovers an empty *.doc file from an external hard drive in case the *.doc file was modified while the Time Explorer was running.\n* Acronis Time Explorer recovers a corrupted *.doc file in case the *.doc file was modified while the Time Explorer was running.\n\nKnown issues\n\n* Wrong hard drive icon is assigned to the mounted image in &quot;My computer&quot;.\n* The Program Compatibility Assistant detects a compatibility issue when you close the installation window and do not install Acronis True Image Home.\n\n\n\nTested And Working\n\n\nEnjoy","torrent":{"xt":"urn:btih:bb704d451d8977b3de27832e67c43e750a064c26","amp;dn":"Acronis+True+Image+Home+2010+v13+Build+7046%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb704d451d8977b3de27832e67c43e750a064c26","infoHashBuffer":{"type":"Buffer","data":[187,112,77,69,29,137,119,179,222,39,131,46,103,196,62,117,10,6,76,38]},"announce":[],"urlList":[]}}