{"title":"Roy William Neill - Black Moon (1934)","uid":5877687,"size":876627968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc18e8e089683bcf1c4e028ee2f27eb61e524708&amp;dn=Roy+William+Neill+-+Black+Moon+%281934%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"lord_terabyte","files":-1,"time":1286711848,"description":"Roy William Neill - Black Moon (1934)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0024895&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0024895&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img154.imageshack.us/img154/6964/blackmoon1020a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img154.imageshack.us/img154/6964/blackmoon1020a.jpg&lt;/a&gt;\n\nIn the 1930s and 1940s, it seems like nothing scared white America like being outnumbered by Negroes. An endless stream of African jungle adventure films came out exploiting that fear, as did a number of voodoo tales -- Black Moon being one of the earliest. Unlike predecessor White Zombie and successor I Walked with a Zombie, Black Moon details a white woman's encounter with voodoo without dragging in those precocious living dead. This well-made but obscure flick takes place on the fictional Caribbean isle of San Christopher, the birthplace of said white woman, Juanita Perez Lane (Dorothy Burgess). After her parents were killed by the ever-restless natives, Juanita was raised by her Uncle Raymond (Arnold Korff) -- that is, until he discovered that her nurse, &quot;that black woman Ruva&quot; (Madame-Sul-Te-Wan), &quot;filled [her] with the sound of the drums and the sight of blood, poisoned [her] with the voodoo&quot;. Raymond shipped her away to New York and apparently beat her senseless, as she has now little memory of her childhood hijinx. Now married to Stephen (Jack Holt) with an adorably irritating child, Nancy, Juanita begins to have a strange compulsion to drum... Drum like the wind! She decides to go back to San Christopher to face the source of her neurosis, and Stephen, the ever-concerned husband, sends his secretary Gail (Fay Wray) to protect her. It's never really clear why, but when Juanita arrives on the island, the natives throw flowers at her and bow wildly like she's a goddess. Uncle Raymond, however, wants her to go back to the US so she doesn't rile them up any more. As he explains to Stephen, &quot;We have five whites. Two of them are women, and one is a helpless child. And around us are 2,000 blacks.&quot; What, do they live in the White House? The black characters meanwhile hardly speak or show any personality -- basically lurking, leering, and killing anyone who tries to take Juanita away -- until Clarence Muse shows up as bug-eyed boatsman &quot;Lunch&quot; McClaren. Lunch brings Stephen to the island (while singin' &quot;Old Man River&quot;-type spirituals) and sticks around to help him fight off the natives, whom he calls &quot;monkey chasers&quot;. Although I hardly found myself rooting against them, I'm guessing the islanders aren't supposed to be sympathetic. For most of the movie, they're threatening and less than human, attacking black and white alike, destroying property, and being unseemly child care providers (Inexplicably, &quot;that black woman Ruva&quot; is allowed to care for Juanita's daughter and proceeds to give the little girl a knife to play with.). The most detestable character, Raymond, is portrayed as being cruel and abusive toward them, but in the end, he never gets his comeuppance. Not even a machette to the pinky toe.\n &lt;a href=&quot;\nhttp://img29.imageshack.us/img29/1150/001nz.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img29.imageshack.us/img29/1150/001nz.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img160.imageshack.us/img160/3249/013.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img160.imageshack.us/img160/3249/013.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img136.imageshack.us/img136/4670/019t.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img136.imageshack.us/img136/4670/019t.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img97.imageshack.us/img97/81/023.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img97.imageshack.us/img97/81/023.png&lt;/a&gt;\n\n------------not my rip----------\n\nFile Size (in bytes) ...: 876,627,968 bytes\nRuntime ................: 1:08:31\n\nVideo Codec ............: XviD ISO MPEG-4\nFrame Size .............: 640x480 (AR: 1.333)\nFPS ....................: 23.976\nVideo Bitrate ..........: 1616 kb/s\nBits per Pixel .........: 0.219 bpp\nB-VOP, N-VOP, QPel, GMC.: [], [], [], []\n\nAudio Codec ............: 0x0055 MPEG-1 Layer 3\nSample Rate ............: 48000 Hz\nAudio Bitrate ..........: 77 kb/s [1 channel(s)] VBR\nNo. of audio streams ...: 1\n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n  &lt;a href=&quot;\nhttps://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.org/index.php&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE ","torrent":{"xt":"urn:btih:bc18e8e089683bcf1c4e028ee2f27eb61e524708","amp;dn":"Roy+William+Neill+-+Black+Moon+%281934%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc18e8e089683bcf1c4e028ee2f27eb61e524708","infoHashBuffer":{"type":"Buffer","data":[188,24,232,224,137,104,59,207,28,78,2,142,226,242,126,182,30,82,71,8]},"announce":[],"urlList":[]}}