{"title":"Cause For Alarm! [1951] Loretta Young","uid":5722901,"size":322226740,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd2539ea622a2552cd9982910b746df2ca7f2686&amp;dn=Cause+For+Alarm%21+%5B1951%5D+Loretta+Young&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":10,"uploader":null,"files":4,"time":1280347105,"description":" &lt;a href=&quot;http://bayimg.com/GaNLBAACO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/GaNLBAACO&lt;/a&gt;\n\nCause for Alarm! (1951) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0043390/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0043390/&lt;/a&gt;\n\nCause for Alarm! (1951) is a film noir suspense film directed by Tay Garnett (The Postman Always Rings Twice), written by Mel Dinelli and Tom Lewis, based on a story by Larry Marcus. Ellen (Loretta Young) narrates the tale of &quot;the most terrifying day of my life&quot;, how she was taking care of her bedridden husband George Z. Jones (Barry Sullivan) when he suddenly dropped dead.\n\n\n Loretta Young ...  Ellen Jones \n Barry Sullivan ...  George Z. Jones \n Bruce Cowling ...  Dr. Ranney Grahame \n Margalo Gillmore ...  Mrs. Edwards \n Brad Morrow ...  Hoppy - Billy (as Bradley Mora) \n Irving Bacon ...  Mr. Carston - Postman \n Georgia Backus ...  Mrs. Warren \n Don Haggerty ...  Mr. Russell \n Art Baker ...  Superintendent \n Richard Anderson ...  Lonesome Sailor \n\n\nWhen the film was released in 1951, New York Times film critic Bosley Crowther, wrote, &quot;Here a simple situation is turned into a thoroughly chilling business by highlighting the most humdrum staples of the everyday American scene... Cause for Alarm proves more than anything else that superior writing, directing and acting- and some imagination- can make a little go a long way... The suspense, under Director Tay Garnett, mounts steadily, almost unbearably, until a final plot twist so original that it's almost a swindle.&quot;\n\nAlthough Crowther criticized the casting of &quot;newcomer&quot; Bruce Cowling as Ranney, calling his performance &quot;wooden&quot;, he had only praise for Young, writing &quot;...she does splendidly as the desperate housewife, avoiding all the pitfalls, even in her hysterical breakdown at the end.&quot;\n\nTime magazine characterized the film &quot;as the year's first thriller with an honest quota of thrills. It pulls off the old Hitchcock trick of giving commonplace people, events and settings a sinister meaning, and it develops its simple, one-track idea with frightening logic.&quot; Time's review also noted the strong supporting performances of Margalo Gillmore and Irving Bacon along with the film's &quot;quiet, sunny atmosphere of a pleasant residential street&quot; in Los Angeles.\n\nHowever, in later decades the film was widely ignored (falling into the public domain) and the few retrospective reviews were less flattering.\n\nFranÃƒÂ§ois Truffaut's short overview of Cause for Alarm! was kinder than many when he wrote, &quot;But all those effects hit home, perfectly timed, and isn't that what counts?&quot; 21st century reviews have tended towards Truffaut's take along with citing the film's suburban noir setting. Rotten Tomatoes notes, &quot;Taut pacing, fine performances, and a great plot make this a classic thriller.&quot;\n\nAllmovie also cites the performances of Gillmore and Bacon, along with describing the cinematography by Joseph Ruttenberg and score by AndrÃƒÂ© Previn as &quot;huge pluses.&quot; Sean Axmaker calls Cause for Alarm &quot;An unusual entry into the film noir school of paranoia&quot; which &quot;...trades the dark alleys and long shadows of urban menace for the sunny, tree-lined streets of middle-class domesticity&quot; whilst noting, &quot;Young's deadened narration adds an eerie mood of doom to the suburban setting.&quot;\n\nThe postman only had to ring once to throw Loretta Young into a panic in Cause for Alarm, a 1951 domestic noir directed by Tay Garnett, the man behind one of the all-time great films noirs, The Postman Always Rings Twice (1946). Made as the old Hollywood was dying to be replaced by the new world of television, the film pointed to Young's successful move into the infant medium.\n\nYoung was at a career crossroads in the early '50s. Although still under 40 and widely acclaimed for her performance as a nun in Come to the Stable (1949), she was having trouble finding suitable roles in the face of changing times. With Cause for Alarm, she took a chance on a smaller scale film combining the film noir genre with a form of dramatic realism currently on display in European films of the era. To play a housewife victimized by an invalid husband who's been driven mad by the wrong heart medication she did away with glamour makeup and wore dresses straight off the rack. Of course, small scale at MGM still meant the best of everything. The film was shot by Joseph Ruttenberg, who would win his fourth OscarÃ‚Â® for the Technicolor confection Gigi (1958) and scored by rising young composer Andre Previn, another four-time OscarÃ‚Â®-winner.\n\nThe story had originated as a radio play that, like the classic radio drama Sorry, Wrong Number, unfolded in real time as its leading lady tried to intercept a letter that wrongly but convincingly accused her of her husband's murder. The often-underrated Young had generated similar tension two years earlier in The Accused (1949), as a college professor trying to cover up a murder committed in self-defense but under suspicious circumstances. She was aided greatly in the current film by co-writer Mel Dinelli, who also had written the suspense classic The Spiral Staircase (1946), and Tay Garnett, a master at just about every genre he tackled. In addition to his film noir credentials, he had also triumphed with such noted female-oriented dramas as Her Man (1930), with Helen Twelvetrees; One Way Passage (1932), with Kay Francis; and Mrs. Parkington (1944), with Greer Garson.\n\nShot quickly and economically, Cause for Alarm anticipated Young's coming success in television, a medium she would enter with her series A Letter for Loretta in 1953. The anthology series would reaffirm the popularity she seemed to have lost on the big screen while also bringing her three Emmys for her performance in a variety of roles, some of the best as harried housewives living through unbearable tension in 30-minute episodes. \n\nCause for Alarm anticipated her television success in more than just style and compactness, however. Garnett would become a regular director on the series as he, too, moved into the new medium. Husband Tom Lewis, who also produced and co-wrote this film, would serve as writer and producer on the series. And supporting actor Bruce Cowling, cast here as the doctor with whom her husband thinks she's having an affair, would guest star on the series six times.\n\nCause for Alarm did well at the box office, as did many of MGM's low-budget thrillers of the period. But it wasn't enough to rejuvenate Young's film career. After only four more features -- including another strong feminist thriller, Paula (1952) -- she would retire from the screen in 1953, never to return.","torrent":{"xt":"urn:btih:bd2539ea622a2552cd9982910b746df2ca7f2686","amp;dn":"Cause+For+Alarm%21+%5B1951%5D+Loretta+Young","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2539ea622a2552cd9982910b746df2ca7f2686","infoHashBuffer":{"type":"Buffer","data":[189,37,57,234,98,42,37,82,205,153,130,145,11,116,109,242,202,127,38,134]},"announce":[],"urlList":[]}}