{"title":"Coast To Coast Am - 07-29-10 - Ufos &amp; Strange Lights","uid":5728639,"size":55730742,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:be20b9b4f8390a6f3a91c0b478c00312e96552cc&amp;dn=Coast+To+Coast+Am+-+07-29-10+-+Ufos+%26+Strange+Lights&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1280564725,"description":"Date:\n 07-29-10\n \nHost:\n George Noory\n \nGuests:\n Linda Moulton Howe, Peter Davenport \n \n\n\nInvestigative reporter Linda Moulton Howe presented new witness testimony in the Rendlesham Forest UFO case, and discussed anomalous lights photographed near crop circles, and an update on honey bee deaths. In a two-segment report, she interviewed Monroe Nevels, who worked as a Staff Sgt. for RAF Bentwaters Disaster Preparedness during the December 1980 UFO incident. &quot;I was told that an airman had been abducted by a spacecraft&quot; from Rendlesham forest, Nevels revealed, speaking on the record for the first time. He detailed his monitoring of low gamma radiation found in the forest soil tripod marks left by the UFO, and noted that trees within the circular radius of the craft were scorched. Nevels also described seeing lights that were like pencil-thin laser beams which could rapidly jump from one location to another. For more, see Earthfiles reports, Parts 1 &amp; 2. \n\nIn her update on honey bee deaths and Colony Collapse Disorder, she interviewed Jerry Hayes, with the Florida Dept. of Agriculture, who said that recent headlines suggesting cell phones were responsible for the honey bee problems were misguided and based on shoddy research. A more likely culprit is the strange fungus-like microorganism, Nosema cerenae, which destroys the gut lining of honey bee digestive tracts, he noted. Nicotine-based pesticides could also be weakening or stressing the bees. More here. \n\nIn her last report, she talked about yellow-orange lights photographed (see below) in the Guy's Cliffe, Warwickshire recent wheat formation, a formation that many investigators have called &quot;extraordinary.&quot; The images were taken by Andrew Pyrka, who described seeing three spheres of light that were &quot;almost like phosphorus burning at high intensity.&quot; Linda also shared details of another recent sighting of mysterious orange lights, this time at Knap Hill, in Wiltshire, UK, and discussed the UFO incident at Hangzhou, China. \n\nUFO Update\nFirst hour guest, Peter Davenport, the Director of the Natl. UFO Reporting Center, shared updates. There has been a cluster of dramatic sightings over the last seven weeks-- overt displays of &quot;multiple objects seen over populated areas and witnessed by many people. I don't believe I've seen a phenomenon like that since I started this job 16 years ago,&quot; he declared. He also talked about his proposal (PDF file) to use a passive radar system to detect UFOs in real time. \n\n\nWebsite(s):\n-earthfiles.com\n-ufocenter.com\nBook(s):\n-Mysterious Lights and Crop Circles\n-Glimpses of Other Realities, Volume 2","torrent":{"xt":"urn:btih:be20b9b4f8390a6f3a91c0b478c00312e96552cc","amp;dn":"Coast+To+Coast+Am+-+07-29-10+-+Ufos+%26+Strange+Lights","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be20b9b4f8390a6f3a91c0b478c00312e96552cc","infoHashBuffer":{"type":"Buffer","data":[190,32,185,180,248,57,10,111,58,145,192,180,120,192,3,18,233,101,82,204]},"announce":[],"urlList":[]}}