{"title":"Duran Duran - Save A Prayer  (2nafish)","uid":5716765,"size":222177284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:beb907b26e28dc78506a9fd68a906728e7b9479d&amp;dn=Duran+Duran+-+Save+A+Prayer++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280135853,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Save a Prayer&quot; is the sixth single by Duran Duran, released on 9 August 1982.\n\nThe song was the third single from the band's second album Rio. It became Duran Duran's biggest hit to date (at the time) in the UK Singles Chart, reaching #2, held out of the top spot by Survivor's &quot;Eye of the Tiger&quot;.\n\nIt was not originally issued as a single in the United States, although the video was very popular on MTV. However, a special US Single version with the live version from the Arena album on the flip side was released in January 1985. The single reached #16 on the Billboard Hot 100.\n\nThe video was filmed by director Russell Mulcahy among the jungles, beaches, and temples of Sri Lanka in April, 1982. Scenes were filmed atop the ancient rock fortress of Sigiriya, among the ruins of a Buddhist temple at Polonnaruwa and the island's southern coastline.\n\nA live version of the song was released in 1984. That night, Simon LeBon dedicated it to Marvin Gaye, who had been fatally shot the previous day. The video was taken from Duran Duran's Oakland, California concerts that were filmed for the Arena (An Absurd Notion).\n\nRio is the second album by Duran Duran, originally released worldwide on 10 May 1982, and re-released in the United States November that year. It reached #2 in the UK and #1 in Australia.\n\nThe album went Gold in the US on 1 March 1983, and Platinum on 26 April 1983, eventually reaching Double Platinum status. It peaked at number six on the Billboard 200 album chart in the US on 12 March 1983, and remained on the chart for 129 weeks.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:beb907b26e28dc78506a9fd68a906728e7b9479d","amp;dn":"Duran+Duran+-+Save+A+Prayer++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beb907b26e28dc78506a9fd68a906728e7b9479d","infoHashBuffer":{"type":"Buffer","data":[190,185,7,178,110,40,220,120,80,106,159,214,138,144,103,40,231,185,71,157]},"announce":[],"urlList":[]}}