{"title":"Unknown Soldier - Searching For A Father (2005) [HBOFILMS] [XviD","uid":5726955,"size":816756595,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bedb97eac8dbce83b2f47ecdd055fe9eda58a5a4&amp;dn=Unknown+Soldier+-+Searching+For+A+Father+%282005%29+%5BHBOFILMS%5D+%5BXviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1280448348,"description":"Ripped by bornloser-In memory of my brother David\nWACO-JAYCO PRODUCTIONS\n\n\n\n\nHBO Documentary Films \nUnknown Soldier: Searching for a Father (2005) \nDirector: John Hulme\nRelease Date: June 2005 (USA)\nGenre: Documentary\n[url]http://www.hbo.com/docs/programs/unknownsoldier/index.html[/url]\n\n\n\n\nVideo Information \nCodec:XVID\nResolution:640x480\nFrame rate:30\nAudio Information\nCodec:mpga\nChannels:Stereo\nSample rate:48000Hz\nBitrate:320kb/s\n\n\n\nUnknown Soldier: Searching for a Father -  HBO DOCUMENTARY FILMS\n\nThe roots of Unknown Soldier are in a little house in Pawtucket. Down the hall from the mural of the Virgin, we peer into a bedroom shrine to the hero, Jack Hulme, the All-American kid who grew up in this place and left to die in Vietnam.\nThe dark heart of the movie is a sudden silence from its brashest voice. The hero's Marine Corps comrade from Oklahoma is struck still by a question: What is it like to kill?\nThe story has moments of such piercing intimacy that we hardly notice as it catches hold of universal themes -- war and peace, love and loss, fathers and sons -- and soars.\nThe movie, subtitled Searching for a Father, is the pilgrimage of filmmaker John Hulme -- &quot;Jackie's boy,&quot; to the French Rhode Island side of his family, the people who lived in that house in Pawtucket -- from Pawtucket to Quang Tri and home again, in every sense of the word.Hulme has found a national television audience for his work on this Memorial Day, five years after he began his odyssey with the telephone call that opens the film.\n&quot;This is John Hulme,&quot; he tells an old Marine across the continent in San Jose.\n&quot;Oh, my gosh, I've been praying for this day for thirty years,&quot; comes the answer from Dennis Headapohl.\n&quot;He was only twenty-two when he died,&quot; the moviemaker said last week of his father, the family's golden boy, star athlete, natural leader, the born Marine to all who knew him in life. &quot;I'm now 13 years older, which is hard to believe.'\nSomehow, though, Jack Hulme was an empty space in the life of the son born three weeks before he was killed in a mortar attack, 36 years ago next month.\nDuring visits in his youth to stare at his father's name, his own name, on the wall of the Vietnam Memorial in Washington, D.C., &quot;my family would be with me and they would be crying and I would feel nothing,&quot; Hulme recalled.\nWhen he was quizzed about his father by the woman who was to become his wife, &quot;He didn't know anything!&quot; Jennifer Altman recalls in a moment of astonishment, early in the movie.\nThat exchange became a spur to the young moviemaker's decision to seek out his father, through his own craft. The movie was launched in earnest with that first call to one of his father's comrades-in-arms, and by Headapohl's welcome response.\nA succession of men tell us things about the war, on camera, that they had never confided to parents, wives or children. &quot;They felt duty-bound, because of my father, to talk about it to me,&quot; Hulme said after a screening of the movie last week in Washington.\nSome things, though, the men will not tell. John Soos, the bearded Oklahoman, gives the camera only a fraught, painful pause when Hulme ventures to broach the subject of killing.\n&quot;I don't know if I want to talk about that,&quot; he says at length.\nEvery bit as tender, if in a different way, is the approach that John Hulme, the son of &quot;a very Jewish family in New Jersey,&quot; takes to his father's people, &quot;a very Catholic family in Rhode Island.&quot;\nThe filmmaker grew up in Jersey with his mother, Ellen Hulme, and saw his father's family in Rhode Island but once or twice a year, he explained, so they were a loving but somewhat distant presence in his life.\nOne of the movie's digressive pleasures, therefore, is to be along for the ride as Hulme discovers new depths of love and complexity in &quot;Pa&quot; and &quot;Mamere,&quot; his aged Hulme grandparents, throwbacks to an ethnic Rhode Island mill town of long ago.\nBut the heartless engine of the story is, of course, the war. It always hits home with those who fought.\nAt the end of last week's screening, the director -- now the father of another Jack Hulme, 14 months old -- stood for questions from the crowd.\nLast to be recognized was Vince Longobardo, a sailor from Manhattan, N.Y., who fought in river patrol boats in the Mekong Delta &quot;like in Apocalypse Now,&quot; he later said.\n&quot;I don't have a question,&quot; said Longobardo, who attended the screening with his own grown son. &quot;But being a Vietnam vet,&quot; he told Hulme, &quot;I just wanted to thank you for making that film.&quot;\nHulme gets that a lot, as he travels to showings of his work. He has heard many times the kind of specific response that Longobardo voiced last week.\nOne reason for Longobardo's his gratitude, he explained, was that Hulme simply told his story. &quot;It didn't condemn the war. It didn't condone the war,&quot; Longobardo said.\nThe other thing about the film that moved him, the Navy vet said, was the force of a passage built around a classic artifact of the Vietnam War -- the tape recording from home.\nEllen Hulme's youthful voice, full of love and hope and fear, floats in and out of the story. She talks to Jack now about the baby she is carrying, now about the healthy new son, now about the reunion only weeks away -- mother, father and child, together in Pearl Harbor.\nThen comes the searing moment when Jack plays a tape of his infant son's voice for his buddy John Soos.\nWe see Soos in close-up today, the ruddy cheeks, the snow-white beard and swept-back hair. We hear Soos tell John Hulme, with a catch in his throat, what his father said at their base in Quang Tri that day in June 1969.\n&quot;He said, 'Soos! Did you hear my kid talking to you?' &quot;\nAll of this would be plenty of story for any two movies. But Hulme pushed further. He continued on to Vietnam, with his mother, and searched out the place where his father died, finding along the way their Vietnamese counterparts, a son and widow of a soldier who killed in the war with the Americans.\nHow strange and heartening, then, is the way that John Hulme carries his story full circle, on a flood of laughing faces. As he and his mother approach the scene of the raid that killed Jack Hulme, they are buoyed by joyous crowds of Vietnamese schoolchildren.\n&quot;The little kids were so excited,&quot; Ellen Hulme says near the close of the film, &quot;that they were going to lead us to the place we needed to go.&quot;\nJohn E. Mulligan is the Washington Bureau Chief of The Providence Journal. He can be reached by e-mail at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5b31362e3737323c3a351b393e3734763f387538343675&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nPost a message to John Hulme's biography page on projo.com's online memorial &quot;Vietnam Voices,&quot; and find more biographies of area troops who died in the Vietnam War, at:\n \n[url]http://projo.com/specials/vietnam/[/url]","torrent":{"xt":"urn:btih:bedb97eac8dbce83b2f47ecdd055fe9eda58a5a4","amp;dn":"Unknown+Soldier+-+Searching+For+A+Father+%282005%29+%5BHBOFILMS%5D+%5BXviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bedb97eac8dbce83b2f47ecdd055fe9eda58a5a4","infoHashBuffer":{"type":"Buffer","data":[190,219,151,234,200,219,206,131,178,244,126,205,208,85,254,158,218,88,165,164]},"announce":[],"urlList":[]}}