{"title":"70th Anniversary of World War II - Volumes 8,9,10,11,12,13 (2-Pa","uid":5884792,"size":5496677572,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf63259afcc1e27359b8427a0dbea501b383e3aa&amp;dn=70th+Anniversary+of+World+War+II+-+Volumes+8%2C9%2C10%2C11%2C12%2C13+%282-Pa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eljrago","files":6,"time":1287021877,"description":"Excellent collection of documentaries made by April in honor of the 70th anniversary of World War 2.\n70th Anniversary of World War II\n\n\n\n\n8. HITLER ATTACKS\nIN THE EAST\n\n* EUROPE ON ESPIONAGE AND FLAME RESISTANCE CONTROL\nAlthough Nazi Germany already controlled most of Western Europe,\nWinston Churchill did not make things easier for Hitler and demanded the formation of\nAssault forces that might attack the coasts of occupied Europe.\n\n\n\n* Operation Barbarossa, the Invasion SOVIET UNION.\nOdolf Hitler hated communism and believed that the abundant\nnatural resources controlled by the Soviet Union would be the ultimate prize\nthat the German people would be the dominant race. Without hesitation,\nplanned the attack on the Soviet Union.\n\n\n\n* The Escape From Colditz\nThe Germans considered impregnable, most within the prison of Colditz were\nSome of the elaborate escape plans most legendary of all time\n9. USSR\nDECISIVE MOMENT IN THE WAR\n\n* THE BATTLE OF MOSCOW\nIn June 1941, more than 300 Red Army soldiers were\nsurrounded to the west of Minsk, the panzer commanders requested permission\nthe Fuehrer to move faster ...\n\n\n\n* TO ADVANCE THE VOLGA\nIn autumn 1941, the Red Army found itself weakened by successive\nOffensive of the Germans. Fearing that the Japanese initiate an attack\nPreventive to occupy Siberia, Stalin kept a number\nconsiderable forces in the region.\n\n* MEN that sank the Bismarck\nIn April 1941, Admiral John Tovey Royal Navy located the Bismarck, the most powerful German battleship and began his pursuit.\n\n\n\n\n                                                10 RESPONSE OF EUROPE\n\n* Debacle at Stalingrad\nOn August 17, 1642, German General Friedrich Paulus\nIt began its offensive on Stalingrad. Six days\nlater the Panzer reached the Volga.\n\n\n* KURSK LARGEST BATTLE OF TANKS IN HISTORY\nAfter the success at Stalingrad, the commander of Soviet army,\nMarshal Zhukov, was aimed at the German Army Group A\nfound in the Caucasus. In December 1942,\nthe Soviets were already about 190 km from Rostov\n\n\n\n* THE ENEMY BEYOND BORDERS\nThe submarine war benefited from numerous innovations and the rapid\nGrowth of electronic technology, which enabled the ultimate victory.\n\n\n\n11. The EXUBERANT\nRED SUN\n\n* PEARL HARBOR: The Day of Infamy\nOn December 7, 1941, a stealth bombers, struck by\nAgainst the Japanese base at Pearl Harbor, forcing the president of the\nUnited States, Franklin D. Rooselvet to declare war on Japan\n\n\n* EASTERN BLITZKRIEG: THE CONQUEST OF MALAYSIA, Burma,\nTHE PHILIPPINES AND THE NETHERLANDS EAST INDIES\n\nWhile the United States recovered from the blow at Pearl Harbor,\nJapan launched new attacks in Southeast Asia\n\n* SECRET MISSION IN NORTH AFRICA\nIn 1942, there is a secret meeting of senior officials in the coast\nNorth Africa. His report was used by Dwight Eisenhower\nto save thousands of Britons and Americans.\n\n\n\n                                      12. MEMBER\nUNITED BASH BACK\n\n* THE BATTLE OF CORAL SEA OF AUSTRALIA REDUCING THE THREAT\nFour months after Pearl Harbor, the U.S. gave\nthe change to the Japanese several B-25 Mitchell bombers launched\nbombs on Tokyo, causing great destruction\n\n\n* THE BATTLE OF MIDWAY DECODING\nX AMERICAN NAVY IMPERIAL\nThe Japanese needed a quick victory for not\nsuccumb to superior North American\n\n\n* THE AIRCRAFT DOORS\nProtagonists in the war between Japan and the United States, the aircraft carrier\nwere targeted at Pearl Harbor, however, at the Battle of Midway, the Americans\ndestroyed a large number of Japanese battleships.\n\n\n13. PACIFIC\nTHE MEDITERRANEAN\n\n* THE LAST MOVES OF JAPAN, Guadalcanal and New Guinea\nin the summer of 1942, the Japanese strategists have put in\npractice a new idea, landing in northern New Guinea,\na division of troops experienced in fighting in the jungle\n\n\n* THE DISASTER Mussolini's Invasion of Greece, CRETE AND EGYPT\nWhile Adolf Hitler was successful in its advance on Western Europe,\nin the early summer of 1940, Benito Mussolini sought to expand its\nareas along the coast of the Mediterranean to North Africa\n\n\n\n* HUMAN TORPEDOES\nin 1941, the Italian Navy used mini-submarines operated by\nmen. The greatest success of this weapon was the attack against two battleships\nBritish at the port of Alexandria in December of that year.\n\n\n\n\nSize: 5.11 GB\nFormat: DVDRip\nResolution: 620x480\nLanguage: - English\nLegend Type: Flush\nLanguage (s) Subtitles - Portuguese - Brazil\nOriginal title: 70th Anniversary of World War II\nGenre: Documentary\nCountry of Origin: - Brazil\nYear: 2009\nDuration: 50min per episode\nProduction: April Colection.\n\nby: NEWAGE UpLoaderS","torrent":{"xt":"urn:btih:bf63259afcc1e27359b8427a0dbea501b383e3aa","amp;dn":"70th+Anniversary+of+World+War+II+-+Volumes+8%2C9%2C10%2C11%2C12%2C13+%282-Pa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf63259afcc1e27359b8427a0dbea501b383e3aa","infoHashBuffer":{"type":"Buffer","data":[191,99,37,154,252,193,226,115,89,184,66,122,13,190,165,1,179,131,227,170]},"announce":[],"urlList":[]}}