{"title":"Bigasoft iPhone Video Convertor v2.0.full.aaaevilacharya","uid":5826053,"size":7899998,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bf91db6dabd1db42fcc36c6f5bbdea4ee6a351ee&amp;dn=Bigasoft+iPhone+Video+Convertor+v2.0.full.aaaevilacharya&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"achaevil","files":3,"time":1284285768,"description":"Bigasoft iPhone Video Converter is the Best Video Converter software that created \nto help you convert video to popular formats such as: MP4, H.264, MP3,\nDivX, MOV, M4A, AAC, WAV, etc with high speed and excellent sound/image quality. \nIn addition, the Best Video Converter can also extract audio from video file and \nconvert them to M4A, MP3, AC3, AAC, WAV as you want. The iPhone Video Converter \nsupports almost all popular portable devices such as iPhone, iPhone etc.\nAll conversions are very easy and fast with the best quality.\nBigasoft iPhone Video Converter is also multifunctional video editor software comprising\nfunctions of Video Joiner, Video Cutter and Video Cropper. Using this Best Video Converter\nsoftware, you can accomplish almost all common video editing works with excellent image\nquality output. For example,\nthis video converter can help you join multiple video files into a new one, cut one file \ninto several segments easily and fast.\n\nKey Features:\n\nVideo Joiner\nBigasoft iPhone Video Converter software provides an easy way to combine and join multiple\nvideos together with most video formats supported, such as AVI, MPEG, WMV, MP4, DivX, MOV,\n3GP, ASF, etc. Just select the videos you want to join and check the &quot;merge into one file&quot;\ncheck box you can finish it easily.\n\nVideo Cutter\nBigasoft iPhone Video Converter software provides &quot;Trim&quot; function to help you cut a clip from\nthe original video. You can set the &quot;Start Time&quot; and &quot;End Time&quot; of the clip you want to get or\njust drag the slide bar to the accurate position to achieve it.\n\nVideo Crop\nBigasoft iPhone Video Converter software allows you to remove black edge of your movie and get \nany playing area of the video by using its &quot;Crop&quot; function. You can also select the &quot;Zoom&quot; mode\nto extrude your video slightly to adjust to your portable devices so you can get the best video\nquality.\n\nCapture Your Favorite Image\nIf you like the current image of the video you can use the &quot;Snapshot&quot; option. Just click the \n&quot;Snapshot&quot; button the image will be saved and you can click the &quot;Open&quot; button next to &quot;Snapshot&quot;\nbutton to open your picture. \n\nSupport Preview\nYou can preview the source video and edited video. \n\nEasy-to-use\nA few clicks are all you need to do to convert your video. \n\nAll Encoders and Decoders Are Built in\nFully support all popular video and audio formats. \n\nFastest Conversion Speed\nProvide the fastest conversion speed, completely support dual core CPU.\n","torrent":{"xt":"urn:btih:bf91db6dabd1db42fcc36c6f5bbdea4ee6a351ee","amp;dn":"Bigasoft+iPhone+Video+Convertor+v2.0.full.aaaevilacharya","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf91db6dabd1db42fcc36c6f5bbdea4ee6a351ee","infoHashBuffer":{"type":"Buffer","data":[191,145,219,109,171,209,219,66,252,195,108,111,91,189,234,78,230,163,81,238]},"announce":[],"urlList":[]}}