{"title":"Democracy Now - 04 aug 2010","uid":5739280,"size":453728329,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c07eda665ccbfa351fe7436635b9adda471da4bf&amp;dn=Democracy+Now+-+04+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1280939441,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 4, 2010\n\n- BP Claims Progress in Sealing Well\n- Worker Kills 8, Self at Conn. Warehouse\n- Senate Opens Debate on Kagan Nomination\n- Groups File Suit over Assassinations List\n- Toll from Pakistan Flooding Tops 1,500\n- 17 Killed in Iraq Attacks\n- New York Clears Ground Zero Mosque Plan\n- US Envoy to Attend Hiroshima Memorial for 1st Time\n- Senate Delays Vote on Ratifying Russia Nuke Treaty\n- Pentagon Denies Embed Request to Reporter Behind McChrystal Story\n- Judge to Rule on California Gay Marriage Ban\n- Activist Marilyn Buck Dies at 62\n\n\nSpecial reports\n\n- &quot;I Have No Regret to Anybody in the Military. This is Clearly a Failure of Our Government&quot;-Iraq War Vet Dan Choi Discharged Under Don't Ask Don't Tell\n\n&quot;As we mark the end of America's combat mission in Iraq,&quot; President Barack Obama said this week, &quot;a grateful America must pay tribute to all who served there.&quot; He should have added &quot;unless you're gay,&quot; because, despite his rhetoric, weeks earlier the commander in chief fired one of those Iraq vets: Lt. Dan Choi. Choi is a West Point graduate, an Arabic linguist and an Iraq war veteran. He was fired under the military's Don't Ask Don't Tell policy. We talk to him about his life, his coming out and his military service.\n\n\n- Environmental Activist Jerry Cope on &quot;The Crime of the Century: What BP and U.S. Government Don't Want You to Know&quot;\n\nEnvironmental activist Jerry Cope has spent the last few weeks traveling along the Gulf Coast and experiencing first-hand the contamination in the air and water. In an article being published on Huffington Post, Cope argues that instead of celebrating the allegedly vanishing oil, we should be concerned about the disappearance of marine life in the Gulf. He describes the Gulf as a &quot;kill zone&quot; and looks into where the marine animals have gone given that BP has reported a relatively low number of dead animals from the spill.\n\n\n- Antonia Juhasz: BP's &quot;Missing Oil&quot; Washes up in St. Mary's Parish, LA\n\nWe speak with independent journalist Anotnia Juhasz who is just back from Louisiana where she found what she calls some of BP's &quot;missing oil&quot;-on the wetlands and beaches along the waterways near St. Mary's Parish, where no one is booming, cleaning, skimming, or watching.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c07eda665ccbfa351fe7436635b9adda471da4bf","amp;dn":"Democracy+Now+-+04+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c07eda665ccbfa351fe7436635b9adda471da4bf","infoHashBuffer":{"type":"Buffer","data":[192,126,218,102,92,203,250,53,31,231,67,102,53,185,173,218,71,29,164,191]},"announce":[],"urlList":[]}}