{"title":"20th Century Vampire - S01 - Audio Comedy - MP3 - Slimoo","uid":5887034,"size":162745003,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c1385abae5f5898790b90c6e5ac5433cfedda766&amp;dn=20th+Century+Vampire+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"_Slimoo_","files":6,"time":1287093806,"description":"20th Century Vampire - S01 - Audio Comedy - BBC Radio 7 \n6 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\n20th Century Vampire is a radio situation comedy series written by Joe Turner. It was originally broadcast in six episodes on BBC Radio in 1993. It is repeated from time to time on the digital channel BBC 7 and on the BBC Website.\n\n\n\nPlot\n\nEloise (Louise Lombard) works at the Co-op supermarket in a town in the North of England. She feels different from the people around her, dresses in black, and is unhappy much of the time, as if some piece of her life is missing. Then her mysterious Transylvanian Aunt Lucretia (Joanna Kanska) reveals that she is really a vampire, a hereditary condition, and she must enter training to fulfill her destiny. Eloise eventually embraces her fate, but has to deal with her boyfriend Wayne, played by William Ivory, and her equally mystified co-workers at the store, including flatmate and best friend Debbie (Jane Hazelgrove). She is horrified to find herself back in &quot;school&quot;, with Lucretia as the teacher, even to the extent of sitting for three hour examination papers. Having been a miserable failure at exams in school despite her intelligence, she is convinced she will fail yet again. However, the exams have a &quot;practical section&quot; which saves her grade.\n\nLater she wants to tell Wayne and others about herself, but Lucretia convinces her to test them first by telling each a different, fictitious but shocking &quot;secret&quot; about herself, making them promise not to tell anyone else, to see if they can in fact keep her confidence. So Wayne learns that she was once jailed for stealing, Debbie is told that she is pregnant, and she tells her boss Mr. Jenkins that she is secretly in love with him. With some nudging from Lucretia, hilarious consequences ensue.\n\n\n\nCast;\nEloise - Louise Lombard\nLucretia - Joanna Kanska\nWayne - William Ivory\nDebbie - Jane Hazelgrove\nMr. Jenkins - Fine Time Fontayne\n\nwritten by Joe Turner\n\n\n\n20th Century Vampire - S01 - E01 - I Am A Vampire\n20th Century Vampire - S01 - E02 - Back To School\n20th Century Vampire - S01 - E03 - The Biggest Secret\n20th Century Vampire - S01 - E04 - Staff Outing\n20th Century Vampire - S01 - E05 - Endangered Species\n20th Century Vampire - S01 - E06 - Love Shack\n\n\n\nAudio Format : MP3\nDuration Approx : 28mn 00s\nBit rate mode : Constant\nBit rate : 128 Kbps \nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits","torrent":{"xt":"urn:btih:c1385abae5f5898790b90c6e5ac5433cfedda766","amp;dn":"20th+Century+Vampire+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1385abae5f5898790b90c6e5ac5433cfedda766","infoHashBuffer":{"type":"Buffer","data":[193,56,90,186,229,245,137,135,144,185,12,110,90,197,67,60,254,221,167,102]},"announce":[],"urlList":[]}}