{"title":"Flo Rida feat. David Guetta - Club Can't Handle Me (2nafish)","uid":5831978,"size":172232708,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c1570a635a00f6522797e83f02b8154144b5d186&amp;dn=Flo+Rida+feat.+David+Guetta+-+Club+Can%5C%27t+Handle+Me+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284551086,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo.\n\n\n&quot;Club Can't Handle Me&quot; is a song by American rapper Flo Rida featuring French disc jockey David Guetta. It was released as a digital download on iTunes on June 28, 2010 as the lead single of the Step Up 3D soundtrack album and is also planned to be included on Flo Rida's third studio album, The Only One. The song topped the charts in Ireland and the United Kingdom, and became a top five hit in Australia, New Zealand, Canada, Germany, Belgium (Flanders) and Finland. The music video was filmed in Los Angeles and directed by Marc Klasfeld.\n\nThe music video for &quot;Club Can't Handle Me&quot; was directed by Marc Klasfeld and filmed in Los Angeles. It premiered E! channel's &quot;Daily 10&quot; segment on 16 July. On the same day, it was also uploaded on Flo Rida's officialaccount. The video is taking place during an &quot;opulent, extravagant club party&quot;, where Flo Rida raps in front of a crowd, while David Guetta is a DJ. It also features scenes taken from the Step Up 3D  film. Flo Rida said of the video: &quot;If you've ever dreamed about having the biggest party of your life, &quot;Club Can't Handle Me&quot; definitely represents that. Lotta energy. Lot of diamonds, ice sculptures. Just showing that boss vibe.&quot;\n\nNick Levine of Digital Spy  gave the song four stars out of five writing, &quot;'Club Can't Handle Me' is a whopping great party banger - perhaps Guetta's straight up funnest [sic] production since 'I Gotta Feeling'. Of course, Flo's lyrics are a parade of insane nonsense, as is the very conceit behind the song.&quot; A reviewer from Billboard  gave the song a positive review, calling the song &quot;infectious&quot;, and stating, &quot;Guetta provides an escalating beat-not unlike the one for the Black Eyed Peas' &quot;I Gotta Feeling&quot;-while Flo Rida delivers the sort of dependable party lyrics that put him on the map.&quot;\n\n&quot;Club Can't Handle Me&quot; was written by Flo Rida, Carmen Key, Kasia Livingston, Mike Caren, David Guetta and Giorgio Tuinfort. David Guetta was originally approached by Flo Rida's recording company, which asked whether Guetta would agree to produce songs for the rapper. The DJ, who often played Flo Rida's &quot;Low&quot; alongside &quot;Love Is Gone&quot; (his own collaboration with Chris Willis) when working in clubs, agreed. Flo Rida, who described the song as a &quot;club anthem&quot;, said he always looked up to Guetta and that they both appreciated each others' earlier works.\n\n&quot;Club Can't Handle Me&quot; first premiered on Flo Rida's official website on 9 June 2010. On 28 June, the song became available to download on iTunes.\n\nThe song promotes the Step Up 3D film, and is the lead single of its soundtrack.\n\nStep Up 3D is the film soundtrack album from the motion picture Step Up 3D. The album was released on 27 July 2010. The first single from the album is &quot;Club Can't Handle Me&quot; by Flo Rida featuring David Guetta.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c1570a635a00f6522797e83f02b8154144b5d186","amp;dn":"Flo+Rida+feat.+David+Guetta+-+Club+Can%5C%27t+Handle+Me+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1570a635a00f6522797e83f02b8154144b5d186","infoHashBuffer":{"type":"Buffer","data":[193,87,10,99,90,0,246,82,39,151,232,63,2,184,21,65,68,181,209,134]},"announce":[],"urlList":[]}}