{"title":"Tom McRae...Just Like Blood(2003)[FLAC]","uid":5753463,"size":242313292,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c17717ca7afe25ae2fee59aaaacd064165dd54ac&amp;dn=Tom+McRae...Just+Like+Blood%282003%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":15,"time":1281478365,"description":"2003 Just Like Blood    CD  DB 74321 983512 \n\n1 A Day Like Today  3:48 \n2 You Only Disappear  3:44 \n3 Ghost of a Shark  3:24 \n4 Stronger Than Dirt  4:39 \n5 Overthrown  3:54 \n6 Walking 2 Hawaii  4:25 \n7 Mermaid Blues  4:54 \n8 Karaoke Soul  3:49 \n9 Line of Fire  4:39 \n10 Human Remains  4:05 \n\nI'm usually pretty wary of the 'singer/songwriter' tag. In recent times it's stapled to an assortment of barely flickering lights rarely able to write anything original. In the past, greats like Dylan and Joni Mitchell never called themselves singer/songwriters, they just were. However, Tom McRae's second album is a big and beautiful record from the real McCoy; a David Gray with colour.\n\nTen passionately powerful, yet comfortingly mellow tracks all stand up in their own right. Most of the songs are filled with melancholy and relationship-breakdown despair, but McRae retains a powerful sense of self-determination. He offers hope and strength without any whiff of triteness.\n\nFollowing on from his stark debut album, this record reflects a move into the studio for McRae. His bittersweet lyrics and guitar remain, but now his songs are backed up by a rich variety of sounds serving to heighten rather than dilute the power of his soulful voice.\n\nThe imaginative instrumentation is revealed immediately in the opening &quot;A Day Like Today&quot;. The sampled African intro is retained throughout the track to give a lulled percussive balance to the big orchestral strings. In contrast the use of slide guitar and airy organ give a real Deep South feel to the beautiful &quot;Ghost of a Shark&quot;.\n\nThe use of strings to reflect emotion is retained throughout the album. In &quot;Stronger Than Dirt&quot; the cello combines with sitar and banjo to give a stormy folky feel. But in the rockier and chaotic &quot;Karaoke Soul&quot; the eastern-style strings combine with the sardonic lyrics to add a quirky edge.\n\nJust Like Blood journeys through the sinister ballad; &quot;Line of Fire&quot;, the mysterious, heartbreaking lament of &quot;Mermaid Blues&quot; and the dreamy &quot;Overthrown&quot;. Then finally, the album ends grandly with the distinct Mercury Rev-like melancholy of &quot;Human Remains&quot;. Despite the emotional turmoil McRae retains a self belief and concludes with a last line suggesting hopeful uncertainty rather than abject despair; 'The picture is burned at the edge and you're looking away looking for whats next, tell me whats next ?...'\n\ncd ripped by dBpoweramp\n\nplease seed\n","torrent":{"xt":"urn:btih:c17717ca7afe25ae2fee59aaaacd064165dd54ac","amp;dn":"Tom+McRae...Just+Like+Blood%282003%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c17717ca7afe25ae2fee59aaaacd064165dd54ac","infoHashBuffer":{"type":"Buffer","data":[193,119,23,202,122,254,37,174,47,238,89,170,170,205,6,65,101,221,84,172]},"announce":[],"urlList":[]}}