{"title":"Alex Jones Moneybomb Marathon - 2010 Oct 14-15 last 3 Hrs [sebay","uid":5889475,"size":69534857,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c1bed368eaa2109fe23ec89d7c3229f5c8af46f9&amp;dn=Alex+Jones+Moneybomb+Marathon+-+2010+Oct+14-15+last+3+Hrs+%5Bsebay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":8,"time":1287182777,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nWednesday - Thursday, \n14-15 October 2010\n\n\n[sebaygo1]\n\n\nThis is the final 3 hours of Alex's 27 hour marathon broadcast, supporting his MoneyBomb fundraising drive.\n\nAlex hosts the 11:00 hour today and the beginning of the next before handing off to Paul Joseph Watson.\n\nBob Chapman, founder and publisher of the financial newsletter &quot;The International Forecaster&quot; joins Watson in the last hour.\n\n..\nCourtesy of RW [supporter of the sebaygo1 blog, Information Wants To Be Free] included in this torrent is the most recent issue of that newsletter [Wed., 13 Oct. 2010] in both .pdf and .rtf file formats..\n..\n\n\n\nThe Infowars web site gives this description for the 27-hour broadcast as a whole ::\n\nJoin Alex and crew today for the Infowars Moneybomb, a 27 hour marathon to raise the money Alex needs to take his operation to the next level. Alex is not backed by the corporate media and the foundations, so his continued success relies on your support. Please make a donation on the Infowars Moneybomb page. The show today will be a jam-packed blockbuster featuring on our free video stream never before seen interviews with Paul Craig Roberts, Katherine Austin Fitts, Lord Christopher Monckton, Sherri Tenpenny, Jeffrey Smith, Rev. Clenard Childress, Alan Watt, and others. In addition, the marathon show will feature a number of live guests, including Max Keiser, Gerald Celente, Webster Tarpley, and Paul Craig Roberts. You won't want to miss the show today.\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........","torrent":{"xt":"urn:btih:c1bed368eaa2109fe23ec89d7c3229f5c8af46f9","amp;dn":"Alex+Jones+Moneybomb+Marathon+-+2010+Oct+14-15+last+3+Hrs+%5Bsebay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1bed368eaa2109fe23ec89d7c3229f5c8af46f9","infoHashBuffer":{"type":"Buffer","data":[193,190,211,104,234,162,16,159,226,62,200,157,124,50,41,245,200,175,70,249]},"announce":[],"urlList":[]}}