{"title":"AVS Audio Converter v6.2.1.441","uid":5886133,"size":38648011,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c205a1688f4482bf84ccf15bb84e39dae04285c9&amp;dn=AVS+Audio+Converter+v6.2.1.441&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":1,"time":1287015039,"description":"                   AVS Audio Converter v6.2.1.441\n\n\n Convert between most known audio file types - MP3, WAV, WMA, M4A, FLAC, PCM, OGG, AAC, AMR and others. Create ringtones, use batch mode, apply effects and custom parameters\n\n\nFeatures OverviewScreenshots \n\n \n\n  All key formats are supported \nRead: MP3, MPEG3, WMA, WAV, M4A, M4B, M4R, AAC, AMR, AWB, OGG, MP1, AC3, MP2, FLAC, AIFF, AIF, AIFC, AU, VOX, MPC, MP+, MKA, RAW, PCM, GSM, AVI, IVF, DIV, DIVX, MTV, AMV, MPG, MPEG, MOD, MPE, MVV, M2V, WMV, ASF, DVR-MS, DAT, IFO, VOB, VRO, M2TS, M2T, MTS, TOD, TS, TP, DV, MKV, OGM, OGV, OGA, OGX, RM, RMVB, RAM, IVR, MOV, QT, M4V, MP4, 3GP2, 3GPP, 3GP, 3G2, FLV, SWF \n\nWrite: MP3, WMA, WAV, M4A, M4B, M4R, AAC, AMR, AWB, OGG, MP2, FLAC \n  Convert Between All Key Audio Formats \nMP3, WMA, WAV, M4A, AMR, OGG, MP2, FLAC and other formats. See a full list of supported audio formats \n\nMicrosoft Windows 7 Support\nAVS Audio Converter is compatible with the latest version of Microsoft Windows. \n\nReduce Conversion Time \nUse the Batch mode and convert several audio files at one go. \n\nExport Audio from Video \nSelect and convert audio from your video files. DVD, MPEG, MP4, AVI, DIVX, MOV, WMV, VOB, 3GP, RM, QT, FLV and others are supported. See a full list of supported video formats \n\nConvert M4B Format \nConvert your audio tracks to popular M4B format, divide them into chapters and add bookmarks. Prepare audio files for your iPod/iPhone. \n\nSet Custom Parameters \nSpecify frequency, number of channels, bitrate and other parameters of output files before conversion. \n\nApply Advanced Fine Tuning \nSet up advanced parameters for MP3 and OGG formats. \n\nEdit Audio Fast \nTrim, mix, delete parts, apply effects. Modify extra text information in audio files. \n\nCreate Ringtone for iPhone \nEdit an audio file and save it to M4R format for iPhone. \n\nMultilingual Support \nAVS Audio Converter interface and tech-support are available in English, French, German, Spanish, Italian, Japanese and Dutch. \n\n","torrent":{"xt":"urn:btih:c205a1688f4482bf84ccf15bb84e39dae04285c9","amp;dn":"AVS+Audio+Converter+v6.2.1.441","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c205a1688f4482bf84ccf15bb84e39dae04285c9","infoHashBuffer":{"type":"Buffer","data":[194,5,161,104,143,68,130,191,132,204,241,91,184,78,57,218,224,66,133,201]},"announce":[],"urlList":[]}}