{"title":"Ozzy Osbourne - I Just Want You (2nafish)","uid":5733842,"size":166082564,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c2a61e65ccba853ba908ede6fca1c3ebb32a531b&amp;dn=Ozzy+Osbourne+-+I+Just+Want+You+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1280746422,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nOzzmosis is the seventh studio album by English heavy metal musician Ozzy Osbourne. Released on 24 October 1995, the album reached number 22 on the UK Albums Chart and number four on the American Billboard 200 albums chart. Ozzmosis  was reissued on 25 June 2002 with the addition of the previously unreleased tracks &quot;Whole World's Fallin' Down&quot; and &quot;Aimee&quot;, the latter of which was named after Osbourne's oldest daughter.\n\nRecord producer Michael Wagener, who worked on Osbourne's 1991 sixth studio album No More Tears, was initially chosen by Epic Records to produce Ozzmosis, though was later replaced with Michael Beinhorn, Zakk Wylde, Mike Inez, James Lomenzo, and Randy Castillo were all brought in for the recording sessions.\n\nSometime after the sessions with Wagener, Inez and Castillo were replaced with Osbourne's former Black Sabbath band mate, Geezer Butler (who had recently left Black Sabbath after a major falling out with Tony Iommi) and Deen Castronovo (currently with Journey). Yes keyboardist Rick Wakeman was also brought in as a session musician for the recording of the album.\n\nFor the subsequent &quot;Retirement Sucks Tour,&quot; however, the band included guitarist Joe Holmes and bassist Robert Trujillo.\n\nThe Essential Ozzy Osbourne is a compilation album by Ozzy Osbourne, released in 2003. It reached #81 on US charts and #21 in the UK. Tracks featured here from the first two albums are the re-recorded versions from recent reissues as well as the remixed Bark At The Moon tracks. The album was certified Gold by the RIAA on February 5, 2005.\n\nJohn Michael &quot;Ozzy&quot; Osbourne (born 3 December 1948) is an English singer-songwriter whose career has spanned five decades.\n\nOsbourne initially rose to prominence as lead vocalist of the pioneering English heavy metal band Black Sabbath, a band whose radically different, intentionally dark, doom sound spearheaded the heavy metal genre. In his subsequent solo career Osbourne achieved a multi-platinum status in addition to the one he had earned with Black Sabbath. These things are what led Osbourne to become known as the &quot;Godfather of Heavy Metal&quot;. Osbourne is ranked 8th on Hit Parader's list of the 100 Greatest Heavy Metal Vocalists of all time. It was during his Sabbath days (because of their dark style of music, not because he was a satanist) that Osbourne became known as the &quot;Prince of Darkness.&quot; Osbourne has over 15 tattoos, the most famous of which are the letters O-Z-Z-Y across the knuckles of his left hand. This was his first tattoo, created himself with a sewing needle and pencil lead.\n\nIn the early 2000s, Osbourne's career expanded to a new medium when he became a star in his own reality show, The Osbournes, alongside wife/manager Sharon and two of their three children, Kelly and Jack.\n\nOsbourne is currently on a worldwide tour to promote his new album Scream, released on 22 June 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c2a61e65ccba853ba908ede6fca1c3ebb32a531b","amp;dn":"Ozzy+Osbourne+-+I+Just+Want+You+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a61e65ccba853ba908ede6fca1c3ebb32a531b","infoHashBuffer":{"type":"Buffer","data":[194,166,30,101,204,186,133,59,169,8,237,230,252,161,195,235,179,42,83,27]},"announce":[],"urlList":[]}}