{"title":"Helix - Heavy Metal Love (2nafish)","uid":5882511,"size":106119172,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c3399adf125b8640aa29d88e942019fc1c3695a0&amp;dn=Helix+-+Heavy+Metal+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1286880458,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNo Rest for the Wicked is the third studio album by the Canadian rock band Helix. It is also their major label debut, on Capitol Records.\n\nHelix are a Canadian hard rock/heavy metal band. They formed in 1974, and are best known for their 1984 single &quot;Rock You&quot;. The original lineup was formed by drummer Bruce Arnold, and consisted of lead vocalist Brian Vollmer, guitarists Ron Watson and Rick &quot;Minstrel&quot; Trembley, keyboardist Don Simmons, and bassist Keith &quot;Bert&quot; Zurbrigg. Their most well known lineup, however, and the one that recorded &quot;Rock You&quot;, was the 80's version of the band: Vollmer on vocals, accompanied by guitarists Brent &quot;The Doctor&quot; Doerner and Paul Hackman, bassist Daryl Gray, and drummer Greg &quot;Fritz&quot; Hinz. The history of the band has been marked by many lineup changes, with Vollmer being the sole constant member and only remaining member of the original lineup. Although guitarist Paul Hackman was killed in a tour bus accident in 1992, the surviving members of the 80's lineup reunited in 2009 for an album and continue to tour in 2010.\n\nHelix have toured with bands such as Kiss, Aerosmith, Rush, MÃƒÂ¶tley CrÃƒÂ¼e, Alice Cooper, Whitesnake, Night Ranger, Heart, Quiet Riot, W.A.S.P., Ian Gillan, and MotÃƒÂ¶rhead among others.\n\nTheir most recent studio album is 2009's Vagabond Bones.\n\nChanging their image from that of a standard bar band to a more image-conscious metal band, Helix finally signed to Capitol Records after being rejected by them three times. In 1983 they released No Rest for the Wicked, with Greg &quot;Fritz&quot; Hinz (ex-Starchild) on drums. This album featured Canadian hit video  &quot;Heavy Metal Love&quot;, which featured their new look. Under Seip's advice, Helix dropped their T-shirts and jeans in favour of leather clothing in order to stay current. The tour for this album cycle was not without drama. Mike Uzelac, whose drug use had become problematic, left the band to be replaced by a bass player named Peter Guy from London, Ontario. Guy was unable to travel to the United States due to a previous drug conviction, and Uzelac came back to finish the tour. When Uzelac had fulfilled his commitment, Mark Rector of Kitchener was hired on bass. He was let go at the conclusion of the tour. With the addition of bassist Daryl Gray completing the band's classic 80's lineup, they released Walkin' the Razor's Edge  in 1984. It sold over 100,000 copies in Canada, and over 400,000 internationally. The album also included their best known song &quot;Rock You&quot; and a cover of A Foot in Coldwater's &quot;(Make Me Do) Anything You Want&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c3399adf125b8640aa29d88e942019fc1c3695a0","amp;dn":"Helix+-+Heavy+Metal+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3399adf125b8640aa29d88e942019fc1c3695a0","infoHashBuffer":{"type":"Buffer","data":[195,57,154,223,18,91,134,64,170,41,216,142,148,32,25,252,28,54,149,160]},"announce":[],"urlList":[]}}