{"title":"Dionne Warwick - Hank Ballard - Lyn Collins - Vicki Anderson (32","uid":5750585,"size":388675732,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c33c4d8975c6bcf4e4731bdecf0480fdf997d3c2&amp;dn=Dionne+Warwick+-+Hank+Ballard+-+Lyn+Collins+-+Vicki+Anderson+%2832&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dankencity","files":47,"time":1281377573,"description":"4 classic albums w/ artwork in 320kbps.\nenjoy.\n\n[b]Dionne Warwick - Just Being Myself\n[/b]1.\tYou're Gonna Need Me\n2.\tI Think You Need Love\t\n3.\tYou Are the Heart of Me\t\n4.\tI Always Get Caught in the Rain  \t\n5.\tDon't Let My Teardrops Bother You  \t\n6.\t(I'm) Just Being Myself\t\n7.\tCome Back\t\n8.\tDon't Burn the Bridge (That Took You Across)\n\nDionne Warwick (on the album's cover her last name is spelled with an 'e' at the end) signed with Warner Brothers in the early '70s, and her second album for the label finds her continuing to experiment with blending R&amp;B, pop, and easy-listening arrangements. The champion soul music songwriting team of Holland-Dozier-Holland wrote most of the material here, and they also assume production duties. Warwick's sophisticated delivery and warm, relaxed timbre are in top form, and the string-sweetened arrangements make this one a good bet for fans of Philly soul and quiet storm R&amp;B.\n\nRecording information: Holland-Dozier-Halland Sound Studios, Inc, Detroit, MI (08/03/1972-08/05/1972).\n\n[b]Hank Ballard - You Can't Keep A Good Man Down\n[/b]1.\tHow You Gonna Get Respect, Pt. 1\t\n2.\tTeardrops on Your Letter\t\n3.\tYou're So Sexy\t\n4.\tFunky Soul Train\t\n5.\tSlip Away\t\n6.\tWhich Way Should I Turn\t\n7.\tWith Your Sweet Lovin' Self\t\n8.\tAre You Lonely for Me Baby\t\n9.\tThrill on the Hill\t\n10.\tWoman Is a Man's Best Friend\t\n11.\tUnwind Yourself\t\n12.\tCome in Wit It\t\n13.\tButter Your Popcorn\t\n14.\tBlackenized\t\n15.\tHow You Gonna Get Respect, Pt. 1\t\n16.\tAnnie Had a Baby\t\n17.\tFinger Poppin Time\t\n18.\tFrom the Love Side\n\nHank Ballard achieved great success in the mid 1950's firstly with the Royals and then with the Midnighters with whom he topped the R&amp;B charts with songs like 'Work With Me Annie' (the biggest selling R&amp;B track in 1954 selling over a million copies)and 'Annie Had A Baby'. He wrote and originally recorded 'The Twist' in 1959, but it was Chubby Checker who had the big hit with it a year later. By the late 60's the Midnighters run out hits had finished and Hank joined his long time friend and label mate James Brown. James produced Hank's 'You Cant Keep A Good Man' album for King in 1968, and the funkier tracks have Brown's sound stamped all over them. 'How You Gonna Get Respect' featuring instrumentation from the Dapps has a very similar backing track to 'Lickin Stick'. 'Unwind Yourself' was also recorded by Marva Whitney and 'Funky Soul Train by Bobby Byrd, 'Come On Wit' It' and 'With Your Sweet Lovin Self' are classic late 60's Brown grooves. Of the bonus tracks 'Blackenized' has a great jazzy groove and the black consciousness lyrics that James was writing at the time, after his big hit 'Say it Loud'. 'Butter Your Popcorn' is another great JB funky track. After King folded Hank recorded a couple of sides for James' People label funky re-incarnations of his 50's/60's hits 'Annie Had A baby' and 'Finger Poppin Time' and then his classic 'From The Love Side' for Polydor in 1972.which was based on the rhythm track of Marva Whitney's earlier 'I Made A Mistake'. The specially adapted limited edition vinyl version concentrates on the funkier tracks from the album plus the non album singles, making it a James Brown produced funk bomb. This album has been in demand for many years and the original vinyl LP is extremely rare, in fact one of the rarest of all the James Brown Productions. We are delighted to be able to present it in our classic album series re mastered from the original tapes. The late 60's funk sound is particuarly in vogue at the moment with Sharon Jones and Mark Ronson recent albums selling very well. This release will be well received by James Brown and Funk fans throughout the world and we expect good press and airplay. Soul Brothers.\n\nProduced by James Brown in an attempt to resuscitate Hank Ballard's waning commercial fortunes, You Can't Keep a Good Man Down remains a minor soul classic -- Brown's admiration for Ballard galvanizes each and every groove, and his inimitably funky arrangements fit the singer's gritty vocals like a glove. While &quot;Thrill on the Hill&quot; and &quot;Woman Is Man's Best Friend&quot; nod to the muscular R&amp;B of Ballard's early hits with the Midnighters, You Can't Keep a Good Man Down primarily serves to establish his credentials as a modern soul stylist -- a cover of Freddie Scott's &quot;Are You Lonely for Me, Baby&quot; is a particularly effective showcase for Ballard's rough-edged vocals, while &quot;How You Gonna Get Respect&quot; and &quot;Come on Wit' It&quot; prove his easy mastery of blistering, J.B.'s-type funk. A superb, sadly under-recognized recording. ~ Jason Ankeny\n\n[b]Lyn Collins - Female Preacher\n[/b]1.  We Want To Parrty, Parrty, Parrty\t\t\n2. 'Mama Feelgood'\t\t\n3.  'Take Me Just As I Am'\t\t\n4. 'Mr. Big Stuff'\t\n5.  'Think (About it)'\t\t\n6. 'Me And My Baby Got A Good Thing Going'\t\n7.'Things Got To Get Better'\t\n8. 'You Can't Love Me If You Don't Respect Me'\t\n9. 'Give It Up Or Turn It Loose'\t\n10.  'Rock Me Again &amp; Again &amp; Again\n\n[b]Vicki Anderson - Message From A Soul Sister\n[/b]1. 'The Message From The Soul Sisters'\t\n2.- 'I'll Work It Out'\t\n3. 'Sound Funky'\t\n4. In The Land Of Milk And Honey'\t\n5. 'Don't Throw Your Love In The Garbage Can'\t\n6.  'Super Good'\t\n7.  'Answer To Mother Popcorn'\t\n8. 'I'm Too Tough for Mr. Big Stuff (Hot Pants)'\t\n9. Once You Get Started'\t\n10. You're Welcome, Stop On By'\n\nVicki Anderson and Lyn Collins, two of the funkiest female vocalists from James Brown's revue or from anywhere for that matter, are paired on one compact disc. Previously available as hard-to-find import LPs in the 1990's when the Godfather of funk was being resurrected by a new breed of DJ, finally available on digital technology.","torrent":{"xt":"urn:btih:c33c4d8975c6bcf4e4731bdecf0480fdf997d3c2","amp;dn":"Dionne+Warwick+-+Hank+Ballard+-+Lyn+Collins+-+Vicki+Anderson+%2832","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c33c4d8975c6bcf4e4731bdecf0480fdf997d3c2","infoHashBuffer":{"type":"Buffer","data":[195,60,77,137,117,198,188,244,228,115,27,222,207,4,128,253,249,151,211,194]},"announce":[],"urlList":[]}}