{"title":"La cinta roja.(ebook).","uid":5933312,"size":4193853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c40e9ffe9127b93bc02094b4fb19e6ebb1d14fe9&amp;dn=La+cinta+roja.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zurera","files":-1,"time":1288858393,"description":"Carmen Posadas recrea la apasionante vida de Teresa CabarrÃƒÂºs, una espaÃƒÂ±ola en la RevoluciÃƒÂ³n Francesa.\n\nPocas veces la realidad ha dado un personaje de vida tan intensa y aventurera como Teresa CabarrÃƒÂºs, la dama espaÃƒÂ±ola que, segÃƒÂºn la leyenda, logrÃƒÂ³ acabar con el Terror en la RevoluciÃƒÂ³n francesa. Para sus detractores, una arribista que hizo de la frivolidad su religiÃƒÂ³n y de la seducciÃƒÂ³n una forma de supervivencia. Para sus admiradores, una mujer que consiguiÃƒÂ³ salvar a muchos inocentes de la muerte y que mereciÃƒÂ³ que la llamaran Nuestra SeÃƒÂ±ora del Buen Socorro. En lo que todos estÃƒÂ¡n de acuerdo es en que la turbulenta historia de amor que viviÃƒÂ³ con el revolucionario Tallien fue el momento culminante de una vida extraordinaria: aristÃƒÂ³crata, rea de la guillotina, amante de asesinos y de futuros emperadores, fue revolucionaria y tambiÃƒÂ©n princesa y madre de diez hijos.\n\n\n\nUna mujer asÃƒÂ­ merece ser la protagonista de una novela memorable: Carmen Posadas la rescata del olvido y recrea en primera persona su vida apasionada y llena de claroscuros.","torrent":{"xt":"urn:btih:c40e9ffe9127b93bc02094b4fb19e6ebb1d14fe9","amp;dn":"La+cinta+roja.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c40e9ffe9127b93bc02094b4fb19e6ebb1d14fe9","infoHashBuffer":{"type":"Buffer","data":[196,14,159,254,145,39,185,59,192,32,148,180,251,25,230,235,177,209,79,233]},"announce":[],"urlList":[]}}