{"title":"Gaza: Beneath the Bombs","uid":5834326,"size":2758037,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c45aeeb6bccfe2031323d8112e152268afb15330&amp;dn=Gaza%3A+Beneath+the+Bombs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Djofullinn","files":1,"time":1284665788,"description":"\n\nThe Israeli offensive in Gaza was described by Amnesty international as &quot;22 days of death and destruction.&quot; Sharyn Lock's eye-witness account brings home the horror of life in Gaza beneath the bombs.\n\nLock went to the Gaza strip as volunteer, thinking the greatest danger she faced was sneaking past the Israeli sea blockade in a fishing boat, but soon after her arrival Israel attacked Gaza's 1.5 million inhabitants by land, air and sea. With others from the International Solidarity Movement, Lock volunteered with Palestinian ambulances, assisting them as they faced overwhelming civilian casualties. Her candid and dramatic blog from Gaza gave the world an insight into the conflict that the mainstream media -- unable to enter Gaza -- couldn't provide.\n\nGaza: Beneath the Bombs provides a view of Gaza difficult to glimpse from outside -- of a people who face their oppression not only with courage but with humor.\nAbout the Author\n\nSharyn Lock has been volunteering in Palestine since 2002. She has accompanied Palestinians in their nonviolent resistance to the West Bank Wall and volunteered at a Palestinian medical clinic in Lebanon during the 2007 attacks on Nahr El Bard refugee camp. She was also involved in planning to take boats through the sea blockade to Gaza with the Free Gaza movement. She has written for New Internationalist, Red Pepper and the Big Issue North.\nSarah Irving is a freelance writer. Her work has appeared in New Internationalist, Big Issue North and Electronic Intifada. She has been reviews editor at Red Pepper and Peace News, and features editor at Ethical Consumer. She has been an active campaigner on Palestinian issues since 2001.\n &lt;a href=&quot;\nhttp://www.amazon.com/Gaza-Beneath-Bombs-Sharyn-Lock/dp/074533024X/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1284658462&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Gaza-Beneath-Bombs-Sharyn-Lock/dp/074533024X/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1284658462&amp;sr=1-1&lt;/a&gt;","torrent":{"xt":"urn:btih:c45aeeb6bccfe2031323d8112e152268afb15330","amp;dn":"Gaza%3A+Beneath+the+Bombs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c45aeeb6bccfe2031323d8112e152268afb15330","infoHashBuffer":{"type":"Buffer","data":[196,90,238,182,188,207,226,3,19,35,216,17,46,21,34,104,175,177,83,48]},"announce":[],"urlList":[]}}