{"title":"The Precursors V1.1 [RUS][Russobit-M] 2010 TRiViUM","uid":5747712,"size":6465459216,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c4f751459f7d7ca50495c3cdd7f97bfdcafd1c20&amp;dn=The+Precursors+V1.1+%5BRUS%5D%5BRussobit-M%5D+2010+TRiViUM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ex_Exist","files":-1,"time":1281289501,"description":"The Precursors V1.1 [RUS][Russobit-M] 2010 TRiViUM\n\n\n                           The Precursors (c) Russobit-M\n                            *Offline Activation KeyGen* \n\n                      RELEASE DATE ................ : 08/2010            \n                      RELEASE SiZE .................. : 1 rar            \n                      PROTECTiON ...... : StarForce 5.70 + OA            \n\n                                   RELEASE NOTES\n\n\n             Precursors, predecessors, the legend of the galaxy:         \n             Who among the existing races are carrying their genes?      \n             The worlds of the galaxy are beautiful, unique and           \n             dangerous. Some of them are inhabited, some are deserted,    \n             some lie in ruins, others are just smugglers                 \n             trans-shipment stations.                                     \n             Some worlds are at the beginning of their evolution,         \n             other are falling into decay. Only when you'll pass          \n             through all of these worlds, when you'll feel the heat       \n             of blazing lava-seas and the chilling cold of dark           \n             abysses, when you'll see stark heavens and red skies,        \n             you will realize the real power of nature. Only when         \n             you'll meet corrupt judges, mendacious politicians,          \n             unselfish protectors and cruel tyrants, you'll understand    \n             the passions of society. Only when you'll reach unexplored   \n             sectors of the galaxy and come across wonderful natural      \n             phenomenons, when you'll fly through the tail of a comet     \n             or dive into a mysterious portal, then you'll perceive the   \n             infinite depth and diversity of the universe.                \n             Nobody knows what exactly this journey will comprise, but    \n             we can assure you that it will be unforgettable:             \n                                                                          \n             &quot;Precursors&quot; is a new project of Deep Shadows. The game      \n             action takes place in space and on the surface of various    \n             planets. The genre of the game is freeplay RPG with FPS and  \n             space sim combat elements.                                   \n                                                                          \n             &quot;Precursors&quot; and &quot;White Gold: War In Paradise&quot; are developed  \n             using the Vital Engine 3. It has shader 3.0 support and      \n             features various post rendering effects like HDR, motion     \n             blur and others. In comparison with the Vital Engine 2 the   \n             physics system has been improved and moreover, two of the    \n             main features of the engine are destructible objects, which \n             will be found everywhere in the games, and support of one   \n             huge unified playing area.                                  \n                                                                         \n             You will fight your enemies in space as well as on the      \n             surface of various planets. You will be able to work for    \n             different factions and carry out their quests to earn money, \n             which is quite essential for your hero. The money will give \n             you the opportunity to buy new weapons, make technical      \n             upgrades or repair your damaged spaceship.                  \n                                                                         \n             You can explore a planet's surface using a wide choice of   \n             different vehicles, but in space you will use only one      \n             ship which will be given to you at the beginning of the     \n             game. RPG stats will allows you to upgrade not only the     \n             personal characteristics of your hero but the technical     \n             abilities of your spaceship as well.                        \n\n\n             Features:                                                   \n\n              - Unique gameplay: combines such genres as RPG/FPS/space   \n              - A real opportunity to visit different planets            \n              - More than 250 exciting quests and tasks                  \n              - Partly organic weapons with ammunition, in need of food  \n              - Controllable space ships and other modes of transport    \n              - Huge variety of enemies                                  \n              - Ability to trade                                         \n              - Interaction with hundreds of NPC of different enemy      \n                races                                                    \n              - Weather conditions, day and night, atmospheric phenomena \n              - Update 1.1 integrated into game installer                \n                                                                         \n\n                                   iNSTALL NOTES\n\n                    - Unpack                    \n                    - Install the game          \n                    - Use our keygen to activate game in offline mode    \n                    - Feel the power of TRiViUM :&gt;                       \n                                                                         \n                                                                         \n                 Special note:                                           \n                 This keygen will work with all future game updates      \n                                       Enjoy!                            \n\n                                    GROUP NOTES\n\n                          Greetz to Protection Technology\n\n\n-------------------------------------------------------------------\n\nall the useful information in the file trivium.nfo and \n\n             &lt;a href=&quot;\nhttp://peerat.ru:8080/forum/viewtopic.php?t=2315&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://peerat.ru:8080/forum/viewtopic.php?t=2315&lt;/a&gt;\n\n\n-------------------------------------------------------------------\n\n","torrent":{"xt":"urn:btih:c4f751459f7d7ca50495c3cdd7f97bfdcafd1c20","amp;dn":"The+Precursors+V1.1+%5BRUS%5D%5BRussobit-M%5D+2010+TRiViUM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4f751459f7d7ca50495c3cdd7f97bfdcafd1c20","infoHashBuffer":{"type":"Buffer","data":[196,247,81,69,159,125,124,165,4,149,195,205,215,249,123,253,202,253,28,32]},"announce":[],"urlList":[]}}