{"title":"Teleac Buitenbeentjes - Angst (DVD ISO)NLT-Release (3)","uid":5904020,"size":1608515328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c54e778af940ca3933254274702c02e3ea8d997d&amp;dn=Teleac+Buitenbeentjes+-+Angst+%28DVD+ISO%29NLT-Release+%283%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NLT-Release-Linday","files":-1,"time":1287781616,"description":" \n\n7% van de kinderen van 8 tot 11 jaar heeft gedragsproblemen. Ongeveer 250.000 jongeren, in de leeftijd van 13 tot 18 jaar, hebben psychische problemen. Veel voorkomende problemen zijn angst- en dwangstoornissen, eetstoornissen (anorexia en bulimia), depressie, agressieve gedragsstoornissen, ADHD, autisme en aanverwante stoornissen.\nPortretten van kinderen en ouders\n\nHet programma Buitenbeentjes geeft informatie over de aard, de oorzaken en de behandeling van zes veelvoorkomende, vaak ernstige psychische aandoeningen bij kinderen en jongeren. Het gaat om portretten van kinderen en ouders die problemen hebben. Samen met de hulpverlening zoeken zij een manier om de situatie hanteerbaar te maken en te houden. Naast informatie over aandoeningen besteden we aandacht aan actueel onderzoek naar de achtergronden van psychiatrische stoornissen. Meer kennis over deze zaken kan leiden tot meer begrip en openheid voor 'buitenbeentjes' en hun ouders.\n\nEr zijn kinderen die overal bang voor zijn. Bang om alleen te zijn, bang voor stemmen, bang om naar school te gaan, bang om uitgelachen te worden, bang voor alles... soms zelfs bang om te gaan slapen. Deze kinderen hebben een angststoornis. Zij zien alles negatief, raken in paniek en denken dat er van alles mis zal gaan. Zij hebben een onrealistisch beeld van de wereld en onrealistische gedachten over zichzelf. Waar komt die angst vandaan? Kun je er vanaf komen of moet je ermee leren leven?\n\nLily is 14 jaar en enig kind. Sinds september 2004 weet zij dat ze aan een angststoornissen lijdt; zowel aan GAS (gegeneraliseerde angststoornis) als aan een sociale fobie. Het eerste betekent dat zij vrijwel alles negatief ziet en op zichzelf betrekt. Het laatste belemmert haar in de omgang met leeftijdsgenootjes. Zij is sindsdien in therapie bij De Bascule, een academisch centrum voor kinder- en jeugdpsychiatrie.\n\nType    : DVD5 ISO\nSubs    : Nederlands Gesproken\nBron    : TV\n\nUnieke hashcode:\nC54E778AF940CA3933254274702C02E3EA8D997D\n\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\nBy Linday ","torrent":{"xt":"urn:btih:c54e778af940ca3933254274702c02e3ea8d997d","amp;dn":"Teleac+Buitenbeentjes+-+Angst+%28DVD+ISO%29NLT-Release+%283%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c54e778af940ca3933254274702c02e3ea8d997d","infoHashBuffer":{"type":"Buffer","data":[197,78,119,138,249,64,202,57,51,37,66,116,112,44,2,227,234,141,153,125]},"announce":[],"urlList":[]}}