{"title":"Cinderella - Gypsy Road  (2nafish)","uid":5831428,"size":133787652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c5604b583f58dfb50aee9359f4612c2b21fae038&amp;dn=Cinderella+-+Gypsy+Road++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284530497,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Gypsy Road&quot; was a #51 US hit for Cinderella in 1989, from their second album, Long Cold Winter, which was released almost a whole year before.\n\nLong Cold Winter is Cinderella's second studio album, released in 1988 through Mercury Records. It reached #10 in the US and became double-platinum for selling 2 million copies in the US by the end of the year, just as their debut album Night Songs had done earlier. Currently both albums are certified triple platinum.\n\nThe album features four singles, which all charted in the US. &quot;Don't Know What You Got (Till It's Gone)&quot;, which was to be Cinderella's highest-charting single, reached #12, &quot;The Last Mile&quot;, reached #36, &quot;Coming Home&quot; reached #20, and &quot;Gypsy Road&quot; hit #51, a year after the release of the album itself.\n\nWith Long Cold Winter, Cinderella started to move away from the glam metal-territory of their previous album and into a more blues-rock direction, akin to early 70's Rolling Stones, Aerosmith, Humble Pie, Bad Company, and Deep Purple.\n\nCinderella is an American heavy metal band from Philadelphia, Pennsylvania. They emerged in the mid-1980s with a series of multi-platinum albums and hit singles whose music videos received heavy MTV rotation. They were famous for being a glam metal band, but then shifted over towards a more hard rock/blues-rock  sound. By the mid-1990s, the band's popularity declined severely due to personal setbacks and public changes in musical tastes. Nonetheless, after a period of hiatus the band reunited and is still active at present.\n\nCinderella was formed in Philadelphia in 1983 by singer-songwriter, keyboardist, and guitarist Tom Keifer and bassist Eric Brittingham. The initial lineup also included guitarist Michael Smerick and drummer Tony Destra. In 1985, Smerick and Destra left to form Britny Fox, another Philadelphia-based glam metal band that later relocated to Los Angeles. Cinderella got their big break when Jon Bon Jovi saw them perform at the Empire Rock Club in Philadelphia and recommended that his A&amp;R rep Derek Shulman who knew of the band, to see them as well. In 1985, with a recording contract with Mercury/Polygram Records in the works, guitarist Jeff LaBar and drummer Jim Drnec joined the band.\n\nDuring the recording of the band's debut album, Night Songs, studio session drummer Jody Cortez was brought in to help. While finishing the recording, Drnec was replaced by former London drummer Fred Coury, who joined in time to make the album's cover and play on upcoming tours. Night Songs was released on August 2, 1986 and eventually achieved triple platinum status, selling 50,000 copies per week at one point. The album reached #3 on the Billboard charts in February 1987.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c5604b583f58dfb50aee9359f4612c2b21fae038","amp;dn":"Cinderella+-+Gypsy+Road++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5604b583f58dfb50aee9359f4612c2b21fae038","infoHashBuffer":{"type":"Buffer","data":[197,96,75,88,63,88,223,181,10,238,147,89,244,97,44,43,33,250,224,56]},"announce":[],"urlList":[]}}