{"title":"Cyber Update Okt.2010-------DB-10646 KrystaKaos","uid":5869402,"size":366019859,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c67e80e6e987a8c2f31d3cfa6446a961620d39c7&amp;dn=Cyber+Update+Okt.2010-------DB-10646+KrystaKaos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":187,"time":1286399719,"description":"From Kink.com   ( Device Bondage )  + Pics\n\n\n\n\nPlease welcome Krysta Kaos for her first Device Bondage shoot. This hot little punk rock slut comes on set, all pierced and tattooed, telling us she's into pain play. Fantastic. So are we. You want to be fucked with, sweetie? Well, we're more than happy to.\n\nWe put her in a standing pose with her feet on a spiked lazy susan and her arms stretched high up above her. Those nasty little plastic spikes dig into her tender manicured soles. The stretched out pose is extremely stressful. She's sweating as soon as we put her into bondage. We gag her with a tight leather strap, and blindfold her to heighten her fear and sense of touch. \n\nOur goal is to overwhelm this sexy little whore. Once the scene starts, we hit our helpless, blindfolded lady with as many different corporal sensations as we can think of. We whip her perky little tits and ass. We flog her pussy hard. We break out the horsehair flogger and hit her up and down the backs of her stressed out legs until they are raw. We vibrate her reddened cunt while stinging her ass and tits unmercifully with the zapper. \n\nWe cover her lean body with clothespins, and pull her arms up higher, putting all her weight on her toes, now teetering painfully on the spikes. We whip off the pins one at a time while Krysta keeps count. Then we fuck her with a dildo until she comes so hard, she pulls her exhausted body up by the wrists, all that brutal suffering transformed into one hell of a brutal orgasm.\n\n\n\nScreens &lt;a href=&quot; http://www.devicebondage.com/site/shoot.jsp?shootId=10646&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.devicebondage.com/site/shoot.jsp?shootId=10646&lt;/a&gt;\n\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:c67e80e6e987a8c2f31d3cfa6446a961620d39c7","amp;dn":"Cyber+Update+Okt.2010-------DB-10646+KrystaKaos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c67e80e6e987a8c2f31d3cfa6446a961620d39c7","infoHashBuffer":{"type":"Buffer","data":[198,126,128,230,233,135,168,194,243,29,60,250,100,70,169,97,98,13,57,199]},"announce":[],"urlList":[]}}