{"title":"Alex Jones Show - 2010 July 19 MO [sebaygo1]","uid":5703011,"size":69798644,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c8b714af2767cbff55742aa0e545ab88d4861a30&amp;dn=Alex+Jones+Show+-+2010+July+19+MO+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":13,"time":1279579036,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nMonday, 19 July 2010\n\n\n[sebaygo1]\n\n\nAlex does a 4th hour today for the first time since changing to a 3 hour/day weekday format.\nHe calls it &quot;OverDrive,&quot; but it has commercial breaks unlike his OverDrive segments in the past.\n\n\n\n\nScheduled Guests\n................\n\n[show description from the Infowars web site]\n\n\nAlex talks with film-maker, broadcaster and former broker and options trader Max Keiser. Max formerly hosted The Oracle with Max Keiser on BBC World News and produced and appeared regularly in the TV series People &amp; Power on the Al-Jazeera English network. He currently hosts a weekly financial commentary show which started in 2009 and is broadcast on Press TV, with weekly appearances by financial commentator Stacy Herbert and featuring interviews with well known alternative economists. Alex discusses the removal of his video, The Obama Deception, from Google'sOn Thursday, Alex challenged activists to drive the popular documentary up in search engine ranking. Google trends rankings revealed a few hours later that it was the #1 search term, above Lindsay Lohan, the BP Oil Spill or the death of George Steinbrenner. \n[hours 3 and 4]\n &lt;a href=&quot;\nhttp://www.maxkeiser.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.maxkeiser.com&lt;/a&gt;\n\n\n\nAlex also covers the latest news and takes calls.\n\n[A lot of time spent today onefforts to censor The Obama Deception and other Jones documentaries.]\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_torrents_info_PLEASE-READ.txt\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........","torrent":{"xt":"urn:btih:c8b714af2767cbff55742aa0e545ab88d4861a30","amp;dn":"Alex+Jones+Show+-+2010+July+19+MO+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8b714af2767cbff55742aa0e545ab88d4861a30","infoHashBuffer":{"type":"Buffer","data":[200,183,20,175,39,103,203,255,85,116,42,160,229,69,171,136,212,134,26,48]},"announce":[],"urlList":[]}}