{"title":"Little Man Tate - About What You Know [2007]","uid":5723036,"size":282166521,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c8bc6ee3facc901d3d68799c7961252679b857a9&amp;dn=Little+Man+Tate+-+About+What+You+Know+%5B2007%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":13,"time":1280353533,"description":"Music : Indie : Lossless\nAbout What You Know\nLittle Man Tate\t\n\nReview\tby Stewart Mason (AMG)\n\nMusic journalists on deadline tend to make a lot of sloppy comparisons that don't really stand up to scrutiny, and as a result of geographical proximity, Little Man Tate have already gotten a sheaf of not entirely appropriate comparisons to their Sheffield compatriots and 2006 flavors of the month the Arctic Monkeys. There are some surface similarities, it's true -- Jon Windle's lyrics fixate on everyday concerns like obnoxious local bands, ex-girlfriends dating glam continental types, and on the brilliant single &quot;House Party at Boothy's,&quot; the kind of weekend nights that are ended by the cops -- but musically, Little Man Tate are part of a long and proud musical tradition. Pitching out swaggering, guitar-based tunes with echoes of Blur, the Stone Roses, the Dentists, the Jam and all the way back to vintage Face to Face-era Kinks, Little Man Tate are the latest in a long and proud line of U.K. power pop acts, with little of the post-punk revival spikiness of the Arctic Monkeys and a solid knack for singalong choruses. Nearly every song on About What You Know sounds like a potential single; indeed, early versions of many were released as such prior to the band's signing to the V2 label. Other highlights include the jumpy &quot;Three Day Rule,&quot; a song about calling a girl after a date that sounds like vintage late '70s power pop given only the slightest modern makeover. It's not at all surprising that the album cover for About What You Know pictures the band browsing in a vintage record store: Little Man Tate are the sort of band who sound as if they have consumed and synthesized whole chunks of pop history, turning this knowledge into bright and hummable three minute pop songs that vaguely recall any number of earlier bands while, crucially, not overtly aping any single group. As a result, About What You Know is the first great British pop album of 2007. Rating: 4/5","torrent":{"xt":"urn:btih:c8bc6ee3facc901d3d68799c7961252679b857a9","amp;dn":"Little+Man+Tate+-+About+What+You+Know+%5B2007%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8bc6ee3facc901d3d68799c7961252679b857a9","infoHashBuffer":{"type":"Buffer","data":[200,188,110,227,250,204,144,29,61,104,121,156,121,97,37,38,121,184,87,169]},"announce":[],"urlList":[]}}