{"title":"Kansas City Confidential [1952] Phil Karlson","uid":5730362,"size":429889662,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c90e771243c7887ef013200b4a517845615c526a&amp;dn=Kansas+City+Confidential+%5B1952%5D+Phil+Karlson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":6,"time":1280617863,"description":" &lt;a href=&quot;http://bayimg.com/gAOcEAaCA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/gAOcEAaCA&lt;/a&gt;\n\nKansas City Confidential (1952) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0044789/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0044789/&lt;/a&gt;\n\nKansas City Confidential is a 1952 film noir crime film directed by Phil Karlson and starring John Payne. Karlson and Payne teamed up a year later for another noir, titled 99 River Street, followed by a 1955 color film, Hell's Island.\n\n\n John Payne ...  Joe Rolfe \n Coleen Gray ...  Helen Foster \n Preston Foster ...  Tim Foster \n Neville Brand ...  Boyd Kane \n Lee Van Cleef ...  Tony Romano \n Jack Elam ...  Pete Harris \n Dona Drake ...  Teresa \n Mario Siletti ...  Tomaso \n Howard Negley ...  Andrews \n Carleton Young ...  Martin \n Don Orlando ...  Diaz \n Ted Ryan ...  Morelli \n\nWhen a bitter former police captain, Timothy Foster (played by Preston Foster), engineers a bank robbery, he enlists three felons to assist him. The robbery goes according to plan, but an ex-con, Joe Rolfe (John Payne), is picked up as a suspect. Rolfe is eventually cleared, but he decides to track down the actual robbers. The trail leads Rolfe to Guatemala where he learns Foster is behind the robbery and is planning to turn in the other three men to receive the reward money.\n\nKansas City Confidential (1952) depicts a violent criminal underworld. The New York Times criticized the film for its excess use of violence: &quot;An uncommon lot of face slapping, stomach punching, and kicking in the groin, the standard manifestations of the virulence of mobsters and criminals on the screen.&quot; The New York Times also criticized the film for its implication that there are corrupt police officers, a theme that would later become common in motion pictures. Director Phil Karlson says, &quot;This was so far ahead of itself that I say these pictures have been copied and recopied so many times. Unfortunately Phil Karlson never got the credit for it because I've never been a publicity hound. I come from the school where what we want to be judged by is up on the screen, not by how well I know so-and-so or so-and-so.&quot;\n\nKarlson filmed Kansas City Confidential in a semi-documentary style and this added a sense of realism and immediacy to the picture. Film critic Leonard Maltin commented, &quot;Looking at Kansas City Confidential, Scandal Sheet (both 1952), and especially the breakneck-paced The Phenix City Story (1955), one gets the impression that Karlson could have been a noir master.&quot; Unfortunately, Karlson never graduated to the A-picture level. His biggest commercial success was 1973's Walking Tall.\n\nJack Elam, Neville Brand, and Lee Van Cleef play the three criminals who take part in the armed robbery in Kansas City Confidential. All three men were well known for playing heavies in films and on television. Lee Van Cleef's career took off in the mid-1960s when he appeared in several &quot;Spaghetti Westerns&quot; with Clint Eastwood, including For a Few Dollars More (1965) and The Good, the Bad and the Ugly (1966).\n\nIn Kansas City Confidential, perennial movie bad guys Lee Van Cleef, Neville Brand and Jack Elam play thugs and criminal associates. Although the title would suggest that the story takes place in Kansas City, most of the film actually takes place at a fictitious fishing resort in Mexico. Kansas City Confidential was director Karlson's second crime film; he also directed Scandal Sheet, also released in 1952, which proved to be a modest commercial success. This movie's plot was the inspiration for Tarantino's Reservoir Dogs\n\nThe staff at Variety magazine said, &quot;With exception of the denouement, director Phil Karlson reins his cast in a grim atmosphere that develops momentum through succeeding reels. Payne delivers an impressive portrayal of an unrelenting outsider who cracks the ring.\n\nMore recently, when the film was released in DVD format, film critic Gary Johnson said, &quot;This is prime Karlson. It's brutal, hard-edged, and unflinching, but it's also livened by a distinct streak of optimism. Whereas some directors of film noir preferred the deterministic pessimism of Out of the Past and Raw Deal, Karlson tempered the surface cynicism of his films with an underlying sense of hope.&quot;[","torrent":{"xt":"urn:btih:c90e771243c7887ef013200b4a517845615c526a","amp;dn":"Kansas+City+Confidential+%5B1952%5D+Phil+Karlson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c90e771243c7887ef013200b4a517845615c526a","infoHashBuffer":{"type":"Buffer","data":[201,14,119,18,67,199,136,126,240,19,32,11,74,81,120,69,97,92,82,106]},"announce":[],"urlList":[]}}