{"title":"Nba Jam [PAL][English][Wii][www.consolasatope.com]","uid":5869063,"size":4699980130,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:c95dc8fb22d5d0fe5fb0b59ce0d0a4156db271bc&amp;dn=Nba+Jam+%5BPAL%5D%5BEnglish%5D%5BWii%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"consolasatope","files":3,"time":1286390820,"description":"Boomshakalaka! Ha vuelto! EA SPORTS NBA JAM revive la clÃƒÂ¡sica franquicia con el tradicional estilo NBA JAM, y nuevas caracterÃƒÂ­sticas que proporcionan una nueva experiencia de juego. Con los caracterÃƒÂ­sticos sonidos y estilo que reconocerÃƒÂ¡n los fans instantÃƒÂ¡neamente, EA SPORTS NBA JAM mezcla lo antiguo con lo nuevo, para proporcionar un juego deportivo ÃƒÂºnico en Wii.\nCaracterÃƒÂ­sticas:\nJugabilidad clÃƒÂ¡sica NBA JAM: La acciÃƒÂ³n inmediata dos contra dos es lo que hace grande la experiencia NBA JAM. EnfrÃƒÂ©ntate a un defensa en un uno contra uno y apura tu dribbling hasta el ÃƒÂºltimo segundo justo cuando te vaya a empujar. Lanza un alley- oop a tu compaÃƒÂ±ero de equipo y haz un mate de espaldas!\nVarios estilos de control: Tanto si prefieres lanzar a canasta usando los sensores de movimiento de Wii o pulsando botones, NBA JAM proporciona a los jugadores de jugar como prefieran. Elige entre los nuevos controles basados en los movimientos del mando o conecta el mando clÃƒÂ¡sico y salta utilizando los botones clÃƒÂ¡sicos y domina la cancha con tus equipos\nDos modos carrera: Ã‚Â¿Quieres sentir algo de nostalgia? Entonces salta al modo \\&quot;Classic campaign\\&quot; para vivir exactamente la misma experiencia clÃƒÂ¡sica NBA Jam. Pero si buscas algo distinto, salta al Remix Tour y vive un nuevo giro en Jam. Elige tu propio camino a la gloria y enfrÃƒÂ©ntate a las mayores leyendas del deporte.\nMontones de modos de juego: Ve un paso mÃƒÂ¡s allÃƒÂ¡ de los tradicionales modos de juego. De Backboard Smash a Domination pasando por 21 o Elimination, NBA Jam ofrece muchos modos de juego profundos para mantenerte enganchado al a experiencia JAM.\nJugadores realistas: Una de las seÃƒÂ±as de identidad de NBA Jam es su estilo grÃƒÂ¡fico. El estilo caracterÃƒÂ­stico que grita Jam desde que empiezas el partido se mezcla con un parecido foto realista sin precedentes en Wii (e incluso en otras consolas), creando una presentaciÃƒÂ³n ÃƒÂºnica pero a la vez curiosamente familiar.\nDesbloquea esto y aquello...: Completa los desafÃƒÂ­os Jam para desbloquear modos de juego y personajes, equipos secretos o pistas especiales. NBA Jam cuenta con una gran cantidad de contenido para que desbloquees conforme avanzas en el juego.\nBoss Battles: Algunos de los mejores jugadores de baloncesto han convertido este deporte en lo que es hoy. Son leyendas que no se dejarÃƒÂ¡n vencer fÃƒÂ¡cilmente. EstÃƒÂ¡n esperÃƒÂ¡ndote en tu camino y tendrÃƒÂ¡s que vencerles. Salta a una nueva y ÃƒÂºnica experiencia Jam con las Boss Battles. Los mejores jugadores haciendo su mejor partido. IntentarÃƒÂ¡n frustrarte con sus habilidades, pero tienes que vencerles para ser el mejor de los mejores.\nLos 30 equipos de la NBA y mÃƒÂ¡s...: Los tres mejores jugadores de cada equipo elegidos por los fans, aparecen en NBA Jam, pero eso no es todo. MÃƒÂ¡s de 100 equipos, personajes y mascotas desbloqueables estarÃƒÂ¡n disponibles.\nTim Kitzrow: La voz original que capturÃƒÂ³ la atenciÃƒÂ³n de un paÃƒÂ­s estÃƒÂ¡ de vuelta para poner la clÃƒÂ¡sica voz que recuerdas del NBA JAM origina, asÃƒÂ­ como nuevos comentarios, algunos de los cuÃƒÂ¡les han sido creados por los fans de la serie.\nGloria multi jugador: Juega solo o en compaÃƒÂ±ÃƒÂ­a en los mÃƒÂºltiples modos para varios jugadores disponibles en NBA Jam. Juega la campaÃƒÂ±a con el cooperativo de dos jugadores o juega con otros tres amigos en el dos contra dos, entre otros modos multijugador.\n","torrent":{"xt":"urn:btih:c95dc8fb22d5d0fe5fb0b59ce0d0a4156db271bc","amp;dn":"Nba+Jam+%5BPAL%5D%5BEnglish%5D%5BWii%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c95dc8fb22d5d0fe5fb0b59ce0d0a4156db271bc","infoHashBuffer":{"type":"Buffer","data":[201,93,200,251,34,213,208,254,95,176,181,156,224,208,164,21,109,178,113,188]},"announce":[],"urlList":[]}}