{"title":"crux-2.7","uid":5866019,"size":237387739,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:c9f2ae44322d931b90b5ac0ef5a07c36ab897b42&amp;dn=crux-2.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cestpasgagne2","files":3,"time":1286172889,"description":"Release Notes for CRUX 2.7\n\nIntroduction\n\nThis page discusses the relevant changes introduced in CRUX 2.7. Everybody upgrading from the previous release is advised to carefully read the following notes.\nToolchain updates\nCRUX 2.7 includes glibc 2.12.1, gcc 4.5.1 and binutils 2.20.1\nKernel\nLinux 2.6.35.6\nXorg\nCRUX 2.7 ships with Xorg 7.5 and xorg-server 1.9.0.\n\nImage\n\nTo save space, all packages shipped with the image are compressed with xz, which requires a new version of pkgutils. A gz compressed package of pkgutils has been placed the /tools subdirectory.\nBesides the usual ISO image, an image suitable for USB thumbdrives is available from our download mirrors.\nIncompatible changes\nImportant libraries have been updated to new major versions, which are not ABI compatible with the old versions. We strongly advise against manually updating to CRUX 2.7 via ports, since these changes will temporarily break the system.\n    * libgmp has been updated to version 5.0, required by gcc and coreutils\n    * libmpfr has been updated to version 3.0, required by gcc\n    * openssl has been updated to version 1.0, required by many packages (most noticeable: wget, which in turn is called by pkgmk to download sources)\n    * libjpeg has been updated to version 8\n    * libpng has been updated to version 1.4\n    * cairo is no longer built with support for the glitz backend (this affects GTK+ applications and others) \n\nImportant changes\n    * New features in pkgutils:\n          o In addition to gzip, pkgmk has been enhanced to optionally compress newly built packages with bzip2 or xz.\n          o pkgutils can read packages that have been compressed with bzip2 and xz in addition to gzip.\n          o pkgmk has been extended by the --ignore-new command line switch, which makes it ignore new files in a footprint mismatch.\n          o pkgmk has learned distinct exit codes for the various errors that might occur. \n    * acl has been added to core\n    * btrfs-progs has been added to core\n    * libattr has been renamed to attr and moved from opt to core\n    * libpcap has been moved from opt to core\n    * support for acl/cap has been added to coreutils\n    * NFSv4 support has been added to nfs-utils. This requires a couple of new libraries (libevent, libtirpc, libnfsidmap), and portmap has to be replaced by rpcbind. We have moved the entire NFS stack to opt, which is still shipped with the ISO. Setup will handle the upgrade and new requirements automatically.\n    * portmap has been removed from core\n    * the default configuration of sysklogd has been extended\n    * default logging of dcron is now done via sysklogd\n    * minor release numbers are no longer used in the directory layout of perl. It is now possible to update the perl port without breaking every perl extension module.\n    * the default X font path has been changed to /usr/share/fonts/X11 \n\nHomePage : http://crux.nu/Main/HomePage","torrent":{"xt":"urn:btih:c9f2ae44322d931b90b5ac0ef5a07c36ab897b42","amp;dn":"crux-2.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f2ae44322d931b90b5ac0ef5a07c36ab897b42","infoHashBuffer":{"type":"Buffer","data":[201,242,174,68,50,45,147,27,144,181,172,14,245,160,124,54,171,137,123,66]},"announce":[],"urlList":[]}}