{"title":"Memphis Original Broadway Cast","uid":5907530,"size":353666616,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ca31dfa8b5391843c3ed9428c3948786e9caa96a&amp;dn=Memphis+Original+Broadway+Cast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"Deezie3","files":22,"time":1287931769,"description":"Audio CD (March 30, 2010) \nOriginal Release Date: 2010 \nNumber of Discs: 1 \nFormat: Cast Recording \nLabel: Rhino Records \nASIN: B0037RBVDI \n\nProduct Description\nTURN UP THAT DIAL! From the underground dance clubs of 1950's Memphis, TN, by way of hit runs at the La Jolla Playhouse and Seattle's 5th Avenue Theatre, comes a hot new Broadway musical - inspired by actual events - with heart, soul and energy to burn.\nMEMPHIS features a brand new score with music by David Bryan (Bon Jovi's founding member/keyboardist)and lyrics by David Bryan and Joe DiPietro (I Love You, You're Perfect, Now Change), who also pens the musical's book. MEMPHIS is based on a concept by the late George W. George (producer of the TonyÃ‚Â®-nominated Bedroom Farce and the film My Dinner With Andre), with direction by Tony nominee Christopher Ashley (Xanadu), and choreography by Sergio Trujillo (Jersey Boys).\nMEMPHIS takes place in the smoky halls and underground clubs of the segregated 50s, a young white DJ named Huey Calhoun (Chad Kimball) falls in love with everything he shouldn't: rock 'n' roll and an electrifying black singer named Felicia (Montego Glover). MEMPHIS is an original story about the cultural revolution that erupted when his vision met her voice, and the music changed forever.\nMEMPHIS stars Chad Kimball (Huey) and Montego Glover (Felicia), with Derrick Baskin (Gator), J. Bernard Calloway (Delray), James Monroe Iglehart (Bobby), Tony nominee Michael McGrath (Mr. Simmons), and Cass Morgan (Mama). \nThe collection contains 19 songs and a bonus track/acoustic version of 'The Music of My Soul' with piano and vocals by David Bryan. \n\n","torrent":{"xt":"urn:btih:ca31dfa8b5391843c3ed9428c3948786e9caa96a","amp;dn":"Memphis+Original+Broadway+Cast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca31dfa8b5391843c3ed9428c3948786e9caa96a","infoHashBuffer":{"type":"Buffer","data":[202,49,223,168,181,57,24,67,195,237,148,40,195,148,135,134,233,202,169,106]},"announce":[],"urlList":[]}}