{"title":"The.Ball-SKIDROW","uid":5918255,"size":883859771,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cac557b917e4b03ddc264db43cfb8112828177ed&amp;dn=The.Ball-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":21,"time":1288315280,"description":"S K i D R O W\n\n-&gt; T H E L E A D i N G F O R C E &lt;-\n\nproudly presents\nThe Ball / Tripwire Interactive\n\nRELEASE DATE : 28-10-2010 PROTECTION : Steam\nGAME TYPE : Action DISKS : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n\n\\ / |/ /_/\\_| \\ \\ _ \\ / /_ \\/\\ /\\\n/\\ \\/| / / \\/\\/| |\\ \\ \\//_// / / / / / /\n/ \\ \\| \\ \\ / \\| |_\\ \\ / / \\/ /_/ / /// /\ntwice the fun \\/ double the trouble\n\nOn with the game release information:\n\nThe Ball is a first person action-adventure game featuring a\nfull single-player experience built on Epic's Unreal Engine 3\ntechnology. As a swashbuckling archaeologist working on the\nslopes of a dormant volcano somewhere in Mexico, you get stuck\nin a cavern. It doesn't take long before you realize this is\nmore than just a cave. You reveal ancient ruins that have been\nhidden from outsiders for centuries and discover a mysterious\nartifact, a gold and metal shelled Ball. As you progress\ntowards solving the mystery of this amazing place you must\nunlock the secrets of the Ball and learn to control this\nancient artifact. Venturing deeper into the volcano, you\nreveal some of mankind's greatest secrets and you will start\nto encounter not just puzzles and traps, but also various\nstrange creatures - the guardians of this mystery. These\ncreatures have to be overcome, using only the Ball to defend\nyou.\n\n8 hours of single-player adventure\n\nGame mechanics that are very simple to pick up, immersing the\nuser in the physics-based gameplay right from the start\n\n8 huge levels to explore\n\nIncludes bonus Survival game mode, with 4 additional levels\n\nWide range of enemies to overcome, including mummies and an\nundead gorilla\n\nUnique vehicles - an underground train and the mysterious\n&quot;Ball Chariot&quot;\n\n35 secrets hidden away to be discovered, as well as multiple\nachievements for the player to earn\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the cracked content from the SKIDROW folder on the DVD\nto the main installation folder and overwrite\n5. Play the game\n\nAdditional Notes:\n\nUse the included Language Changer, if you want to play this\ngame in another language than english. It can be found in the\nSKIDROW folder on the DVD, together with the cracked content.\n\nSupport the companies, which software you actually enjoy!\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:cac557b917e4b03ddc264db43cfb8112828177ed","amp;dn":"The.Ball-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac557b917e4b03ddc264db43cfb8112828177ed","infoHashBuffer":{"type":"Buffer","data":[202,197,87,185,23,228,176,61,220,38,77,180,60,251,129,18,130,129,119,237]},"announce":[],"urlList":[]}}