{"title":"The Quest Trio - Jewels Cards and Tiles [EUR][NDS][English][www.","uid":5833934,"size":67109218,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:cae9f921486696b644bf6b15ba3dc35948713a28&amp;dn=The+Quest+Trio+-+Jewels+Cards+and+Tiles+%5BEUR%5D%5BNDS%5D%5BEnglish%5D%5Bwww.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":3,"time":1284658436,"description":"Plataforma: NDS\nIdioma: English\n\nResumen:\nJewel Quest Expeditions and Mah Jong Quest Expeditions were both released on the Nintendo DS last year. Jewel Quest went for $30 and the Mah Jong business was $20. Now both of those titles have been combined along with another game, Jewel Quest Solitaire, for just $20. Since these are all solid games, this is a pretty nice little package I would recommend to any DS-owning puzzle fan.\n\nEach title actually goes to the trouble of creating a context for the gameplay and establishing a story. It's a welcome addition although it isn't really necessary for a puzzle game. For the most part, the character art is well done. There is a lot of borrowing from Indiana Jones here, from the fedora-wearing adventurers to the John Williams-ish music to even the fonts used. Each title has its own in-game tutorial, which is nice because the manual doesn't explain the rules at all.\n\nJewel Quest Solitaire\nThe new game in the pack is a mash-up of a zany take on solitaire and the familiar match-three gameplay of Jewel Quest. The cards are arranged in a variety of patterns, not the vertical lines you may be used to. At the bottom is your foundation pile. Cards in play are moved to the foundation pile if they are one value higher or lower than the card on top of the pile. On the top screen is a jewel field, and as you play solitaire, gems will drop in matching the suit of the cards you play. ","torrent":{"xt":"urn:btih:cae9f921486696b644bf6b15ba3dc35948713a28","amp;dn":"The+Quest+Trio+-+Jewels+Cards+and+Tiles+%5BEUR%5D%5BNDS%5D%5BEnglish%5D%5Bwww.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cae9f921486696b644bf6b15ba3dc35948713a28","infoHashBuffer":{"type":"Buffer","data":[202,233,249,33,72,102,150,182,68,191,107,21,186,61,195,89,72,113,58,40]},"announce":[],"urlList":[]}}