{"title":"Bernstein 6. The Poetry of Earth [Harvard, 1973]","uid":5843855,"size":1470107871,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb07c63baa8b922fc201aed3af3a9ea42ba03a6d&amp;dn=Bernstein+6.+The+Poetry+of+Earth+%5BHarvard%2C+1973%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ill88eagle","files":7,"time":1285077508,"description":"This is the last and also the longest of Mr. Bernstein's lectures in this cycle. He presents us with &quot;sincerity&quot; in music and whether the examples he plays are sincere or not and reminds us of Theodore Adorno's theory on the compositional dichotomy in the persons of Schoenberg and Stravinsky. For Adorno the latter is &quot;a child of satan&quot; full of heart-up-his-sleeve forms of expression, vacuous; in other words: artificial. Whereas Schoenberg represents the saintly, objective and direct expression of feelings; i.e. what is ART and what is ARTIFICIAL. How artificial can art be and still be art?\n\nUnfortunately, Art is more subtle than this dichotomy. And it is Stravinsky who plunges to the rescue of tonality, for example, in The Firebird Suite. He is at the center of a new movement in which tonality was kept &quot;fresh&quot;. The creative self is removed from the creative object but there is an aesthetic value which holds it together. Already we had Satie and his anti-Wagnerian &quot;degagÃƒÂ©&quot; compositions. To join him come Picasso and Cocteau to create &quot;Parade&quot;. And Stravinsky pursues this aesthetic objectivity in his works: Petrushka, The Rite... A full performance of Stravinsky's Oedipus Rex can be seen at the end, which totally floored me. I thought it was brilliant. Tatiana Troyanos' voice is overpowering. Needless to say, you will most probably have to download all the works by Stravinsky after having seen this.\n\n********** This is a repost of an old torrent worth reviving **********\n\nThanks to the original uploader and, please seed it as long as you can. This kinda knowledge deserves to be spread widely and freely.\n\nFor a preview or two go here: http://muckypig.com/thepigpen/showthread.php?tid=1556&amp;pid=39033#pid39033\n","torrent":{"xt":"urn:btih:cb07c63baa8b922fc201aed3af3a9ea42ba03a6d","amp;dn":"Bernstein+6.+The+Poetry+of+Earth+%5BHarvard%2C+1973%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb07c63baa8b922fc201aed3af3a9ea42ba03a6d","infoHashBuffer":{"type":"Buffer","data":[203,7,198,59,170,139,146,47,194,1,174,211,175,58,158,164,43,160,58,109]},"announce":[],"urlList":[]}}