{"title":"Alan Bennett Interview (TV) [1992]","uid":5835375,"size":723509501,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cce2d1c26a91ef3c1bc204fd67d8ad1f93a07158&amp;dn=Alan+Bennett+Interview+%28TV%29+%5B1992%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1284712476,"description":" &lt;a href=&quot;http://bayimg.com/DAofEaAcJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/DAofEaAcJ&lt;/a&gt;\n\nAlan Bennett (born 9 May 1934) is an English playwright.  Bennett's first stage play, Forty Years On directed by Patrick Garland was produced in 1968. Many television, stage and radio plays followed, along with screenplays, short stories, novellas, a large body of non-fictional prose and broadcasting, and many appearances as an actor.\n\nHe is interviewed on January 15,1992, by Alan Titchmarsh, joined by Patricia Routledge, about his career and the Talking Heads monologues.\n\nMany of Bennett's characters are unfortunate and downtrodden, or meek and overlooked. Life has brought them to an impasse, or else passed them by altogether. In many cases they have met with disappointment in the realm of sex and intimate relationships, largely through tentativeness and a failure to connect with others.\n\nBennett is both unsparing and compassionate in laying bare his characters' frailties. This can be seen in his television plays for LWT in the late 1970s and the BBC in the early 1980s, and in the 1987 Talking Heads series of monologues for television which were later performed at the Comedy Theatre in London in 1992. This was a sextet of poignantly comic pieces, each of which depicted several stages in the character's decline from an initial state of denial or ignorance of their predicament, through a slow realization of the hopelessness of their situation, and progressing to a bleak or ambiguous conclusion. A second set of six Talking Heads pieces followed a decade later, which was darker and more disturbing.\n\nKatherine Patricia Routledge, CBE (born 17 February 1929) is an English theatre, television, and film actress and singer. She is best known for her roles on British television, most notably as Hyacinth Bucket on Keeping Up Appearances. In addition to her roles in British television, she has a long and successful career in musical theatre, as well as in film. She currently lives in Chichester, West Sussex.\n\n\n\n","torrent":{"xt":"urn:btih:cce2d1c26a91ef3c1bc204fd67d8ad1f93a07158","amp;dn":"Alan+Bennett+Interview+%28TV%29+%5B1992%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cce2d1c26a91ef3c1bc204fd67d8ad1f93a07158","infoHashBuffer":{"type":"Buffer","data":[204,226,209,194,106,145,239,60,27,194,4,253,103,216,173,31,147,160,113,88]},"announce":[],"urlList":[]}}