{"title":"Billy Joel - She's Always A Woman (Beat Club)(2nafish)","uid":5839833,"size":112873476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cd1e478e127997f586adb008e3140d2925062f94&amp;dn=Billy+Joel+-+She%5C%27s+Always+A+Woman+%28Beat+Club%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1284855415,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBilly Joel - She's Always A Woman (Beat Club)(2nafish)\n\n\n&quot;She's Always a Woman&quot; is a song from Billy Joel's 1977 album The Stranger. It is a love song about a modern woman, with whom he falls in love for her quirks as well as her flaws. The single peaked at #17 in the U.S. and in 1986 peaked at #53 in the UK when released as a double A-side single with Just the Way You Are. On May 2, 2010 the song re-entered the UK chart at #29. The song is played in compound time signatures of 6/8 9/8 and 12/8.\n\nThis song played at the Austin J. Tobin Plaza at the base of the former World Trade Centre Towers, during the Terrorist Attack of September 11, 2001 and continued to play until both Towers died.\n\nThe song was released in 1977, following several other hits from Billy Joel's successful album The Stranger  including &quot;Just the Way You Are,&quot; &quot;Movin' Out,&quot; and &quot;Only the Good Die Young.&quot; Musically, Billy has said that he was influenced by Gordon Lightfoot and his mellow acoustic guitar ballads. Lyrically, many people misinterpreted the words as being misogynistic or sarcastic, but it is a ballad, a love song that Billy wrote for his then wife, Elizabeth. Elizabeth had taken over management of Billy's career, and was able to put his financial affairs in order after Billy had signed some bad deals and contracts. She was a tough and savvy negotiator who could &quot;wound with her eyes&quot; or &quot;steal like a thief,&quot; but would &quot;never give in.&quot; Because of her tough-as-nails negotiating style, many business adversaries thought she was &quot;unfeminine,&quot; but to Billy, she was always a woman. Billy and Elizabeth eventually divorced in 1982.\n\nThe Stranger is the fifth studio album by musician Billy Joel, released in 1977. While his four previous albums had been moderate chart successes, this was his breakthrough album, spending six weeks at #2 in the U.S. album charts. It remains Joel's best-selling non-compilation album to date.\n\nMuch of the album's success is attributed to Joel's collaboration with producer Phil Ramone, whose innovative production methods complemented Joel's songs. This fruitful collaboration would continue for a decade. Singles released from the album include &quot;Just the Way You Are&quot; (which won the Grammy for Record of the Year), the acoustic ballad &quot;She's Always A Woman,&quot; the mildly controversial &quot;Only the Good Die Young,&quot; and &quot;Movin' Out (Anthony's Song),&quot; which later lent its title to Movin' Out, an acclaimed hit Broadway musical based on Billy Joel's songs. This album overtook Simon and Garfunkel's Bridge Over Troubled Water album to become the best-selling album on the Columbia Records imprint at the time. Generally regarded as Joel's finest work, in 2003, the album was ranked number 67 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:cd1e478e127997f586adb008e3140d2925062f94","amp;dn":"Billy+Joel+-+She%5C%27s+Always+A+Woman+%28Beat+Club%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd1e478e127997f586adb008e3140d2925062f94","infoHashBuffer":{"type":"Buffer","data":[205,30,71,142,18,121,151,245,134,173,176,8,227,20,13,41,37,6,47,148]},"announce":[],"urlList":[]}}