{"title":"Epstein-Deception-Invisible War Between KGB&amp;CIA(1989)","uid":5742773,"size":4294018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cede7a6700ebd2223d44078c2592d6752e38c180&amp;dn=Epstein-Deception-Invisible+War+Between+KGB%26CIA%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"red_gonzo","files":1,"time":1281091058,"description":"This is Edward Jay Epstein's mindblowing book Deception - The Invisible War Between the KGB and the CIA (1989) which delves deep into the wheels-within-wheels of superpower intelligence and counterintelligence, showing ways in which the CIA and the KGB have been &quot;provoked, seduced, lured into false trails, blinded, and turned into unwitting agents.&quot; It is difficult to overstate the importance of this book in intelligence scholarship since it is perhaps the only book that gives, essentially from the horse's mouth, James Jesus Angleton's approach to analytical counterintelligence. This approach was driven from CIA when Angleton was fired in 1974 as part of the Church Committee witch hunt. Angleton's seemingly simple insight - that our enemies, as thinking, breathing human beings, may actually go out of their way to feed us false intelligence, so that we will believe things that aren't true - has been totally lost to CIA for almost 30 years. Instead, it has been replaced with a naive faith that CIA is simply to smart and professional to be fooled. Readers will find new information here on a multitude of subjects: programs involving CIA-written books published under defectors' names; the story of Yuri Nosenko, a KGB officer who defected in 1963 and was &quot;at the heart of everything that happened at the CIA for a decade&quot;; and the theories of James Angleton, the former CIA chief of counterintelligence, on the hidden motives of KGB super-mole Kim Philby. Deception concludes with an ominously plausible argument that Gorbachev's glasnost is merely the sixth phase in a grand strategy of Soviet deception conceived soon after the Bolshevik revolution. You simply can't understand intelligence matters without grasping the role of deception and once you understand Soviet deception you'll wonder whether the Cold War is really over. 320 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:cede7a6700ebd2223d44078c2592d6752e38c180","amp;dn":"Epstein-Deception-Invisible+War+Between+KGB%26CIA%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cede7a6700ebd2223d44078c2592d6752e38c180","infoHashBuffer":{"type":"Buffer","data":[206,222,122,103,0,235,210,34,61,68,7,140,37,146,214,117,46,56,193,128]},"announce":[],"urlList":[]}}