{"title":"Democracy Now - 14 sep 2010","uid":5830122,"size":455616533,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cee004ec136e1736a285ed343b24fd681730c9ce&amp;dn=Democracy+Now+-+14+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1284481526,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 14, 2010\n\n- 10 Killed in U.S. Attack in Pakistan\n- Indian Police Kill 18 in Kashmir Unrest\n- U.S. Agrees to Record $60B Weapons Deal with Saudi Arabia\n- Senate Republicans Oppose Obama Plan to End Tax Cut for Wealthiest\n- Primaries Held in 7 States, DC\n- Imam: &quot;All Options&quot; Open on Islamic Cultural Center\n- Israeli-Palestinian Talks Resume in Egypt\n- US Asks Arab States to Withdraw Israel Measure at IAEA\n- US Won't Pay Bail for Sarah Shourd\n- Cuba to Lay Off 500,000 State Workers\n- Gov't Scientists, Inspectors: Corporate Interests Threatening Food Safety\n- Prominent Civil Rights-Era Photographer Was FBI Informant\n\n\nSpecial reports\n\n- As Regulators Weigh Drilling in Marcellus Shale, EPA Opens Public Hearings on Health and Environmental Impact of Hydraulic Fracturing\n\nThe Environmental Protection Agency has begun public hearings in Binghamton, New York on hydraulic fracturing, or &quot;fracking,&quot; a controversial technique that mining companies use to extract natural gas from rock formations thousands of feet underground. The hearings are part of a broad investigation by the EPA into the human health and environmental effects of fracking. We speak to Josh Fox, director of the Sundance award-winning documentary Gasland, which opens in theaters across the country this Wednesday; and ProPublica reporter Abrahm Lustgarten, who has written extensively about natural gas drilling.\n\n\n- Street Sweeper Social Club: &quot;Revolutionary Party Music&quot; From Tom Morello of Rage Against the Machine and Boots Riley of the Coup\n\nAs part of our ongoing series on music and resistance, we speak to Tom Morello of Rage Against the Machine and Boots Riley of the Coup. Their band Street Sweeper Social Club has just released a new record, &quot;The Ghetto Blaster EP.&quot;\n\n\n- In Monumental Union Vote, California Healthcare Workers to Choose Between SEIU and Breakaway NUHW\n\nIn the largest private sector labor election in over half a century, 43,000 healthcare workers at Kaiser Permanente hospitals in California are choosing between the Service Employees International union and the breakaway National Union of Health Workers. We speak to labor analyst Mark Brenner.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cee004ec136e1736a285ed343b24fd681730c9ce","amp;dn":"Democracy+Now+-+14+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cee004ec136e1736a285ed343b24fd681730c9ce","infoHashBuffer":{"type":"Buffer","data":[206,224,4,236,19,110,23,54,162,133,237,52,59,36,253,104,23,48,201,206]},"announce":[],"urlList":[]}}