{"title":"David Limbaugh - ","uid":5849770,"size":495152376,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d06212c41493e7b8454e63f2beaf5ea14b0d4cd8&amp;dn=David+Limbaugh+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":3,"time":1285286473,"description":"Crimes Against Liberty: An Indictment of President Barack Obama \nDavid Limbaugh\nUnabridged - Read by: Don Leslie \n\nAs Americans, liberty is an inalienable right that is granted to us by God, protected by the Constitution, and upheld by our government. Yet, Barack Obama doesn't seem to share that view. To him, liberty is a threat to the government's power and something to be squashed by any means possible, as bestselling author David Limbaugh shows to devastating effect in his new book, Crimes against Liberty. In Crimes against Liberty, Limbaugh issues a damning indictment of President Barack Obama for encroaching upon and stripping us of our individual and sovereign rights. Laying out his case like he would a criminal complaint, Limbaugh presents the evidence -- count-by-count -- against Obama. From exploiting the financial crisis for political gain, to restricting our personal freedoms through invasive healthcare and ''green'' policies, to endangering America with his feckless diplomacy and reckless dismantlement of our national security systems, Limbaugh proves -- beyond a reasonable doubt -- that Obama is guilty of crimes against liberty\n\nm4b ipod format in 2 files","torrent":{"xt":"urn:btih:d06212c41493e7b8454e63f2beaf5ea14b0d4cd8","amp;dn":"David+Limbaugh+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d06212c41493e7b8454e63f2beaf5ea14b0d4cd8","infoHashBuffer":{"type":"Buffer","data":[208,98,18,196,20,147,231,184,69,78,99,242,190,175,94,161,75,13,76,216]},"announce":[],"urlList":[]}}