{"title":"Moonwalk One","uid":5719739,"size":973658343,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d0c8f245bfd8da8aab0b7a56e892b0c50f6a9f87&amp;dn=Moonwalk+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1280244047,"description":"____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n* Be part of Advanced Science\n* Go to site to request reseeding!\n* Copy Our Torrents To All 'Open' Trackers!!!\n\n\n\n&quot;An extraordinary documentary. A meaningful, artistically conceived and executed ode to man's step toward the moon. A movie of historical scope and time capsule worthiness.&quot;\n\nMoonwalk One. Kamecke's film could be placed in a time capsule and removed some time in the distant future as an exact record of our feelings at the time. So said Kathleen Carroll of the New York Daily News in 1972. NASA commissioned director Theo Kamecke to make the documentary only six weeks before Apollo 11 s flight to the Moon in July 1969. But instead of a simple documentary film, what transpired was a philosophical and poetic record of Man s first attempt to walk on another world.\n\nOpening dramatically with another of mankind s great achievements Stonehenge the film puts the triumph of the Moon shot into its proper historical context. Filmed across the World as the mission unfolded, Moonwalk One uniquely captured the essence of Apollo 11 in a way that subsequent documentaries could only mimic. Combined with Charles Morrow s breathtaking, avant-garde score and Laurence Luckinbill s inspiring narration this is a classic film for all time and makes for fascinating viewing today from the perspective of the early 21st Century.\n\nAs Joseph Gelmis of the New York daily Newsday declared in 1969; Moonwalk One deserves to be a companion piece to Stanley Kubrik s masterwork 2001: A Space Odyssey . The Restoration. Working closely with Theo, the producers have re-mastered his documentary classic for future generations to enjoy. Combining the only existing full-length 35mm print with recently restored NASA film shot by the astronauts themselves, they have created a vibrant new High Definition digital master of the movie. Together with a director s commentary, a host of extra features and a new 5.1 sound track, this is indeed the ultimate time capsule , recording the last year of the 1960s and the historic flight of Apollo 11. \n &lt;a href=&quot;\nhttp://www.moonwalkone.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moonwalkone.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:d0c8f245bfd8da8aab0b7a56e892b0c50f6a9f87","amp;dn":"Moonwalk+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c8f245bfd8da8aab0b7a56e892b0c50f6a9f87","infoHashBuffer":{"type":"Buffer","data":[208,200,242,69,191,216,218,138,171,11,122,86,232,146,176,197,15,106,159,135]},"announce":[],"urlList":[]}}