{"title":"Tirador 2007(Sling Shot) DVDRip XViD (Pinoy) sribats75","uid":5888776,"size":735713904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d0ce049116fa439d74964483b432e65875397ac0&amp;dn=Tirador+2007%28Sling+Shot%29+DVDRip+XViD+%28Pinoy%29+sribats75&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"suade4life","files":6,"time":1287152888,"description":"Category: Action Drama \n\nLabel Others \n\nTagalog Movie \n\nA tribute to the real potential of digital cinema, Slingshot is a slum epic on steroids. \nIt weaves stories left and right into a shocking tableau about life for the lowest of the low in the Philippines poorest and most crime-ridden districts. \n\nNational elections are coming up so in the usual attempt to appear &quot;tough-on-crime&quot;, The Big Boys have been sent into crack down on the the local squatters, thieves and miscreants who litter the film like broken bottle. \n\nAnd since no sweep is ever a clean sweep, the cops brutal shock-force tactics quickly ripple outwards with jagged repurcussions. \n\nStarting from the films amazing night time raid and climaxing with a candle-lit vigil by those insulted by the empty words of the politicians, director Brilliante Mendoza uses the camera's apparent attention deficit disorder to maximum effect, investigating lives at every turn and blending their true fictions right onto the city streets of Manila for a rich and incredibly immersive feel. \n\nMuch of this effect might have been entirely impossible to capture if not for the ease of shooting made possible today. \n\nMendoza is not only clearly aware of the technological revolution happening in his hands but he is able to seize it so well that he brings back to life the ensemble-cast movie on a level not seen since Robert Altman's finest films. \n\nDirected by Brilliante Mendoza and written by Ralston Jover \n\nCoco Martin \nKristofer King \nJiro Manio \nJacklyn Jose \nJulio Diaz \nJean Andrews \n","torrent":{"xt":"urn:btih:d0ce049116fa439d74964483b432e65875397ac0","amp;dn":"Tirador+2007%28Sling+Shot%29+DVDRip+XViD+%28Pinoy%29+sribats75","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0ce049116fa439d74964483b432e65875397ac0","infoHashBuffer":{"type":"Buffer","data":[208,206,4,145,22,250,67,157,116,150,68,131,180,50,230,88,117,57,122,192]},"announce":[],"urlList":[]}}