{"title":"Coast To Coast Am - 08-05-10 - History Of Voyager &amp; Legend Tripp","uid":5744682,"size":55525431,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d230c641db8291b7adeeb87d531647d7ef17bc7c&amp;dn=Coast+To+Coast+Am+-+08-05-10+-+History+Of+Voyager+%26+Legend+Tripp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1281165770,"description":"Date:\n 08-05-10\n \nHost:\n George Noory\n \nGuests:\n Stephen Pyne, Jeff Belanger \n \n\n\nIn the first half of the program, Prof. Stephen Pyne discussed the history of the Voyager 1 &amp; 2, spacecraft launched in 1977. He explained that the concept for the program arose when NASA discovered that, every 176 years, the outer planets aligned in such a way that a single craft could pass by all of them. &quot;That concept became so dazzling, it acquired the name 'The Grand Tour,'&quot; Pyne said. As such, the space agency decided that they simply could not let such a rare opportunity slip past them and created the Voyager program. Making Voyager even more remarkable is, thirty-three years after their launch, the craft are still operational, traveling out into the solar system, and should remain viable for almost another decade. \n\nPyne detailed one aspect of Voyager that continues to capture the imagination of the public: the Golden Record contained aboard both crafts. This veritable time capsule features information about the human race and Earth as well as serves as a literal record, containing a diverse selection of music, ranging from Mozart to the song &quot;Johnny B. Goode.&quot; Looking at the origins of the record, Pyne noted that it satisfied a variety of different agendas at work behind the scenes at the project. He observed that the very inclusion of the record, championed by Carl Sagan, implies that there is life in the universe that could discover this message from Earth and its denizens. Additionally, Pyne said, it served as a way of coalescing mankind around one unified message. Calling it a &quot;statement back to Earth,&quot; Pyne mused that creating the Golden Record asked the question &quot;how do we wish to see ourselves&quot; and, therefore, &quot;it was a very appropriate and, in many ways, inspired gesture.&quot; \n\n------------------------------------- \n\nIn the latter half of the show, journalist and sometime ghosthunter, Jeff Belanger talked about legends and the practice of 'legend tripping' to paranormal hot spots. &quot;A legend is a living entity,&quot; he declared, noting that such stories are born, grow, 'marry' or merge with other tales, clone themselves, travel, and even die if the story ceases to be told. To that end, he described 'legend tripping' as &quot;getting out there and putting yourself into the story,&quot; thus experiencing, first-hand, the locations where sightings of anomalies like Bigfoot, ghosts, and UFOs have occurred. Imparting advice for would-be legend trippers, Belanger suggested they get a business card, which creates an air of professionalism allowing for easier access to locations, and to be extroverted, since the practice require networking to find the best stories or sites. \n\nBelanger also discussed unique aspects surrounding a variety of legends, including paranormal stories, religious traditions, and even tales created for children. On the mysterious nature of some legends' origins, Belanger cited the stories of magical, diminutive creatures which are found in cultures throughout the world and date back thousands of years. He theorized that either the story somehow sprang from the collective unconscious of humankind or &quot;the creature was real at some point and people talked about it.&quot; Looking at the psychological component behind legends, Belanger talked about the tale of the tooth fairy that is often imparted to children. He observed that the story helps ease a child through the trauma of losing a tooth and also serves to connect parents to their kids via a shared tradition. &quot;These things are more than just metaphor,&quot; Belanger said of legends like the tooth fairy and Santa Claus, &quot;they really are magical.&quot; \n\n\nWebsite(s):\n-stephenpyne.com\n-ghostvillage.com\nBook(s):\n-Voyager: Seeking Newer Worlds in the Third Great Age of Discovery \n-Picture Yourself Legend Tripping","torrent":{"xt":"urn:btih:d230c641db8291b7adeeb87d531647d7ef17bc7c","amp;dn":"Coast+To+Coast+Am+-+08-05-10+-+History+Of+Voyager+%26+Legend+Tripp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d230c641db8291b7adeeb87d531647d7ef17bc7c","infoHashBuffer":{"type":"Buffer","data":[210,48,198,65,219,130,145,183,173,238,184,125,83,22,71,215,239,23,188,124]},"announce":[],"urlList":[]}}