{"title":"Darksiders [PC-DVD][Multi][Spanish][www.consolasatope.com]","uid":5846121,"size":14769947774,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d242555d9867612f62d4620efc6f029d02915177&amp;dn=Darksiders+%5BPC-DVD%5D%5BMulti%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"consolasatope","files":5,"time":1285185228,"description":"GÃƒÂ©nero: Accion\nIdiomas:\n\nResumen:\nEscrito por el legendario artista de novelas grÃƒÂ¡ficas, Joe Madureira (X-Men,Battle Chasers, The Ultimates), Darksiders: Wrath of War se sitÃƒÂºa en un mundo post-apocalÃƒÂ­ptico devastado por demonios donde las fuerzas del mal han traÃƒÂ­do prematuramente el fin de los tiempos. Enviados en un principio para supervisar la destrucciÃƒÂ³n de la Tierra, los cuatro jinetes del Apocalipsis han sido traicionados por su maestro, despojados de sus poderes y arrojados a la Tierra. Asume el rol de WAR, el primero de los cuatro jinetes, en su brutal bÃƒÂºsqueda de venganza contra las fuerzas que le han traicionado, contando con la ayuda de su corcel fantasma RUIN. CaracterÃƒÂ­sticas:\n\n * Darksiders cuenta con exploraciÃƒÂ³n de mundos abiertos, un profundo sistema de combate y un gran arsenal de armas mÃƒÂ­ticas y modernas.\n * Experimenta el poder divino de WAR: Combina ataques brutales y habilidades sobrenaturales, librando intensos combates en una aventura ÃƒÂ©pica ambientada en un mundo devastado por demonios.\n * ExploraciÃƒÂ³n de mundos abiertos: Cada mundo abierto ofrece la libertad de explorar y experimentar sensaciones ÃƒÂºnicas.\n * Completo arsenal de armas: Desata la furia de WAR con un extenso arsenal de armas, fantÃƒÂ¡sticas o modernas, ademÃƒÂ¡s cuenta con la posibilidad de interactuar con el entorno y utilizar cualquier objeto como arma.\n * Aumentar y desbloquear nuevas habilidades: Personalizado a su estilo de juego, mejora los poderes de WAR y desÃƒÂ¡talos con espectaculares ataques o recoja corazones de alma para aumentar o desbloquear nuevas habilidades.\n * Jinete del Apocalipsis: AprovÃƒÂ©chate de las posibilidades de RUIN, el corcel fantasma de WAR, abriendo camino a travÃƒÂ©s de enemigos o cruzando entornos devastados.\n * Estilo artÃƒÂ­stico de novela grÃƒÂ¡fica: Argumento original y estilo visual original de Joe Madureira (X-Men, Battle Chasers, The Ultimates)\n * Experiencia de juego cinemÃƒÂ¡tica: Aprovechando el poder de la tecnologÃƒÂ­a para la nueva generaciÃƒÂ³n de consolas, Darksiders: Wrath of War te sumerge en un magnÃƒÂ­fico entorno grÃƒÂ¡fico, detallados efectos especiales, iluminaciÃƒÂ³n cinemÃƒÂ¡tica y en una ÃƒÂ©pica banda sonora que complementa la acciÃƒÂ³n del juego\n\nRequisitos minimos:\nSistema Operativo: Windows XP SP3, Windows Vista SP1, Windows 7\nProcesador: Intel Pentium 4 530 3,0Ghz o MD Athlon 64 Processor 3800+ 2,4Ghz\nMemoria: 1GB en XP, 2GB Vista / Windows 7\nT. Grafica: 256MB pixel shader 3 (Nvidia GeForce 8800/ATI Radeon X1900)\nT. Sonido: Compatible con DirectX 9.0c\nDirectX: Version 9.0c\n\nRecomendados:\nProcesador: Intel Dual Core 2.13Ghz o AMD Athlon 64 X2 5200+ Dual Core 2.60Ghz\nMemoria: 2GB en XP, 3GB Vista / Windows 7\nT. Grafica: Nvidia (GeForce GTS 240 o ATI Radeon HD3870 )","torrent":{"xt":"urn:btih:d242555d9867612f62d4620efc6f029d02915177","amp;dn":"Darksiders+%5BPC-DVD%5D%5BMulti%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d242555d9867612f62d4620efc6f029d02915177","infoHashBuffer":{"type":"Buffer","data":[210,66,85,93,152,103,97,47,98,212,98,14,252,111,2,157,2,145,81,119]},"announce":[],"urlList":[]}}