{"title":"Pokemon White [EXP - Patched] - {Japanese}","uid":5837542,"size":65219319,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:d2e8d15cdeef0429ffdbac69b92bec9f877e593c&amp;dn=Pokemon+White+%5BEXP+-+Patched%5D+-+%7BJapanese%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sllim126","files":1,"time":1284785748,"description":"PokÃƒÂ©mon Black &amp; PokÃƒÂ©mon White are the first games of the long anticipated fifth generation of PokÃƒÂ©mon. These games are due for release in Japan in September 18th 2010 and are said to bring about a revolution of PokÃƒÂ©mon. .\n\nThese games are set to feature the previously established assortment of PokÃƒÂ©mon, but will also contain a massive amount of brand New PokÃƒÂ©mon.\n\nIn addition to that, PokÃƒÂ©mon Black and PokÃƒÂ©mon White take the 3D attributes previously included in PokÃƒÂ©mon Diamond, Pearl, Platinum, HeartGold &amp; SoulSilver and take them to new levels by including things like fully 3D bridges and a completely 3D city.\n\nPokÃƒÂ©mon Black &amp; White are set in the region known as Isshu. Isshu is a region far away from the previous regions, requiring you to get there by Boat or Plane. It has a large city called Hiun City, with loads of buildings and sky scrapes for you to explore. Outside of the city and Isshu remains to be predominantly industrialised with various factories and train tracks existing in the various areas. As the games are set in a region far away, the main game will not feature any old PokÃƒÂ©mon until you have beaten the main story. The games also have you playing as protagonists older than the previous playable characters.\n\nPokÃƒÂ©mon Black &amp; PokÃƒÂ©mon White are to be compatible in with the games of the previous generation; Diamond, Pearl, Platinum, HeartGold &amp; SoulSilver through the aspect of the game known as the PokÃƒÂ©Shifter. Through this, some event PokÃƒÂ©mon can be traded over to these games to unlock new things such as the Monster Fox PokÃƒÂ©mon, Zoroark.\n\nThe games also introduce a variety of new multiplayer aspects including the Live Caster, a DSi &amp; 3DS exclusive feature, that allows for video chat with you and your friends. In addition to that, the games can now connect to the Internet for access to a site called the PokÃƒÂ©mon Global Link. The Global Link allows you access to Random Matches on the Internet as well as a section called the Dream World which will allow you to obtain non-Isshu PokÃƒÂ©mon, some of which have new abilities, and items that also cannot be obtained in Isshu such as Berries.\n\nThe game's story features you having to stop Team Plasma, a team who, unlike previous teams, want to do good and intend to stop what they perceive the slavery of PokÃƒÂ©mon caused by trainers. In addition to this, you also have to travel the region in order to get 8 badges once more.","torrent":{"xt":"urn:btih:d2e8d15cdeef0429ffdbac69b92bec9f877e593c","amp;dn":"Pokemon+White+%5BEXP+-+Patched%5D+-+%7BJapanese%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2e8d15cdeef0429ffdbac69b92bec9f877e593c","infoHashBuffer":{"type":"Buffer","data":[210,232,209,92,222,239,4,41,255,219,172,105,185,43,236,159,135,126,89,60]},"announce":[],"urlList":[]}}