{"title":"Things I Left In Havana","uid":5696007,"size":1727398819,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d32908c032d9ea84d73e553340ba55e55dbc5fc2&amp;dn=Things+I+Left+In+Havana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubusdemonoid","files":2,"time":1279307383,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 60 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\n\nVeteran director Manuel Gutierrez Aragon provided a portrait of Cubans in Spain with this Spanish film, a winner of the Silver Spike at the 1997 Valladolid Film Festival. Three sisters -- aspiring actress Nena (Violeta Rodriguez), timid Ludmila (Broselianda Hernandez), and motherly Rosa (Isabel Santos) -- travel from Havana to Madrid to stay with their aunt Maria (Daisy Granados). Aboard the same plane is Barbaro (Luis Alberto Garcia), who stays with penniless but streetwise Igor (Jorge Perugorria), a man who thinks sleeping with Spanish women is the route to upward mobility. The impoverished Igor also creates forged passports to help others depart for Miami. The three girls move in with Maria, who lives downstairs from her friend Azucena (Kiti Manver). Minus papers, the trio is employed at Maria's fur shop. Matchmaker Maria brings Rosa together with awkward Javier (Pepon Nieto), but Javier goes for Nena instead. So does Igor after he spots Nena in a Cubano bar. Igor sleeps that night at Azucena's place, and the proximity to the sisters during the long night's journey into day makes a commotion and fracas almost a certainty. The film's music blends rumba, bolero, and tango.\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d32908c032d9ea84d73e553340ba55e55dbc5fc2","amp;dn":"Things+I+Left+In+Havana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d32908c032d9ea84d73e553340ba55e55dbc5fc2","infoHashBuffer":{"type":"Buffer","data":[211,41,8,192,50,217,234,132,215,62,85,51,64,186,85,229,93,188,95,194]},"announce":[],"urlList":[]}}