{"title":"Helix - Rock You  (2nafish)","uid":5706728,"size":109420548,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d35a814ab9e840e3669edc26910076849fff25f2&amp;dn=Helix+-+Rock+You++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1279721275,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Rock You&quot; is a hard rock song written by Bob Halligan, Jr., and the first track from Helix's 1984 album Walkin' the Razor's Edge. It is best known for its call-and-reponse refrain of &quot;Gimme an R, O, C, K.&quot; Helix's recording reached number 32 in Canada on the Billboard AR chart on August 4, 1984. It also came in at number 101 on the Canadian Billboard Pop chart on September 1, 1984.\n\nSongwriter Bob Halligan offered the band &quot;Rock You&quot; while they were looking for extra material for Walkin' the Razor's Edge in 1984. &quot;Rock You&quot; was road tested in concert, played for the first time at the El Rosa Villa in Columbus, Ohio. Helix vocalist Brian Vollmer claims that he wrote a new verse for the song but was denied a co-writing credit. The track was produced by the band with Rodney Mills, who was brought in due to his earlier mixing work with 38 Special.\n\nThe chorus of the song has lent itself to Vollmer's autobiography, Gimme An R!, as well as many Helix T-shirts and merchandise.\n\nWalkin' the Razor's Edge was the fourth album by the Canadian heavy metal band Helix. It was released on the Capitol Records label in 1984.\n\nA music video was made for the Crazy Elephant cover &quot;Gimme Gimme Good Lovin'&quot;. Two versions of this video were filmed: One for music video channels, and the other being an &quot;adult&quot; version featuring topless models including a then 16-year-old porn star Traci Lords. This version was aired on the Playboy Channel in the United States.\n\nThe band also made a promotional video for their A Foot in Coldwater cover, &quot;(Make Me Do) Anything You Want&quot;, as well as &quot;Rock You&quot;. The video for &quot;Rock You&quot;, filmed in a quarry in Kitchener, Ontario, is perhaps best known for the image of guitar player Brent Doerner emerging from the water to play his guitar solo.\n\nHelix are a Canadian hard rock/heavy metal band. They formed in 1974, and are best known for their 1984 single &quot;Rock You&quot;. The original lineup was formed by drummer Bruce Arnold, and consisted of lead vocalist Brian Vollmer, guitarists Ron Watson and Rick &quot;Minstrel&quot; Trembley, keyboardist Don Simmons, and bassist Keith &quot;Bert&quot; Zurbrigg. Their most well known lineup, however, and the one that recorded &quot;Rock You&quot;, was the 80's version of the band: Vollmer on vocals, accompanied by guitarists Brent &quot;The Doctor&quot; Doerner and Paul Hackman, bassist Daryl Gray, and drummer Greg &quot;Fritz&quot; Hinz. The history of the band has been marked by many lineup changes, with Vollmer being the sole constant member and only remaining member of the original lineup. Although guitarist Paul Hackman was killed in a tour bus accident in 1992, the surviving members of the 80's lineup reunited in 2009 for an album and continue to tour in 2010.\n\nHelix have toured with bands such as Kiss, Aerosmith, Rush, MÃƒÆ’Ã‚Â¶tley CrÃƒÆ’Ã‚Â¼e, Alice Cooper, Whitesnake, Night Ranger, Heart, Quiet Riot, W.A.S.P., Ian Gillan, and MotÃƒÆ’Ã‚Â¶rhead among others.\n\nTheir most recent studio album is 2009's Vagabond Bones.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d35a814ab9e840e3669edc26910076849fff25f2","amp;dn":"Helix+-+Rock+You++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35a814ab9e840e3669edc26910076849fff25f2","infoHashBuffer":{"type":"Buffer","data":[211,90,129,74,185,232,64,227,102,158,220,38,145,0,118,132,159,255,37,242]},"announce":[],"urlList":[]}}