{"title":"The Disappearing Male CBC 2008","uid":5922036,"size":192738557,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d3e1e5c96fa9efceefe4ff9b06d723586d1e45b0&amp;dn=The+Disappearing+Male+CBC+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john1942","files":1,"time":1288457437,"description":"The Disappearing Male CBC 2008\n\n\n183.81 MB/43:43 min\n\n\n\n&quot;We are conducting a vast toxicological experiment in which our children and our children's children are the experimental subjects.&quot; Dr. Herbert Needleman\n\n\nThe Disappearing Male is about one of the most important, and least publicized, issues facing the human species: the toxic threat to the male reproductive system.\n\n\nThe last few decades have seen steady and dramatic increases in the incidence of boys and young men suffering from genital deformities, low sperm count, sperm abnormalities and testicular cancer.\n\n\nSome researchers say that declining male fertility rates could be the first sign of extinction.\n\n\nThe Disappearing Male takes a close and disturbing look at what many doctors and researchers now suspect are responsible for many of these problems: a class of common chemicals that are ubiquitous in our world.\n\n\n\n\n*There are more than 20 heavily industrialized nations where the birth of baby boys has declined every year for the past 30 years - amounting to 3 million fewer baby boys.\n\n\n* The number of boys born with penis abnormalities and genital defects has increased by 200% in the past two decades.\n\n*Cerebral palsy, autism and dyslexia have higher rates among males.\n\n\n* The average sperm count of a North American college student today is less than half of what it was 50 years ago.\n\n* The quality of sperm is declining. Eighty-five per cent of the sperm produced by a healthy male is DNA-damaged.\n\n* Damaged sperm have been linked to a 300% increase in testicular cancer - a form of cancer that affects young men in their 20s and 30s.\n\n* The chemical industry has developed more than 90,000 man-made chemicals in the last sixty years. Eighty-five percent of them have never undergone testing for their impact on the human body.\n\n\nFound in everything from shampoo, sunglasses, meat and dairy products, carpet, cosmetics and baby bottles, they are called &quot;hormone mimicking&quot; or &quot;endocrine disrupting&quot; chemicals and they may be starting to damage the most basic building blocks of human development.\n\nDaresearcher/concen\n\n\n","torrent":{"xt":"urn:btih:d3e1e5c96fa9efceefe4ff9b06d723586d1e45b0","amp;dn":"The+Disappearing+Male+CBC+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3e1e5c96fa9efceefe4ff9b06d723586d1e45b0","infoHashBuffer":{"type":"Buffer","data":[211,225,229,201,111,169,239,206,239,228,255,155,6,215,35,88,109,30,69,176]},"announce":[],"urlList":[]}}