{"title":"Honey West Disc 3","uid":5738257,"size":1430363136,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d5934154babecffb0bb9d334b78fc4e4fec87088&amp;dn=Honey+West+Disc+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CharlieTann","files":1,"time":1280911784,"description":"As televisions first title roll female Private Eye, Honey West would take on any tough case. After the death of her father, the sexy private detective took over his high-tech PI firm. Being assisted by the rugged Sam Bolt and her pet ocelot Bruce, she could handle herself mingling with millionaires just as well as scaling a thirty foot wall.\n\nAnne Francis, John Ericson, Bruce the Ocelot\n\n\nDISC THREE: \n\n&quot;How Brillig, O, Beamish Boy&quot; - written by Don Ingalls, directed by Ida Lupino: Sam is kidnapped and held for ransom. Can Honey save him? This episode features an exploding pen gadget. (25:28)\n\n&quot;King of The Mountain&quot; - written by Jay Simms, directed by Thomas Carr: Honey goes undercover as a private nurse for a rich, but possibly shady, recluse. A different type of camera watch is used in this episode. (25:18)\n\n&quot;It's Earlier Than You Think&quot; - written by Marc Brandel, directed by James Brown: A dying man dressed up like Abraham Lincoln bursts into Honey's office with a very old newspaper. Who is after him and why? A hidden compartment ring gadget is featured in this episode. (25:28)\n\n&quot;The Perfect Un-Crime&quot; - written by Ken Kolb, directed by Sidney Miller: A man with a good conscience hires Honey to put back the money he stole from the company he works for. (25:29)\n\n&quot;Like Visions and Omens and All That Jazz&quot; - written by Tony Barrett, directed by John Florea: An heiress hires Honey to keep an eye on her daughter, who she believes has been targeted for murder. (25:28)\n\n&quot;Don't Look Now, But Isn't That Me&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by James Brown: Honey's seeing double when an imposter, looking just like her, is stealing valuable furs. Anne Francis is a hoot in the dual role of Pandora Fox. A bolo belt gadget is used in this episode. (25:27)\n\n&quot;Come To Me, My Litigation Baby&quot; - written by Gwen Bagni &amp; Paul Dubov, directed by Thomas Carr: An insurance company hires Honey to run surveillance on a recently crippled man to see if he truly sustained his injuries or is in fact a fraud. This episode features the humorous &quot;Honey West Walk&quot; dance routine. (25:16)\n\nExtra Features:\nVintage Commercials - Lucky Strike cigarettes, Pall Mall cigarettes, Traffic Safety, El Producto cigars, Prell shampoo, Chanel #5 perfume (X2), Vectra pantyhose, American Motors, Chiffon margarine, Crest toothpaste (X2), The UN in Action, Muriel cigars, Seven Seas salad dressing. 15 commercials total. (11:08)\n\nTotal Running Time Approximately 189 Min.\n","torrent":{"xt":"urn:btih:d5934154babecffb0bb9d334b78fc4e4fec87088","amp;dn":"Honey+West+Disc+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5934154babecffb0bb9d334b78fc4e4fec87088","infoHashBuffer":{"type":"Buffer","data":[213,147,65,84,186,190,207,251,11,185,211,52,183,143,196,228,254,200,112,136]},"announce":[],"urlList":[]}}