{"title":"The Gaslight Anthem - American Slang (2nafish)","uid":5919038,"size":134146052,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d59a00cd45e3cb711fd13068d873213577fd9494&amp;dn=The+Gaslight+Anthem+-+American+Slang+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1288338463,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nAmerican Slang is the third studio album by New Jersey based rock group The Gaslight Anthem. It was released on June 15, 2010 on SideOneDummy Records, which released their previous album, The '59 Sound. The album was produced by 'The '59 Sound producer Ted Hutt.\n\nFallon stated in an NYC in-studio session, &quot;All these songs came to me in my head. I didn't sit down at the guitar or piano or write lyrics, they all just were kind of there one day.&quot;\n\nLead singer songwriter Brian Fallon said that American Slang will move away from the 1950's inspired sound of The '59 Sound. He began writing for the new album in the summer of 2009 while on tour in support of The '59 Sound.\n\nThe album was recorded and produced at the New York Magic Shop record studio.\n\nUncut magazine (July 2010 issue) gave American Slang a 5 star rating and declared it its 'album of the month'. &quot;American Slang delivers spectacularly on all expected fronts. Everything that was great about The '59 Sound is here, but the sound is even bigger, epic without getting blustery.&quot; Rock Sound magazine gave the album a 9/10 and also declared it its 'album of the month'.\n\nBig Cheese magazine (June 2010 issue) also gave the album 5 stars, saying that &quot;The Gaslight Anthem have created the all-American album that travels by keeping its subject matter to that which everyone can relate to: the pain of a broken heart, salvation from the radio and love by the lights of the bar. The record is a perfect marriage of expert storytelling, superb musicianship and classic melodies.&quot;\n\nClassic Rock magazine gave the album 8/10 and declared that &quot;New and old fans alike will be speaking American Slang this summer.&quot;\n\nThe album reached the #3 position on the UK midweek album charts during its first week.\n\nThe album debuted at #16 on the Billboard 200, moving 27,000 copies, and was the #1 independent album for that week.\n\n&quot;Rolling Stone&quot; magazine gave the album 3Ã‚Â½ stars out of five, saying that &quot;American Slang arrives with serious advance buzz: The choruses are more sculpted, but the band's tough-as-leather rush is as hard as ever, and Fallon howls so hard, he sounds like he's aiming to get a section of the Jersey Turnpike named after him.&quot;\n\nThe album currently holds a Metascore of 80% on Metacritic, based on 28 professional reviews.\n\nThe Gaslight Anthem are an American punk band from New Brunswick, New Jersey, consisting of Brian Fallon (lead vocals, guitar), Alex Rosamilia (guitar, backing vocals), Alex Levine (bass guitar, backing vocals) and Benny Horowitz (drums, percussion, tambourine). They released their first album, Sink or Swim, on XOXO Records in May 2007, and their second album, The '59 Sound, on SideOneDummy Records in August 2008. The band's third album, American Slang, was released on June 15, 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d59a00cd45e3cb711fd13068d873213577fd9494","amp;dn":"The+Gaslight+Anthem+-+American+Slang+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d59a00cd45e3cb711fd13068d873213577fd9494","infoHashBuffer":{"type":"Buffer","data":[213,154,0,205,69,227,203,113,31,209,48,104,216,115,33,53,119,253,148,148]},"announce":[],"urlList":[]}}