{"title":"Noelia - Toco La Luz (2nafish)","uid":5914216,"size":155314180,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d66a50908e356a91ed839b9acc8220e9d9e4ded7&amp;dn=Noelia+-+Toco+La+Luz+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1288167404,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video is in Spanish.\n\n\nNoelia is the eponymous debut album of Puerto Rican singer Noelia. The album was released in 1999 and peaked at #7 on Billboard's Top Latin Albums.\n\nThe album produced the hit single &quot;TÃƒÂº&quot;, which was written by popular songwriter EstÃƒÂ©fano. The song peaked at #5 on Billboard's Hot Latin Tracks.\n\nNoelia Lorenzo Monge (born August 31, 1977 in San Juan, Puerto Rico), mostly known as Noelia, is a Puerto Rican pop singer who rose to fame in 1999. She is the first daughter of Puerto Rican singer Yolandita Monge.\n\nHer self-titled debut album was certified as a gold album in the United States. During her career she has had nine Latin Billboard Top 40 hits.\n\nNoelia started working on her first full-length album in 1998. The self-titled album was finally released in 1999, making her TV debut in Voces en Funcion. The album produced the hit single &quot;Tu&quot;, written by EstÃƒÂ©fano.\n\nIn 2000 she released her second album, Golpeando Fuerte.\n\nHer third album, Natural, released in 2003 featured another hit song, &quot;ClÃƒÂ¡vame Tu Amor&quot;, which peaked at #5 on Billboard Hot Latin Tracks. The album also featured songwriting contributions from her then boyfriend, Alexis GrullÃƒÂ³n.\n\nIn 2004, she surprised with her fourth studio album titled Melao, which was a fusion of pop with reggaeton. The album was produced by reggaeton producer, DJ Eric, and features Yamil sharing lead vocals with Noelia. They also co-wrote most of the songs of the album.\n\nIn 2006, she returned to her musical roots with the album 40 Grados, produced by AdriÃƒÂ¡n Posse. The album featured the single &quot;Como Duele&quot;, which was nominated by Billboard as Pop Song of the Year. The song was also chosen as the theme for the Mexican telenovela Barrera de Amor and peaked at #8 on Billboard Hot Latin Songs.\n\nIn 2007, she released her sixth full-length album titled Volverte a Ver.\n\nShe is currently working on her first English language album. The album will be titled Caribbean Queen and the first single, &quot;Caribbean Queen Reloaded&quot; was released in May 2008. The song is a cover version of Billy Ocean's hit song of 1984.\n\nIn June 2007, a sex tape of Noelia and former boyfriend Yamil started circulating on the Internet, which caused a media hype around her person. In August 2007, Noelia accused her stepfather and former manager, Topy Mamery, of sexually assaulting her back in 2003; she claimed to have filed a lawsuit, calling singer Ricardo Montaner as a witness. However, Mamery denied having received any lawsuit, and Montaner denied ever having been called to testify. During an interview with Primer Impacto, Montaner was asked about this and he said, &quot;I have never seen anything weird (between Noelia and Mamery). Mamery is a gentleman that has loved Noelia as her daughter.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d66a50908e356a91ed839b9acc8220e9d9e4ded7","amp;dn":"Noelia+-+Toco+La+Luz+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d66a50908e356a91ed839b9acc8220e9d9e4ded7","infoHashBuffer":{"type":"Buffer","data":[214,106,80,144,142,53,106,145,237,131,155,154,204,130,32,233,217,228,222,215]},"announce":[],"urlList":[]}}