{"title":"Hidden History 1916 - the man who lost Ireland RTE","uid":5855846,"size":1141737548,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d71fbbbfcf31f13522441382637f32ed1c6417fe&amp;dn=Hidden+History+1916+-+the+man+who+lost+Ireland+RTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"robbieirish","files":1,"time":1285611697,"description":"A reconstruction of the secret court martial following Patrick Pearse's conditional surrender on April 29th, 1916. The documentary focuses on General St John Maxwell - soldier, Scots Presbyterian and staunch supporter of the Empire - who was appointed military governor of Ireland in the immediate aftermath of the 1916 Rising. It is suggested that Maxwell made a number of crucial errors of judgement and procedure that ultimately shaped Irish history. The documentary is structured around eyewitness testimonies, extracts from private papers, and official government records - particularly statements contained in the Irish Bureau of Military History released to researchers in March 2003. A key player in the court martial was William E. Wylie, the man who was appointed Crown Prosecutor during the trials. This film also asks some sensitive question - why, for example, was Eamon De Valera spared execution? Did Countess Markievicz really break down during her trial? and why did Willie Pearse, alone among those executed, plead guilty to charges of treason? Contributors include Diarmaid Ferritter, Charles Townsend, Declan Kiberd, and Garret Fitzgerald.\n\nPlease seed for as long as possible ","torrent":{"xt":"urn:btih:d71fbbbfcf31f13522441382637f32ed1c6417fe","amp;dn":"Hidden+History+1916+-+the+man+who+lost+Ireland+RTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d71fbbbfcf31f13522441382637f32ed1c6417fe","infoHashBuffer":{"type":"Buffer","data":[215,31,187,191,207,49,241,53,34,68,19,130,99,127,50,237,28,100,23,254]},"announce":[],"urlList":[]}}