{"title":"Plaga final.DVDRIP.(spanish).","uid":5923331,"size":781357056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d8c51cc8208786e77e1d9a1ebdf4f44e9d45410d&amp;dn=Plaga+final.DVDRIP.%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1288508291,"description":"Titulo: Plaga Final\nTitulo Original: Pars Vite Et Reviens Tard\nGÃƒÂ©nero: Thriller\nNacionalidad: Francia\nAÃƒÂ±o: 2007\nDirector: RÃƒÂ©gis Wargnier\nGuion: Julien Rappeneau, Ariane Fert, Harriet Marin, Lawrence Shore, RÃƒÂ©gis Wargnier\nReparto: JosÃƒÂ© GarcÃƒÂ­a, Lucas Belvaux, Marie Gillain, Olivier Gourmet, Nicolas CazalÃƒÂ©, Linh Dan Pham, Michel Serrault\n\nSinopsis: Basada en la novela homÃƒÂ³nima de Fred Vargas.\nAl comisario Jean-Baptiste Adamsberg no le gusta la primavera. DesconfÃƒÂ­a del aumento de sabia, de los deseos de evasiÃƒÂ³n, del desencadenamiento de las pulsiones, todos estos signos que anuncian el retorno de los dÃƒÂ­as hermosos... Y Adamsberg tiene un motivo... Su prometida, Camille, ha hecho su maleta y su ausencia deja alicaÃƒÂ­do al comisario, en el momento en el que mÃƒÂ¡s la necesita: alguna cosa acaba de caer sobre la capital, un enigma portador de maldiciÃƒÂ³n, que podrÃƒÂ­a convertirse en desgracia, si no se toma una decisiÃƒÂ³n firme... ExtraÃƒÂ±as seÃƒÂ±ales se extienden a las puertas de los edificios de ParÃƒÂ­s, y palabras inquietantes, misteriosas, aparecen en lugares pÃƒÂºblicos... Y luego llega lo que Adamsberg temÃƒÂ­a: una primera muerte, el cuerpo ennegrecido, la cara descompuesta por un gesto de terror, los signos de la peste... Y es entonces cuando se anuncia el enigma, el regreso de la terrible plaga, pero con una variante sagrada, y parece que alguien controla la enfermedad y la lleva donde quiere... ","torrent":{"xt":"urn:btih:d8c51cc8208786e77e1d9a1ebdf4f44e9d45410d","amp;dn":"Plaga+final.DVDRIP.%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8c51cc8208786e77e1d9a1ebdf4f44e9d45410d","infoHashBuffer":{"type":"Buffer","data":[216,197,28,200,32,135,134,231,126,29,154,30,189,244,244,78,157,69,65,13]},"announce":[],"urlList":[]}}