{"title":"Connie Francis - The Very Best Of  FLAC","uid":5700293,"size":309950262,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:da2e4b538f17f6cf3c82f0359dd933b07dc610f9&amp;dn=Connie+Francis+-+The+Very+Best+Of++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"keeybee","files":30,"time":1279477911,"description":"Please seed!\n\nConnie Francis (born Concetta Rosa Maria Franconero; December 12, 1938) is an American pop singer, and the top-charting female vocalist of the 1950s and 1960s. She is best known for her downbeat ballads delivered in her trademark sobbing, emotive style. In addition to her signature song, &quot;Who's Sorry Now?&quot;, her many hits include &quot;Lipstick on Your Collar&quot;, &quot;Where the Boys Are&quot;, and &quot;Stupid Cupid&quot;. She topped the Billboard Hot 100 singles chart on three occasions with &quot;Everybody's Somebody's Fool&quot;, &quot;My Heart Has a Mind of Its Own&quot; and &quot;Don't Break the Heart That Loves You&quot;. She also was known for her early relationship with the singer and teen heart-throb Bobby Darin. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Connie_Francis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Connie_Francis&lt;/a&gt;\n\n\nConnie Francis - The Very Best Of Connie Francis\nThis CD 1986\n\n01  Connie Francis - The Very Best Of Connie Francis - Who's Sorry Now([Mono)\n02  Connie Francis - The Very Best Of Connie Francis - I'm Sorry I Made You Cry (Mono)\n03  Connie Francis - The Very Best Of Connie Francis - Stupid Cupid (Mono)\n04  Connie Francis - The Very Best Of Connie Francis - Fallin' [Mono]\n05  Connie Francis - The Very Best Of Connie Francis - My Happiness (Stereo)\n06  Connie Francis - The Very Best Of Connie Francis - If I Didn't Care (Mono)\n07  Connie Francis - The Very Best Of Connie Francis - Lipstick On Your Collar (Stereo)\n08  Connie Francis - The Very Best Of Connie Francis - Frankie (Stereo)\n09  Connie Francis - The Very Best Of Connie Francis - You're Gonna Miss Me (Mono)\n10  Connie Francis - The Very Best Of Connie Francis - Among My Souvenirs (Mono)\n11  Connie Francis - The Very Best Of Connie Francis - Teddy (Mono)\n12  Connie Francis - The Very Best Of Connie Francis - Everybody's Somebody's Fool (Stereo)\n13  Connie Francis - The Very Best Of Connie Francis - My Heart Has A Mind Of Its Own (Stereo)\n14  Connie Francis - The Very Best Of Connie Francis - Many Tears Ago (Stereo)\n15  Connie Francis - The Very Best Of Connie Francis - Where The Boys Are (Stereo)\n16  Connie Francis - The Very Best Of Connie Francis - Breakin' In A Brand New Broken Heart (Stereo)\n17  Connie Francis - The Very Best Of Connie Francis - Don't Break The Heart That Loves You (Stereo)\n18  Connie Francis - The Very Best Of Connie Francis - Second Hand Love (Stereo)\n19  Connie Francis - The Very Best Of Connie Francis - Vacation (Stereo)\n20  Connie Francis - The Very Best Of Connie Francis - I'm Gonna Be Warm This Winter (Mono)\n21  Connie Francis - The Very Best Of Connie Francis - Follow The Boys (Stereo)\n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:gifqxqy5ldde&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:gifqxqy5ldde&lt;/a&gt;\nOn AMG the album cover is different from the one on this CD. \n","torrent":{"xt":"urn:btih:da2e4b538f17f6cf3c82f0359dd933b07dc610f9","amp;dn":"Connie+Francis+-+The+Very+Best+Of++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da2e4b538f17f6cf3c82f0359dd933b07dc610f9","infoHashBuffer":{"type":"Buffer","data":[218,46,75,83,143,23,246,207,60,130,240,53,157,217,51,176,125,198,16,249]},"announce":[],"urlList":[]}}