{"title":"China Salvaje - Cap.1- El Corazon del Dragon","uid":5842030,"size":556025856,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:da5a58a98da805d163cc5df702da84bb1f684fed&amp;dn=China+Salvaje+-+Cap.1-+El+Corazon+del+Dragon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fanclubt","files":1,"time":1285005534,"description":"China salvaje (2008)\n\nTÃƒÂ­tulo original: Wild China \n\n\nIdioma: Castellano\nTamaÃƒÂ±o: 530 MB \nDuraciÃƒÂ³n: 48 min\n\nLa prestigiosa Unidad de Historia Natural de la BBC ha conseguido tener un acceso sin precedentes\n a todos los rincones del inmenso paÃƒÂ­s captando  imÃƒÂ¡genes impresionantes y descubrimientos asombrosos\n\n Desde los brillantes picos del Himalaya hasta el Mar de China y sus tumultuosas aguas, China abarca \n una deslumbrante variedad de paisajes. MontaÃƒÂ±as, bosques tropicales, desiertos y cuevas de este enorme\n y enigmÃƒÂ¡tico paÃƒÂ­s son el hogar de una variopinta vida salvaje que va desde el panda gigante, el tigre,\n el mono dorado de nariz chata y el cisne salvaje al gigantesco y pacÃƒÂ­fico tiburÃƒÂ³n ballena y las mÃƒÂ¡s\n espectaculares flores tropicales.\n\n Al viajar por el desfiladero mÃƒÂ¡s profundo del Planeta y ver cÃƒÂ³mo los pescadores utilizan cormoranes\n para capturar el pescado o cÃƒÂ³mo las serpientes de Pallas atrapan pÃƒÂ¡jaros al vuelo, resulta evidente \n que este paÃƒÂ­s increÃƒÂ­ble nos va a revelar las mÃƒÂ¡s extraordinarias sorpresas sobre su vida salvaje.\n\n \n\n\nCap 1 El Corazon Del Dragon\n\nEl ÃƒÂºltimo mundo secreto, China. Durante siglos los que viajaban a China hablaban de paisajes mÃƒÂ¡gicos y de criaturas sorprendentes. La civilizaciÃƒÂ³n China es la mÃƒÂ¡s antigua del mundo y actualmente, la mÃƒÂ¡s poblada, con mÃƒÂ¡s de mil millones de personas. AquÃƒÂ­ conviven mÃƒÂ¡s de 50 grupos ÃƒÂ©tnicos y una amplia variedad de estilos de vida tradicionales, muchas veces en estrecha relaciÃƒÂ³n con la Naturaleza.\n\nSabemos que China se enfrenta a inmensos problemas sociales y medioambientales, pero aÃƒÂºn existen parajes de una gran belleza. En China se hallan las montaÃƒÂ±as mÃƒÂ¡s altas del mundo, vastos desiertos de calor sofocante o de frÃƒÂ­o entumecedor. Bosques nublados que dan cobijo a extraÃƒÂ±as criaturas-\n\nVerdes llanuras en inmensos horizontes y exuberantes mares tropicales. Ahora por primera vez, podemos explorar la totalidad de este gran paÃƒÂ­s, conocer a algunas de las sorprendentes y exÃƒÂ³ticas criaturas que viven aquÃƒÂ­ y pensar en la relaciÃƒÂ³n de las personas y las criaturas salvajes de China, con el extraordinario paisaje en el que viven. Esto es, China Salvaje.\n\n","torrent":{"xt":"urn:btih:da5a58a98da805d163cc5df702da84bb1f684fed","amp;dn":"China+Salvaje+-+Cap.1-+El+Corazon+del+Dragon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da5a58a98da805d163cc5df702da84bb1f684fed","infoHashBuffer":{"type":"Buffer","data":[218,90,88,169,141,168,5,209,99,204,93,247,2,218,132,187,31,104,79,237]},"announce":[],"urlList":[]}}