{"title":"Shock [1946] Vncent Price","uid":5721287,"size":304782757,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da8b94c536eee88caed563151187589d817ead82&amp;dn=Shock+%5B1946%5D+Vncent+Price&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"frankie-boy","files":5,"time":1280303051,"description":" &lt;a href=&quot;http://bayimg.com/gAnLdaAco&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/gAnLdaAco&lt;/a&gt;\n\nShock (1946) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0038937/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0038937/&lt;/a&gt;\n\nShock is a 1946 film noir directed by Alfred L. Werker.\n\nThe film tells the story of a psychiatrist, Dr. Cross, (Vincent Price), who is treating a young woman, Janet Stewart (Anabel Shaw), who is in a coma-state, brought on when she heard loud arguing, went to her window and saw a man strike his wife with a candlestick and kill her. It also stars Lynn Bari as Dr. Cross's nurse/lover, Elaine Jordan.\n\n\n Vincent Price ...  Dr. Richard Cross \n Lynn Bari ...  Nurse Elaine Jordan \n Frank Latimore ...  Lt. Paul Stewart \n Anabel Shaw ...  Mrs. Janet Stewart \n Stephen Dunne ...  Dr. Stevens (as Michael Dunne) \n Reed Hadley ...  District Attorney O'Neill \n Renee Carson ...  Miss Hatfield - Head Nurse \n Charles Trowbridge ...  Dr. Franklin Harvey \n\n&quot;Shock&quot;was originally intended as a &quot;B&quot; unit programmer by 20th Century Fox Studios, but the initial audience response to the film was so positive that the studio chose to reissue the movie as an &quot;A&quot; despite the fact that the running time is approximately seventy minutes or so. Vincent Price had appeared in a series of important yet clearly supporting roles while under contract at Fox (He had managed to grab a lead or two while at Universal, most notably in &quot;The Invisible Man Returns,&quot; earlier in his career). The success of this picture recommended Price to producers as a star of sufficient power to carry a film as a leading player in his own right.\n\n&quot;Shock&quot; was directed by Alfred Werker who is best known for &quot;The Adventures of Sherlock Holmes&quot; and the police procedural noir &quot;He Walked By Night&quot; for which he received directorial credit despite the fact that an unbilled Anthony Mann made significant contributions to the finished film. The supporting cast is first rate: Lynn Bari, a fine actress from an era in which real women had curves in contrast to the blend of anorexia and heroin chic that passes for feminine beauty today, is well cast as Cross's scheming mistress; Frank Latimore seems surprisingly handsome and fit despite his recent internment as a prisoner of war; Reed Hadley is a police detective trying to close the file on the accidental death of Margaret Cross whose body was found in a canyon ravine near her mountain lodge and Charles Trowbridge is a consulting psychiatrist who cannot understand why Janet Stewart isn't responding to treatments at the sanitarium of her former pupil and protege, Dr. Cross.\n\n\nAbove and beyond the typical characteristics of the horror film genre, reviewer Bosley Crowther of The New York Times took particular offense to the film's treatment of Price as a psychiatrist who attempts to do away with his patient, a woman who has lost her mind after witnessing the murder her own doctor had committed. Coming in the wake of World War II, in which so may people had suffered shock and could benefit from treatment of their anxieties, Crowther asked the &quot;critical observer to protest in no uncertain tones&quot; the movie's &quot;social disservice&quot; in its fostering &quot;apprehension against the treatment of nervous disorders&quot;, deploring the lack of consideration for those in need of treatment evidenced by producer Aubrey Schenck and distributor Twentieth-Century Fox.\n\nPhilip K. Scheuer of the Los Angeles Times took no such offense, calling the film a &quot;nominal 'B' feature&quot;, which screenplay author &quot;Eugene Ling and Director Alfred Werker have imbued... with a grade-A suspense&quot;.[","torrent":{"xt":"urn:btih:da8b94c536eee88caed563151187589d817ead82","amp;dn":"Shock+%5B1946%5D+Vncent+Price","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da8b94c536eee88caed563151187589d817ead82","infoHashBuffer":{"type":"Buffer","data":[218,139,148,197,54,238,232,140,174,213,99,21,17,135,88,157,129,126,173,130]},"announce":[],"urlList":[]}}