{"title":"Helms-Ramparts We Watched(conservative US senator)(1984)","uid":5726837,"size":7927155,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:dabdad7a6759d7ada0133cdb422124063004e472&amp;dn=Helms-Ramparts+We+Watched%28conservative+US+senator%29%281984%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1280487716,"description":"This is Jesse Helms's amazing book The Ramparts We Watched (1984) which is a recollection of this former US senator's fight for conservative American values. Jesse Helms was a reporter, television-radio executive and U.S. Senator. The Almanac of American Politics labeled the conservative Helms a &quot;Jeremiah&quot; for believing in an imminent doom and warning against the encroaching dangers of big government, communism, and abortion - to name three examples. After a decade of service in the United States Senate, and at the urging of many kind friends and colleagues, Helms decided to make available to all who are students of that tumultuous era the insights of one senator who was on the scene at the time when the American people began to reclaim and reassert their heritage of limited, constitutional government. As Senator, Helms practiced a conservatism that either outraged or pleased. He was labeled &quot;Senator No&quot; by the News and Observer for his tendency to vote against government programs. How, along with others imbued with a deep love of America, he followed through in the practical defense of these principles, these ramparts of freedom, is the substance of this fascinating book. 127 pages, some pictures. A must read for everyone.","torrent":{"xt":"urn:btih:dabdad7a6759d7ada0133cdb422124063004e472","amp;dn":"Helms-Ramparts+We+Watched%28conservative+US+senator%29%281984%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dabdad7a6759d7ada0133cdb422124063004e472","infoHashBuffer":{"type":"Buffer","data":[218,189,173,122,103,89,215,173,160,19,60,219,66,33,36,6,48,4,228,114]},"announce":[],"urlList":[]}}