{"title":"Chris Young - Voices (Xvid-2nafish) 1080p","uid":5743113,"size":189682464,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:db02d494be6afe349422eaa27ed30dbf4eb1b502&amp;dn=Chris+Young+-+Voices+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1281095505,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:01\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 8021 Kbps\nQuality Factor : 0.17 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Voices&quot; is the title of a song co-written and recorded by American country music singer Chris Young. After charting in mid-2008 on the Hot Country Songs charts, &quot;Voices&quot; is set to be re-released in July 2010 following Young's first two Number one singles, &quot;Gettin' You Home (The Black Dress Song)&quot; and &quot;The Man I Want to Be.&quot; The song is included on his album The Man I Want to Be, as well as a digital extended play also titled Voices.\n\nAt the 2008 CMA Music Fest, Young offered fans the opportunity to make personal recordings of dedications to special people in their lives. These fans received e-mails containing the song and the dedications.\n\nYoung told The Boot that he wanted to re-release it because it was popular with his fans. It was accompanied by a digital extended play also titled Voices, comprising that song and three cover songs, &quot;to share with fans some of the musical voices that helped make me the man I am today.&quot;\n\nHe has also recorded a music video for the song, directed by David McClister. The video includes members of his family.\n\nKevin J. Coyne of Country Universe gave the song a B+ upon its original release, saying that Young's voice &quot;is warm and sincere, and on the subject of voices&quot; but criticizing the hook of &quot;I hear voices all the time.&quot;\n\nThe Man I Want to Be is the second studio album of American country music artist Chris Young. It was released on September 1, 2009 via RCA Nashville. The lead-off single, &quot;Voices&quot;, was released in May 2008, and peaked at #37 on the Hot Country Songs  chart, becoming Young's first Top 40 country hit. The album was supposed to have been released in August 2008, but was delayed. The second and third singles, &quot;Gettin' You Home (The Black Dress Song)&quot; and the title track, which were released in January 2009 and November 2009, respectively, both reached Number One on the country charts.\n\nChristopher Alan &quot;Chris&quot; Young (born June 12, 1985 in Murfreesboro, Tennessee) is an American country music artist. In 2006, he was declared the winner of the television program Nashville Star, a singing competition which aired on the USA Network. After winning, he was signed to RCA Records Nashville, releasing his self-titled debut album that year. It produced two chart singles on the Hot Country Songs charts in &quot;Drinkin' Me Lonely&quot; and &quot;You're Gonna Love Me&quot;. A second album, The Man I Want to Be, was released September 1, 2009. It includes the singles &quot;Voices&quot;, &quot;Gettin' You Home (The Black Dress Song)&quot;, and &quot;The Man I Want to Be&quot;; the latter two have reached Number One on the country singles chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:db02d494be6afe349422eaa27ed30dbf4eb1b502","amp;dn":"Chris+Young+-+Voices+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db02d494be6afe349422eaa27ed30dbf4eb1b502","infoHashBuffer":{"type":"Buffer","data":[219,2,212,148,190,106,254,52,148,34,234,162,126,211,13,191,78,177,181,2]},"announce":[],"urlList":[]}}