{"title":"Story Of A Junkie [Troma] [1987].avi","uid":5909960,"size":733711596,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dbd2c409e66ef30d0a25f590f092094f920102d4&amp;dn=Story+Of+A+Junkie+%5BTroma%5D+%5B1987%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Isocre","files":1,"time":1288012159,"description":"Story of a Junkie is a 1987 drama film directed by Lech Kowalski and starring John Spaceley. Distributed by Troma Entertainment. Filmed in documentary-style, the film follows the character of Gringo, a young man looking for fortune in New York, only to fall into heroin addiction.\n\nThe movie has amassed quite a reputation in certain circles for its depictions of hard drug usage in New York City's East Village area. Many of the cast members, including leading man John Spaceley, are actual junkies. The numerous shooting-up sequences are reportedly entirely real, as are many of the drug dens and their denizens. Perhaps even more notable than the cinema verite structure is the almost total lack of moralizing on the part of the producers or its characters.\n\nLead actor Spaceley died in the early 1990s, reportedly from AIDS, which he contracted through intravenous drug use. His final moments are chronicled in yet another Lech Kowalski film, &quot;Born to Lose: The Last Rock &amp; Roll Movie&quot;, a documentary about deceased former New York Dolls guitarist Johnny Thunders.\n\nTroma Entertainment hails Story of a Junkie as one of the company's best films; it's one of the most well-known outside of the films directed by Troma founders Lloyd Kaufman and Michael Herz.","torrent":{"xt":"urn:btih:dbd2c409e66ef30d0a25f590f092094f920102d4","amp;dn":"Story+Of+A+Junkie+%5BTroma%5D+%5B1987%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbd2c409e66ef30d0a25f590f092094f920102d4","infoHashBuffer":{"type":"Buffer","data":[219,210,196,9,230,110,243,13,10,37,245,144,240,146,9,79,146,1,2,212]},"announce":[],"urlList":[]}}