{"title":"ZZ Top - Just Got Paid (Live) (2nafish)","uid":5710577,"size":143312900,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dbd88d2ecb2f55560f91344e9d28e1f06db20a36&amp;dn=ZZ+Top+-+Just+Got+Paid+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1279878540,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nRio Grande Mud is the second album by American blues-rock band ZZ Top, released in 1972.\n\nThe Rio Grande, from where the album name derives, is the river that forms the border of Mexico and Texas. In Spanish its name means &quot;Big River&quot;.\n\nIn 1987, this album was remixed for CD release. The full album is currently unavailable on CD in its original mix. Tracks &quot;Francine&quot; and &quot;Just Got Paid&quot; are available in their original versions on the CD release of The Best of ZZ Top. All tracks except &quot;Mushmouth Shoutin',&quot; &quot;Apologies to Pearly,&quot; and &quot;Down Brownie&quot; are available in their original mix on 2003's Chrome, Smoke &amp; BBQ boxset.\n\nZZ Top (pronounced /?zi??zi? 't?p/) is an American blues rock band, formed in 1969 in Houston, Texas. Comprising of Billy Gibbons (vocals and guitar), Dusty Hill (vocals, bass, and keyboards), and Frank Beard (drums and percussion), ZZ Top was ranked number 44 on VH1's &quot;100 Greatest Artists of Hard Rock.&quot; The trio's original lineup has been intact for over 40 years; their longevity together of 41 years has placed them second only to the Four Tops, whose original band members remained intact from 1953 until the death of Lawrence Payton in 1997. ZZ Top retained the services of the same manager, Bill Ham, until September, 2006.\n\nThe bandmates' image has been as unchanging and memorable as their music. Their signature style of dress and accessories are hard to miss. Gibbons and Hill often use the same synchronized dance moves while performing onstage, and with few exceptions appear in public wearing sunglasses. The pair favor wearing similar black clothing (usually biker leathers) and various head gear which often include cowboy hats, baseball caps, and bandannas. Gibbons and Hill, who appear as twin frontmen wear chest-length untrimmed beards, although drummer Frank Beard has only a trimmed mustache. In 1984, the Gillette Company reportedly offered Gibbons and Hill $1 million each to shave their beards for a television commercial. They allegedly declined, saying &quot;We're too ugly without 'em.&quot;\n\nZZ Top was inducted by Keith Richards of The Rolling Stones into the Rock and Roll Hall of Fame on March 15, 2004. Cub Koda wrote, &quot;As genuine roots musicians, they have few peers; Gibbons is one of America's finest blues guitarists working in the hard rock idiom ... while Hill and Beard provide the ultimate rhythm section support.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:dbd88d2ecb2f55560f91344e9d28e1f06db20a36","amp;dn":"ZZ+Top+-+Just+Got+Paid+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbd88d2ecb2f55560f91344e9d28e1f06db20a36","infoHashBuffer":{"type":"Buffer","data":[219,216,141,46,203,47,85,86,15,145,52,78,157,40,225,240,109,178,10,54]},"announce":[],"urlList":[]}}