{"title":"KAZULAH Horoscope (Daily Horoscopes, Dream Interpretations)","uid":5753566,"size":1723393,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dbfa24d856cde7aae3146074c5db9fe8911df3e2&amp;dn=KAZULAH+Horoscope+%28Daily+Horoscopes%2C+Dream+Interpretations%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"app0dayz","files":1,"time":1281482324,"description":"Kazulah is one of the best horoscopes on the web and has gained popularity quickly. It is an Astrology application which offers daily horoscopes, dream analysis, future predictions, numerology and love compatibility!\n\n\nNot only will you see your daily horoscope but you will also enjoy these other great features:\n\n    * Get daily horoscopes, tarot readings, dream analysis and more\n    * Find how compatible you are with partners, friends, colleagues and celebs\n    * Play cool games, ask a question to the crystal ball, and shake the magic eight ball\n\n\n==================\nCategory Selection\n==================\n\n    * Horoscopes: get your personal astrological reading\n    * Tarot Readings: Is a deck of Tarot cards where you are able to ask questions about relationships, future and more\n\n    * Chinese Astrology: simply enter you birth date and find your Chinese sign and reading\n    * Dream Analysis: now this is a cool feature, find out what your deams mean by entering keywords such as places, objects, colors, themes, emotions and people.\n    * Games : Magic Fate Ball which is similiar to the classic Magic 8 Ball is a fun feature to play around with. Ask the magic fate ball a question and BAM it gives you the answer. Fortune Cookie is another fun game where you pick a virtual fortune and unwrap the message. Then theres the Gift Guide to help you find the perfect gift for family and friends.\n\n    * Fortune Telling - find out what the future holds for you\n    * Numerology - see what your birth date says about your personality\n    * Love &amp; Compatibility - Are the two of you a match? Find out which sign is the most compatibile with yours.","torrent":{"xt":"urn:btih:dbfa24d856cde7aae3146074c5db9fe8911df3e2","amp;dn":"KAZULAH+Horoscope+%28Daily+Horoscopes%2C+Dream+Interpretations%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbfa24d856cde7aae3146074c5db9fe8911df3e2","infoHashBuffer":{"type":"Buffer","data":[219,250,36,216,86,205,231,170,227,20,96,116,197,219,159,232,145,29,243,226]},"announce":[],"urlList":[]}}