{"title":"Resident Evil TRILOGY - HD 720p - NL Subs","uid":5687070,"size":2952415586,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:dce4bdc60ec055fab549c15e7fc7313c0bac14df&amp;dn=Resident+Evil+TRILOGY+-+HD+720p+-+NL+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"juccool","files":72,"time":1278954722,"description":"Resident Evil ( 2002)     - 720p -  NL Subs\n\nVerenigd Koninkrijk / Duitsland / Frankrijk\nHorror / Science-Fiction\n100 minuten\n\ngeregisseerd door Paul W.S. Anderson\nmet Milla Jovovich, Michelle Rodriguez en Eric Mabius\n\nBij het begin van de 21ste eeuw is de Amerikaanse multinational Umbrella Corporation uitgegroeid tot de absolute marktleider op het vlak van grensverleggende computertechnologie en het ontwikkelen van nieuwe geneesmiddelen. De politieke en economische invloed van het bedrijf op de samenleving is enorm. Slechts weinigen weten echter dat de onderneming zich voornamelijk bezighoudt met het onderzoek naar nieuwe biologische wapens en de genetische manipulatie van cellen. Wanneer er een dodelijk virus uitbreekt in 'The Hive', het geheime, ondergrondse labo van het bedrijf, stuurt de overheid een groepje elitesoldaten ter plaatse om te voorkomen dat de situatie uit de hand loopt.\n\n\n\n\n\n\n\n\n\n\n\n\nResident Evil: Apocalypse (2004)     - 720p -  NL Subs\n\nVerenigd Koninkrijk / Frankrijk / Duitsland / Canada\nActie / Horror\n94 minuten\n\ngeregisseerd door Alexander Witt\nmet Milla Jovovich, Sienna Guillory en Oded Fehr\n\nNadat Alice op het nippertje kon ontsnappen uit het ondergrondse Umbrella laboratorium The Hive, werd ze opgepakt. Nu ontwaakt ze in een ziekenhuis en slaagt erin te ontsnappen. Ze bevindt zich in het verwoeste Raccoon City, waar ze het samen met een groepje overlevenden, waaronder agente Jill Valentine en huurling Carlos Olivera, moet opnemen tegen het gruwelijke kwaad dat daar rondzwerft. Dit keer zijn zombies niet het enige, want er zwerft nog iets veel gruwelijkers door de straten van Raccoon City: de Nemesis, een vreselijk monster dat alles op z'n weg wil vernietigen.\n\n\n\n\n\n\n\n\n\nResident Evil: Extinction (2007)     - 720p - NL Subs\n\nVerenigde Staten\nActie / Horror\n95 minuten\n\ngeregisseerd door Russell Mulcahy\nmet Milla Jovovich, Mike Epps en Ali Larter\n\nOverlevenden van Raccoon City reizen door de Nevada-woestijn, hopende dat ze Alaska kunnen bereiken. Alice (Jovovich) sluit zich bij deze karavaan aan, en bindt tezamen de strijd aan tegen de kwaadaardige Umbrella Corporation.","torrent":{"xt":"urn:btih:dce4bdc60ec055fab549c15e7fc7313c0bac14df","amp;dn":"Resident+Evil+TRILOGY+-+HD+720p+-+NL+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dce4bdc60ec055fab549c15e7fc7313c0bac14df","infoHashBuffer":{"type":"Buffer","data":[220,228,189,198,14,192,85,250,181,73,193,94,127,199,49,60,11,172,20,223]},"announce":[],"urlList":[]}}