{"title":"Huey Lewis And The News - I Want A New Drug (2nafish)","uid":5706180,"size":133199876,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dcef7f71a29c857d56ab8464fc204c051c90b603&amp;dn=Huey+Lewis+And+The+News+-+I+Want+A+New+Drug+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1279691695,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Want a New Drug&quot; is a song by American rock band Huey Lewis and the News from their third album Sports. It was released as the second single from the album, following the top-ten hit &quot;Heart and Soul&quot; in January 1984. The single reached number six on the U.S. Billboard Hot 100 and topped the Dance Club Play chart.\n\nThe scene where Huey dunked his face into a sink filled with ice cold water, apparently took over 40 takes to perfect. Lewis joked, &quot;Needless to say, by the end my eyeballs were freezing!&quot;\n\nAccording to Lewis, he wrote the song in only a few minutes. &quot;I just woke up one morning after a long party and just wrote NEW DRUG. I was on the way to my attorney's house and I thought of it in the car. I pulled up and walked in. I said, 'Bob, give me a piece of paper, I've got to write this down'.&quot;\n\nWhen the similarities between this song and the theme song of the 1984 film Ghostbusters were heard, Huey Lewis sued Ray Parker Jr. for plagiarism, claiming that Parker had stolen the melody from &quot;I Want a New Drug&quot;. Lewis had been approached to compose the main theme song for the film, but had to decline because of his work on the soundtrack for Back to the Future.\n\nIn 2001, in an interview on VH1's Behind the Music, Lewis mentioned the suit, implying that Parker had paid a financial settlement as part of the original agreement. This allegedly breached a confidentiality agreement in the aftermath of the first suit, and led to a countersuit by Parker.\n\nSports is the third album by American rock band Huey Lewis and the News, released in 1983. This was the album that made the band famous, reaching number one on the Billboard 200 on June 30, 1984, and making the band internationally known. The album has been certified 7x Platinum by the RIAA. Sports  was ranked number 2 on Billboard's 1984 year-end album chart, after Michael Jackson's Thriller, and spawned four top 10 hits on the Billboard Hot 100 and a fifth that went top 20. It also did very well internationally, with most of its singles reaching chart peaks in various countries.\n\nThe album's biggest hit, &quot;I Want a New Drug&quot;, was certified gold with sales of 500,000 copies in 1989, and was also the center of a lawsuit against artist Ray Parker Jr. who was accused of plagiarizing the song for his 1984 hit &quot;Ghostbusters&quot;. The case was eventually settled out of court for an undisclosed sum.\n\nAnother single, &quot;The Heart of Rock &amp; Roll&quot;, a top 10 hit for the group, was later ranked at #6 in Blender magazine's list of the &quot;50 Worst Songs Ever&quot;, with its worst moment coming in &quot;the second verse, when that cheeky Huey almost uses the word 'ass'&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:dcef7f71a29c857d56ab8464fc204c051c90b603","amp;dn":"Huey+Lewis+And+The+News+-+I+Want+A+New+Drug+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcef7f71a29c857d56ab8464fc204c051c90b603","infoHashBuffer":{"type":"Buffer","data":[220,239,127,113,162,156,133,125,86,171,132,100,252,32,76,5,28,144,182,3]},"announce":[],"urlList":[]}}