{"title":"The Velvet Underground &amp; Nico (Symphony Of Sound) + Vinyl","uid":5885969,"size":4701583553,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dcf0648f5c58d34dd8b1f3ba10e6365f66d581b0&amp;dn=The+Velvet+Underground+%26+Nico+%28Symphony+Of+Sound%29+%2B+Vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"younggod","files":19,"time":1287053435,"description":"\n \nCompared to what you'll usually find online of this film, for my money,this release of classic Warhol/Velvets footage is the one to get. The picture quality is nice and sharp with good audio quality. As good as an old Super 8 will get! Raro Video in Italy put this one out, along with a bunch of other Warhol films, so if you've any interest in old Warhol movies,or things V.U, give them a look!\n\nThings start off with Warhol's adaptation of a play based on A Clockwork Orange. There is a dialogue supplement where an Italian gentlemen elaborates on what it's all about. To be honest, I've only watched it once, and even then I wasn't paying much attention, and my interest in the Factory only goes so far with Andy, and more so The Velvets and Nico really. I always thought Mary Woronov was killer though.\nFollowing that is the MEAT of this DVD for me, The Velvet Underground &amp; Nico also known as &quot;A Symphony Of Sound&quot;.\nThis has the V.U. in a jam session at the Factory with Warhol helming the camera filming them for footage that will be used at the subsequent E.P.I. shows.The Velvets lay down some heave drone groove and even NY's finest, Officer Friendly likes it so much, he pops in to offer some sound tech help.\nLive footage of the Velvets is very few and far between and this will be the only filmed document of live Velvets in performance that we will ever get to see, save for those little here and there shots you see of them playing. For some reason with all the cameras around and not a complete show. Damn.\n\nThirdly, you get a couple of dialogue supplements with two gentlemen in the arts and entertainment industry and journalism there, in Italy. Who talk about &quot;Vinyl&quot; and the music of the Velvet Underground.This section is in Italian language, but, there are English subtitle files provided.If you use VLC or another player with a subtitles file opener, you can easily obtain the subtitles with those.&quot;Vinyl&quot; is in the original English audio of course.\n\nTotal Running time: 163:83\n\nPal Format\nEnglish/Italian Audio\nEnglish Subtitles \nAspect: 4:3\nFrame:720X576\nFrame Rate: 25.000\nVideo Codec: MPEG-2\nAudio Codec: AC3 48000 Hz 192 kb/s stereo\n\nScreenshots:\n &lt;a href=&quot;\nhttp://s63.photobucket.com/albums/h129/velvet1966/Vinyl%20And%20The%20Velvet%20Underground/?start=20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s63.photobucket.com/albums/h129/velvet1966/Vinyl%20And%20The%20Velvet%20Underground/?start=20&lt;/a&gt;  ","torrent":{"xt":"urn:btih:dcf0648f5c58d34dd8b1f3ba10e6365f66d581b0","amp;dn":"The+Velvet+Underground+%26+Nico+%28Symphony+Of+Sound%29+%2B+Vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcf0648f5c58d34dd8b1f3ba10e6365f66d581b0","infoHashBuffer":{"type":"Buffer","data":[220,240,100,143,92,88,211,77,216,177,243,186,16,230,54,95,102,213,129,176]},"announce":[],"urlList":[]}}