{"title":"Eurythmics - It's Alright (Baby's Coming Back) (2nafish)","uid":5721112,"size":132249604,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dcfdd37a7e70eb7a592d81dc11e9b1852aa07b24&amp;dn=Eurythmics+-+It%5C%27s+Alright+%28Baby%5C%27s+Coming+Back%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280297973,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;It's Alright (Baby's Coming Back)&quot; is a song recorded by pop music duo Eurythmics. It was released as the fourth and final single from their album Be Yourself Tonight. Written by band members Annie Lennox and David A. Stewart, the track's distinctive brass arrangement was devised by Michael Kamen. The recording was produced by Stewart.\n\n&quot;It's Alright&quot; was a slight return by Eurythmics to the electronic-based sounds of their earlier albums. Driven by a subtle drum machine track, Lennox sings a straightforward ode to a lover returning to her after a long absence. The instrumental passages feature some elaborate multitracked harmony guitar parts from Stewart. The song's music video, directed by Willy Smax, was a mix of live shots with computer animation, an innovative look for a music video in the mid 1980s. At the start of the music video Lennox can be seen laying on a bed experiencing an out-of-body experience.\n\nThe single was a Top 20 hit in the UK, where it peaked at number twelve (Eurythmics' tenth Top 40 hit in the UK singles chart). The song was not a success in the United States, stalling at number seventy-eight on the Billboard Hot 100.\n\nBe Yourself Tonight is the fifth album by thepop duo Eurythmics, released in 1985.\n\nThis album saw Eurythmics move away from their previous more experimental, synthesizer-based songs, to a more commercial pop/rock sound, incorporating a more traditional band line-up/instrumentation. Nonetheless, the recordings still possessed an atmospheric and cutting edge sound, winning Stewart awards for his production work on the album. The release of the album also coincided with a new look for singer Annie Lennox, who ditched the androgynous look of the previous albums and became, in biographer Lucy O'Brien's words, &quot;a bleach-blonde rock 'n' roller.&quot;\n\nThe album sold well, and was top 3 in the UK and top 10 in the US, as well as spawning several hit singles. It included guest appearances by notable artists such as Aretha Franklin, Stevie Wonder, and Elvis Costello. The album included the duo's first (and only) UK number-one &quot;There Must Be an Angel (Playing with My Heart)&quot; and the American Top 5 and Australian number-one hit &quot;Would I Lie to You?&quot;.\n\nNo tour followed the album's release, due to Lennox's continuing recuperation from vocal fold nodules. This condition also caused her to miss 1985's Live Aid concert, making Eurythmics one of the handful of successful 80's groups not to perform.\n\nOn November 14, 2005, SonyBMG repackaged and released Eurythmics' back catalog as &quot;2005 Deluxe Edition Reissues&quot;. Each of their eight studio albums' original track listings were supplemented with bonus tracks and remixes.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:dcfdd37a7e70eb7a592d81dc11e9b1852aa07b24","amp;dn":"Eurythmics+-+It%5C%27s+Alright+%28Baby%5C%27s+Coming+Back%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcfdd37a7e70eb7a592d81dc11e9b1852aa07b24","infoHashBuffer":{"type":"Buffer","data":[220,253,211,122,126,112,235,122,89,45,129,220,17,233,177,133,42,160,123,36]},"announce":[],"urlList":[]}}