{"title":"The Sumerian Swindle","uid":5892881,"size":7604809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de6b5a045d435257ddce0c6207af4a0e556f2863&amp;dn=The+Sumerian+Swindle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"banjar","files":2,"time":1287340086,"description":"How the Jews Betrayed Mankind: Volume I, &quot;The Sumerian Swindle&quot;\n\n                            by G_d\n\n\nThis new book will help you understand the swindling Jew bankers \nand the history of the Jews better than you will find \nanywhere else. It's a 330 page book with color maps and photos,\nand tells some secrets about the Jews that have never been\npublished before now. Please download a free copy before the \nJews try to ban it.\n\n\nThis is a newly published book that you may offer on your website \nfor free. \n\n\nHow the Jews Betrayed Mankind \nVolume I: The Sumerian Swindle\nby G_d\n\n\n&quot;The Sumerian Swindle&quot; traces the historical creation of a criminal\nconspiracy that is the basis of all of the bank frauds, financial\nscandles and national debts that are being perpetrated on the modern\nworld today by the bankers and Jews. And you will learn why the \ntheories of Professor Kevin MacDonald are proven to be false.\n\n\nAs the &quot;Sumerian Swindle&quot; proves, the problem with Kevin MacDonald's \nbooks is that his theory is false. Of course, the Jews think that his \nbooks have merit because MacDonald posits the theory that the Jews \nare no different than rats or cockroaches who have become rats and \ncockroaches against their will simply through Darwinian Natural \nSelection. MacDonald blames Mother Nature for the fact that the Jews \nare evil swine because he claims that Nature made them that way. So, \nhe supports the Jewish fable that the Jews are victims; in this case, \nvictims of Nature. &quot;The Sumerian Swindle&quot; proves that the Jews are \ndevils through their own efforts and not because Nature \nmade them do it. \n\n\nIn this first Volume, you will find the &quot;21 Secret Frauds&quot; that are\nbeing used to swindle you out of your house, your savings and your\ncountry by these international criminal Jews. These methods were\ninvented in ancient Sumeria and have been a carefully guarded secret\nfor the past five millenia.\n\n\nHere for the first time you will find the causes of all modern wars,\nfinancial swindles, and national disasters that are at the roots of \nJudaism. This information is not found in any other book.\n\n\nIn this 330 page book, are found the causes of the problems that \nhave plague Mankind since the first moneylender loaned out two baskets \nof grain and demanded three in return.\n\n\n\n&quot;How the Jews Betrayed Mankind&quot;: \nVolume One, &quot;The Sumerian Swindle&quot;,\nby G_d, 330 pages,\nAdobe Acrobat format (.pdf file size 7.4 Mb)\n\n\nCSN Interview with the author, Banjo_Billy, here: &lt;a href=&quot;\nhttp://www.bamboo-delight.com/Newsletter_Archives/CSN_20100712.txt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bamboo-delight.com/Newsletter_Archives/CSN_20100712.txt&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:de6b5a045d435257ddce0c6207af4a0e556f2863","amp;dn":"The+Sumerian+Swindle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de6b5a045d435257ddce0c6207af4a0e556f2863","infoHashBuffer":{"type":"Buffer","data":[222,107,90,4,93,67,82,87,221,206,12,98,7,175,74,14,85,111,40,99]},"announce":[],"urlList":[]}}