{"title":"3OH!3 feat. Ke$ha - My First Kiss (Xvid-2nafish)","uid":5697292,"size":89065754,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e06164ed4e7a11e2eae94d045a9fb3e648351df2&amp;dn=3OH%213+feat.+Ke%24ha+-+My+First+Kiss+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1279357837,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:19\n\n[Video]\nResolution : 1280x720\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 3255 Kbps\nQuality Factor : 0.15 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;My First Kiss&quot; is the first single by electronic group, 3OH!3 from their second album major label album, Streets of Gold. The song features Kesha and was released digitally on May 4, 2010 in the US and on 4 July 2010 in the UK, with the physical release the following day.\n\nThe music video for &quot;My First Kiss&quot; was filmed by Isaac Ravishankara during the week of May 9, 2010 in New York. The video as the title suggest features a lot of kissing. Foreman explains that &quot;[And] the video is a play on kissing in general, and lips, and getting close up to a bunch of lips, and people coming out of mouths and just, like, really cool transitions.&quot;\n\nThe song had been premiered live on March 27, 2009 at one of their concerts at Avalon Hollywood. &quot;My First Kiss&quot; was made able to be heard on their website at 3:03 PM EST May 3. It was released digitally at midnight on May 4, 2010.\n\n&quot;My First Kiss&quot; is an electropop song with influences of powerpop and electro. The song features a hook and kissing noises in between verses. The song deviates away from their electropop and hip hop sound and favors a more powerpop and electro. The lyrics talk about first kisses. Sean Foreman commented about the song, explaining that &quot;The song is about a girl you really like, and the story line of going through your first kiss with a girl to exploring further parts of the relationship.&quot;\n\nAbout.com  said that 3OH!3 and Kesha &quot;[were] probably the most gifted artists of the moment at riding a line between performing irresistibly catchy music and releasing tremendously annoying songs,&quot; praising the hook of the song and Kesha's performance.\n\nStreets of Gold is the third studio album by Colorado electronic duo 3OH!3. This is their second album to be produced by Matt Squire and released on the record label Photo Finish. Streets of Gold was released on June 29, 2010.\n\n3OH!3 (pronounced &quot;three oh three&quot;) is an electro hop group from Boulder, Colorado. The band is best known for their hit single &quot;Don't Trust Me&quot; from their second album Want, which reached number seven on the Billboard Hot 100, and for their collaboration with Ke$ha, &quot;My First Kiss&quot;, from their third album Streets of Gold, which peaked at number nine. Their second single, &quot;Starstrukk&quot;, was a top ten hit in the United Kingdom, Ireland, Finland and Australia.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e06164ed4e7a11e2eae94d045a9fb3e648351df2","amp;dn":"3OH%213+feat.+Ke%24ha+-+My+First+Kiss+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e06164ed4e7a11e2eae94d045a9fb3e648351df2","infoHashBuffer":{"type":"Buffer","data":[224,97,100,237,78,122,17,226,234,233,77,4,90,159,179,230,72,53,29,242]},"announce":[],"urlList":[]}}