{"title":"Marine Heavy Gunner Vietnam (Groove Games) (Army) (FPS)","uid":5841346,"size":253997580,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e1213d3ec50b8947529ae2b09e83bc7f5c86132c&amp;dn=Marine+Heavy+Gunner+Vietnam+%28Groove+Games%29+%28Army%29+%28FPS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FuCtUpPuNk","files":5,"time":1284974730,"description":"You play as Grant, a marine heavy gunner who, along with a squad of seven other soldiers, must infiltrate a North Vietnamese prison camp to rescue some American POWs. The game's most remarkable feature is the way the story plays out. Rather than break everything into discrete levels, the game flows more or less seamlessly from your initial helicopter insertion to the final extraction. You have the sense of experiencing an actual event rather than a series of disjointed action scenes.\n\nGameplay is split into three basic types. There are extended on-rail sections in which you man a gun mounted on various vehicles such as a helicopter, an armored personnel carrier, and a boat. These sections have neither the breakneck urgency nor the cool scripted set pieces seen in the best examples of on-rail levels from games such as Call of Duty or the Medal of Honor series. Like pretty much everything in Marine Heavy Gunner, they're functional at best.\n\nAt certain predetermined points, you'll attach the heavy machine gun you're carrying to a fixed position and then blast away at waves of incoming attackers. The rest of the game is spent on foot, and much of the time you'll be accompanied by the members of your squad. As implemented, the squad mechanic feels incomplete. Teammates appear to move in prescripted patterns. Sometimes they'll shoot at enemies; sometimes they'll ignore them completely. Since squad members can't be hurt or killed (except as part of the plot), there isn't any incentive to protect anyone. Your fellow marines will occasionally manage to kill an enemy, but for the most part, they're just window dressing. The exceptions are one teammate that carries extra ammunition and another who's a medic. These two soldiers act as walking health and ammo crates from which you can resupply whenever necessary.\n\nINSTALLATION:\nEXTRACT\nRun &quot;heavy.exe&quot;\nPlay\n\nNOTE: this doesn't seem to work on my new pc (worked perfectly on my old pc).\n\nHERE ARE MY NEW PC SPECS:\nwindows 7 home premium 64bit\nintel i7core 920 cpu (hyper threading) (8 cpus, 4 physical 4 virtual) 2.7 ghz\n9 gigs ram\nnvidia geforce gtx 260 (1.5 gb video ram) (pixel shader 4.0)\n\nMY OLD PC SPECS:\nwindows xp\namd athlon +3500 (2.2 ghz overclocked to 3.5)\n2gigs ram\nnvidia geforce 6150 le (256 mb video ram) (pixel shader 3.0)\n\nENJOY AND SEED!!!!\n\n\n\n\n-----------------------------------------------------------------------------------\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:e1213d3ec50b8947529ae2b09e83bc7f5c86132c","amp;dn":"Marine+Heavy+Gunner+Vietnam+%28Groove+Games%29+%28Army%29+%28FPS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1213d3ec50b8947529ae2b09e83bc7f5c86132c","infoHashBuffer":{"type":"Buffer","data":[225,33,61,62,197,11,137,71,82,154,226,176,158,131,188,127,92,134,19,44]},"announce":[],"urlList":[]}}