{"title":"Coast To Coast Am - 08-09-10 - Ufology's Majic Men","uid":5755480,"size":56546382,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e1304cb48824540ff9c4e3df3942fd6591863193&amp;dn=Coast+To+Coast+Am+-+08-09-10+-+Ufology%5C%27s+Majic+Men&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1281547783,"description":"Date:\n 08-09-10\n \nHost:\n George Noory\n \nGuests:\n Stanton Friedman, Don Schmitt, Don Most, Bryce Zabel, Greg Hunter \n \n\n\nUfologists Stanton Friedman and Don Schmitt, along with Hollywood producers Bryce Zabel and Don Most, discussed the film Majic Men, which will be based on their careers as UFO investigators searching for the truth about the Roswell incident. &quot;It's time to get the real story out there,&quot; Friedman declared. He expressed optimism about the film because Most and Zabel are serious students of the UFO phenomenon who are well-versed in the Roswell story. Meanwhile, the producers reflected on how powerful Friedman and Schmitt's journey of discovery has been. &quot;Everything that both of these men have gone through to break this story involves drama,&quot; Zabel observed, &quot;it's incredibly dramatic and it's human too.&quot;\n\nOn how he feels to have his story turned into a motion picture, a gratified Friedman was hopeful that the film would capture some of the emotions he's experienced fighting for UFO truth. &quot;I think the movie will be able to present some of that frustration, some of the joy, and some of the exciting moments,&quot; Friedman said. Both researchers pointed out that the film has the potential to reach far more people than just those who have read their books. &quot;I could lecture for an awful long time and not reach the audience that one movie can reach simultaneously, almost, all over the world,&quot; Friedman laughed. While they were humbled by the acclaim they've received as news of the film has spread throughout the UFO research community, ultimately it is that potential for education of the public which they see as most important. To that end, Schmitt said, &quot;I'm not looking for applause, I'm looking to finish this mission.&quot; \n\nZabel, who will be writing the screenplay for Majic Men, described his vision of the film as similar to the movie All the President's Men, as he plans to highlight the investigators, Friedman and Schmitt, as much as the actual Roswell event. &quot;Majic Men will be the story of two down to Earth guys that are chasing a story that is out of this world,&quot; he mused. Looking at the timetable for when the film may actually make it to theaters, Most explained that staying true to the story trumped rushing it to the silver screen. &quot;Getting somebody that has the same commitment to the vision we have is of the utmost importance,&quot; he said. While Zabel noted that most films can take up to 10 years to get made, he said that the climate of interest in UFOs makes him cautiously optimistic that Majic Men could see completion in &quot;years and not a decade.&quot; \n\nFinancial Outlook\nIn the first hour, reporter Greg Hunter talked about the current state of America's financial crisis. He was particularly concerned about news that James Bullard of the St. Louis Federal Reserve Bank has called for printing money, which could usher in a new era of inflation. Hunter said that he was shocked by the statements, which he suggested could set off a chain of events that result in a catastrophic financial collapse as the dollar plummets in value. Regardless of whether the plan takes effect, Hunter warned that, based on economist John Williams' insight, the US is at risk of experiencing a &quot;financial Armageddon&quot; which could begin in the next six months to a year. He called the current financial situation a &quot;bizarre phenomenon&quot; where there is deflation in jobs and housing prices coupled with inflation in oil and food prices. \n\n\nWebsite(s):\n#stantonfriedman.com\n#roswellinvestigator.com\n#brycezabel.com\n#donmost.net\n#usawatchdog.com\nBook(s):\n#Science Was Wrong\n#Crash at Corona: The U.S. Military Retrieval and Cover-Up of a UFO\n#Top Secret/Majic\n#The Roswell Dig Diaries (Sci Fi Declassified)\n#The Truth About the UFO Crash at Roswell\n#Witness to Roswell","torrent":{"xt":"urn:btih:e1304cb48824540ff9c4e3df3942fd6591863193","amp;dn":"Coast+To+Coast+Am+-+08-09-10+-+Ufology%5C%27s+Majic+Men","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1304cb48824540ff9c4e3df3942fd6591863193","infoHashBuffer":{"type":"Buffer","data":[225,48,76,180,136,36,84,15,249,196,227,223,57,66,253,101,145,134,49,147]},"announce":[],"urlList":[]}}