{"title":"Floating into the night - Julee Cruise","uid":5850317,"size":274399748,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e1ef2b8a0e72365c56041a7db3006ffaedca2a02&amp;dn=Floating+into+the+night+-+Julee+Cruise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"beelzel","files":10,"time":1285360167,"description":"\n1. Floating\n2. Falling\n3. I Remember\n4. Rockin' Back Inside My Heart\n5. Mysteries of Love\n6. Into the Night\n7. I Float Alone\n8. Nightingale, The\n9. Swan, The\n10. World Spins, The\n\nDetails\nPlaying time:\t48 min.\nProducer:\tAngelo Badalamenti, David Lynch\n\n\nAlbum notes\nSome of these songs were featured in the film &quot;Blue Velvet&quot; and the TV series &quot;Twin Peaks&quot;.\nHardcore David Lynch fans knew the album cut &quot;Mysteries of Love&quot; thanks to its appearance in the middle of Blue Velvet but otherwise, Julee Cruise and her singing abilities were total unknowns when Floating into the Night surfaced in 1990. When Twin Peaks took off, however, the album became more or less its unofficial soundtrack thanks to the instrumental adaptation of &quot;Falling&quot; that served as the theme song. Other cuts, like the haunting, moody &quot;Into the Night,&quot; and &quot;Rockin' Back Inside My Heart&quot; turned up on the show as well; but as a beautiful, mysterious stand-alone effort, Floating is still that best of surprises, a left-field hit that loses nothing thanks to its fame. The combination of Cruise's sweet, light tones, Lynch's surprisingly affecting lyrics, which play just enough with clichÃƒÂ©s so as not to seem willfully ironic, and Angelo Badalamenti's combination of retro styles and modern ambience, is a winner throughout. The feeling is one of a '50s jukebox suddenly plunged into a time warp, dressed with extra sparkle and with a just-sleepy-enough, narcotic feeling. At its most upfront, the music can get downright raunchy -- check out the big band/sax blasts on the strutting tearjerker &quot;Rockin' Back Inside My Heart,&quot; or the sudden orchestral blast three minutes into &quot;Into the Night.&quot; Cruise herself has a wonderfully slow, burning passion that surfaces as well, such as in her whispers on &quot;Floating.&quot; But mostly everything is just sedate enough, crystalline rockabilly guitar playing gentle riffs with a slow slinkiness, Cruise's multi-tracked backing vocals and more combining beautifully. &quot;Falling&quot; remains the most well-known number, and a winner it is, too; Badalamenti's synth orchestrations are so affecting that Moby ended up sampling them for &quot;Go,&quot; kickstarting his own career. But songs like the just-spooky-enough &quot;The World Spins,&quot; and &quot;The Nightingale,&quot; with a great performance all around, ensure Floating's success as a through-and-through listen. ~ Ned Raggett\n\nEditorial reviews\n4 Stars - Excellent - Included in Q's list of the Fifty Best Albums of 1990.\nQ  \n\nQ 4 Stars - Excellent - Included in Q's list of the Fifty Best Albums of 1990.\n\nGoldmine Interesting\n\nPortions of this page Copyright 1988 - 2010 MSI Music Corp","torrent":{"xt":"urn:btih:e1ef2b8a0e72365c56041a7db3006ffaedca2a02","amp;dn":"Floating+into+the+night+-+Julee+Cruise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ef2b8a0e72365c56041a7db3006ffaedca2a02","infoHashBuffer":{"type":"Buffer","data":[225,239,43,138,14,114,54,92,86,4,26,125,179,0,111,250,237,202,42,2]},"announce":[],"urlList":[]}}