{"title":"Kick-Ass[2010]DvDrip[Eng]-D_S_A","uid":5729473,"size":857998420,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e2b2e1fc6cc8811f2b76a29f258d636be724b04c&amp;dn=Kick-Ass%5B2010%5DDvDrip%5BEng%5D-D_S_A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"d_s_a","files":3,"time":1280588878,"description":"Kick-Ass is a 2010 superhero film based on the comic book of the same name by Mark Millar and John Romita, Jr. The film was directed by Matthew Vaughn, who co-produced the film with actor Brad Pitt, and co-wrote the screenplay with Jane Goldman. The film's general release was on 26 March 2010 in the United Kingdom and on 16 April 2010 in the United States.\nThe film tells the story of an ordinary teenager, Dave Lizewski, who sets out to become a real-life superhero calling himself Kick-Ass. Dave gets caught up in a bigger fight when he meets Big Daddy, a former cop who, in his quest to bring down the evil drug lord Frank D'Amico, has trained his eleven-year-old daughter to be the ruthless vigilante Hit-Girl.\n\n\n\n\nCast\n\nAaron Johnson as Dave Lizewski/Kick-Ass.\nNicolas Cage as Damon Macready/Big Daddy. Brad Pitt, the film's producer, was considered for the role. Vaughn described Cage's performance as a little bit Elvis and a little bit Adam West. A character in the film even says his costume looks like that of Batman.[2]\nChloÃƒÂ« Grace Moretz as Mindy Macready/Hit-Girl. Vaughn commented on the maturity of Moretz, who said that because she has four older brothers, she was no stranger to much of the language in the script.[2][7]\nMark Strong as Frank D'Amico, head of a criminal organization. The film's main antagonist\nChristopher Mintz-Plasse as Chris D'Amico/Red Mist, Frank D'Amico's son and the secondary antagonist of the film\nMichael Rispoli as Big Joe\nYancy Butler as Angie D'Amico\nJason Flemyng as Lobby Goon, the building doorman\nElizabeth McGovern as Mrs. Lizewski\nGarrett M. Brown as Mr. Lizewski\nLyndsy Fonseca as Katie Deauxma\nSophie Wu as Erica Cho\nDexter Fletcher as Cody\nClark Duke as Marty\nEvan Peters as Todd\nXander Berkeley as Detective Gigante, police officer working for D'Amico\nOmari Hardwick as Sergeant Marcus Williams, former partner of Damon Macready\nStu 'Large' Riley as Huge Goon, a bodyguard to the D'Amico family.\nCraig Ferguson as Himself\n\n\n\nurs,\n\n\nÃƒ","torrent":{"xt":"urn:btih:e2b2e1fc6cc8811f2b76a29f258d636be724b04c","amp;dn":"Kick-Ass%5B2010%5DDvDrip%5BEng%5D-D_S_A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b2e1fc6cc8811f2b76a29f258d636be724b04c","infoHashBuffer":{"type":"Buffer","data":[226,178,225,252,108,200,129,31,43,118,162,159,37,141,99,107,231,36,176,76]},"announce":[],"urlList":[]}}