{"title":"Democracy Now - 26 aug 2010","uid":5790806,"size":456639994,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e4da3cb883a93e1c841d002523c5b32c59d49b23&amp;dn=Democracy+Now+-+26+aug+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1282840351,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Aug 26, 2010\n\n- Over 50 Killed in Iraq Violence\n- Report: Corruption-Linked Afghan Official on CIA Payroll\n- New York Taxi Driver Stabbed in Anti-Muslim Attack\n- Religious, Civic Groups Form NY Coalition to Back Islamic Center\n- Islamic Center Vandalized in California; Kentucky Board Rejects Mosque\n- Top Obama Environmental Advisers Sidelined During Drilling Talks\n- 72 Killed in Mexico Drug Killings\n- Pakistani Towns Evacuated; 800,000 Cut Off From Aid\n- Scores Killed in Somali Clashes\n- Honduran Journalist Found Dead With Gunshot Wounds\n- Ex-RNC Chair Reveals He's Gay\n- Study: More Than Half of Poor Infants Raised by Mothers Suffering From Depression\n- Deficit Commission Co-Chair Urged to Resign over Social Security Comments\n\n\nSpecial reports\n\n- Colleague of NYC Taxi Driver Stabbed in Anti-Muslim Attack Describes What Happened\n\nA New York City taxi driver was stabbed multiple times Tuesday after a drunken passenger determined he is a Muslim. The victim, Ahmed Sharif, was slashed across his face, neck and hands. Sharif says the suspect, Michael Enright, had asked him several questions about his religion, including whether he's a Muslim and observing Ramadan. Bhairavi Desai of the New York Taxi Workers Alliance spoke with Sharif at his hospital bed. She describes what he said happened.\n\n\n- Swimming Upstream: Eve Ensler Marks Fifth Anniversary of Hurricane Katrina With Performances of New Play\n\nThe award-winning playwright Eve Ensler plans to mark the fifth anniversary of Hurricane Katrina by staging performances of her new work &quot;Swimming Upstream&quot; in New Orleans and New York City. The piece was written by 16 women from New Orleans who describe surviving the flood and living through the aftermath of the storm which permanently changed their city and many of their lives.\n\n\n- Eve Enlser Reads &quot;Congo Cancer: My Cancer is Arbitrary Congo's Atrocities Are Very Deliberate&quot;\n\nEarlier this year, award-winning playwright and bestselling author, Eve Ensler was diagnosed with uterine cancer. In a widely-read article in the Guardian newspaper of London titled &quot;Congo Cancer,&quot; Ensler writes about her illness and relates it to the widespread violence against women in Congo. &quot;The atrocities committed against the people of Congo are not arbitrary, like my cancer. They are systematic, strategic and intentional,&quot; she writes.\n\n\n- UN Slow to Respond to Gang-Rape of Almost 200 Women in the Congo\n\nAid groups reported last week that Rwandan and Congolese rebels took over villages in the eastern part of the Democratic Republic of Congo and gang-raped almost 200 women and five young boys. The rapes occurred between July 30 and August 3, within miles of a United Nations peacekeeping base. A joint UN-human rights team has now confirmed the rapes of 154 women.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e4da3cb883a93e1c841d002523c5b32c59d49b23","amp;dn":"Democracy+Now+-+26+aug+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4da3cb883a93e1c841d002523c5b32c59d49b23","infoHashBuffer":{"type":"Buffer","data":[228,218,60,184,131,169,62,28,132,29,0,37,35,197,179,44,89,212,155,35]},"announce":[],"urlList":[]}}