{"title":"Slam City Amateur Hour with GMN and Foxtrot - Episode 27","uid":5935652,"size":57115425,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e5eedb295567abd969411f1d23df0ac0814a00e5&amp;dn=Slam+City+Amateur+Hour+with+GMN+and+Foxtrot+-+Episode+27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"slamcity","files":-1,"time":1288935036,"description":"Slam City Amateur Hour with GMN and Foxtrot\nStar players GMN and Foxtrot chill at Slam City Studio (Austin TX USA) to discuss news from around the world and share observations.\n\nEpisode 27\n\n* Austin City Limits (ACL) Music Festival\n* Cheap plane tickets to California\n* Vegas Smut Run\n* ATM story\n* Parallel Dimension (13:30)\n\n[News From Planet Earth]\n* Woman mistakenly uses super glue instead of eye drops\n* Man stabbed for refusing blood-sucking request from vampires\n* Los Angeles area freeway clogged by burning yam truck\n* Unsecured internet connection leads to law enforcement raid\n* Ballerina axed for posing for nude photos\n* Texas man pleads guilty in cocaine seizure\n* Rape victim blamed for falling asleep on couch\n* Blood bank worker won't be charged for showing gay porn to high school students\n* Female patient says doctor went too far - Arapahoe Gastroenterology\n* Cops bust alleged dealer with hefty alias - Fat Freddy\n* Connecticut man bitten by police dog bites back\n* Caught spying on student, FBI demands GPS tracker back\n* Pirate rap station interrupts broadcasts in Florida\n* Lee County woman arrested for impersonating hooker, police officer\n* Man late on rent accused of arson; damage at $100,000\n* 6-year-old boy suspended for toy gun at school\n* Cigarettes made in China found to contain high amounts of heavy metals\n* How To Tell Your Friends From The Japs (Time Magazine 12/22/1941)\n* Austin police chief pitches new drunk driving charge\n* Grand Prairie ISD aide fired over note on student's arm\n* Data overload block tracking of sex offenders\n* Tennessee county jail gives new inmates used underwear\n\nSources: AP.org, Sun-Times, WINK, Herald Sun, Denver Post, Wired, Las Vegas Sun, 9news, IndyPosted, Telegraph, Time, KXAN, WFAA\n\n[More]\n* Foxtrot's childhood memories from the motel (34:01)\n* What I Had For Lunch (48:05)\n* Charo and other contemplations\n* Drank: Choya\n\nSlamCity!AmateurHour with GMN and Foxtrot is licensed under a\nCreative Commons Attribution-No Derivative Works 3.0 United States License.\nBased on a work at slamcityradio.com.\nPermissions beyond the scope of this license may be available at http://slamcityradio.com.\n\nAlso available on iTunes\nLike Slam City Amateur Hour on Facebook\nFollow Slam City Radio on Twitter\nCall | Text | Sext | Email\nSeed | Sponsor | Advertise","torrent":{"xt":"urn:btih:e5eedb295567abd969411f1d23df0ac0814a00e5","amp;dn":"Slam+City+Amateur+Hour+with+GMN+and+Foxtrot+-+Episode+27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5eedb295567abd969411f1d23df0ac0814a00e5","infoHashBuffer":{"type":"Buffer","data":[229,238,219,41,85,103,171,217,105,65,31,29,35,223,10,192,129,74,0,229]},"announce":[],"urlList":[]}}