{"title":"Contraataque 1x01 HDTV DVB Spanish","uid":5880219,"size":363657158,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e7977b99ac6edf709e7ca6cf4865a440af160002&amp;dn=Contraataque+1x01+HDTV+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"acer2010","files":1,"time":1286757358,"description":"La serie sigue las aventuras de John Porter (Richard Armitage), un ex-sargento de las SAS, y Hugh Collinson (Andrew Lincoln), un oficial de la SecciÃƒÂ³n 20 del Servicio Secreto de Inteligencia (MI6). Ambos participaron en una fallida operaciÃƒÂ³n en vÃƒÂ­speras de la invasiÃƒÂ³n de Irak en 2003 cuando dos soldados de su unidad fueron asesinados y del que Porter se culpa. La serie se divide en tres sucesos que tuvieron lugar siete aÃƒÂ±os despuÃƒÂ©s. Los dos primeros episodios se centran en el secuestro de Katie Dartmouth (Orla Brady), una periodista britÃƒÂ¡nica, en las afueras de Basora, Irak. Porter se reincorpora para participar en el rescate. Los dos siguientes episodios tienen lugar en Zimbabwe, donde el Gobierno del Reino Unido es acusado de participar en el complot del asesinato de Robert Mugabe; la misiÃƒÂ³n de Porter es entrar en la misma prisiÃƒÂ³n donde esta encerrado el tirador y ayudarlo a escapar. Los dos ÃƒÂºltimos episodios tienen lugar en AfganistÃƒÂ¡n y PakistÃƒÂ¡n, donde un pirata informÃƒÂ¡tico mata a varios soldados estadounidenses en la provincia de Helmand. El asunto de los asesinatos de los soldados en Irak esta presente en toda la serie.","torrent":{"xt":"urn:btih:e7977b99ac6edf709e7ca6cf4865a440af160002","amp;dn":"Contraataque+1x01+HDTV+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7977b99ac6edf709e7ca6cf4865a440af160002","infoHashBuffer":{"type":"Buffer","data":[231,151,123,153,172,110,223,112,158,124,166,207,72,101,164,64,175,22,0,2]},"announce":[],"urlList":[]}}