{"title":"Kaspersky_Key_changer_(No_Trojan-Drag-n-Drop)","uid":5914009,"size":774799,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e8179d7790e9a4a8d9fc35916b41278b5dfea202&amp;dn=Kaspersky_Key_changer_%28No_Trojan-Drag-n-Drop%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ekarth22","files":-1,"time":1288164745,"description":"Since Kaspersky started giving false positive (trojan-warning) to my previous version, \nI'm not going to give any exe files anymore.\nInstead I'm giving the autohotkey script.  (You can manually edit and check it in notepad, if you think I'm supplying trojans around!) \n\nTo use\n1. Install Autohotkey from following place &lt;a href=&quot;\nhttp://www.softpedia.com/get/System/OS-Enhancements/AutoHotkey.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.softpedia.com/get/System/OS-Enhancements/AutoHotkey.shtml&lt;/a&gt;\n\n2. Double click on &quot;Kaspersky_Key_Changer_Launch_ME.ahk&quot; script provided in my torrent. &gt;Window comes, there you drag-n-drop your key and it'll be installed.\n\nNo need to punch any registration code or anything.\nI've created this tear-free, no0b friendly method to activate Kaspersky keys. \nAll you need is the keyfile, and you've to drag and drop it on my macro-program and it'll automatically install the key ;) [This is created using autohotkey, no virus, trojan, spam etc. I'm giving the source code as well]  &lt;a href=&quot;\nhttp://bayimg.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/&lt;/a&gt;\nScreens\nHow to use the software  &lt;a href=&quot;\nhttp://farm5.static.flickr.com/4143/4896710637_f62dcfd93b_b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://farm5.static.flickr.com/4143/4896710637_f62dcfd93b_b.jpg&lt;/a&gt;\n\nHow to delete a blacklisted key  &lt;a href=&quot;\nhttp://farm5.static.flickr.com/4117/4896710643_a559cb4df2_b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://farm5.static.flickr.com/4117/4896710643_a559cb4df2_b.jpg&lt;/a&gt;\n\nA new window pops out like this.\nNow Drag and drop your key file in it and it should install the keys.\n\nImportant:\n1. If your previous keys are blacklisted, you should delete them, before using this 'drag and drop'. If you don't know how to delete the previous / blacklisted keys, then see this screenshot\n2. Autohotkey Users can launch the '[source-code].ahk' file given within the zip file and may even modify it)\n\nTested on \n-Microsoft XP SP3 (32-bit)\n-Kaspersky Internet Security 2011 (v. 11.0.1.400)\n-should work on Vista / Win7, as long as you've the Administrative rights.\n-For 64-bit systems, you can also do a drag-n-drop, please refer the 'geeky-stuff explained' at the bottom and create a shortcut like that.\n\n\nTroubleshoot:\nQ. How to delete a blacklisted keys?\nAns. See the screen given in above 'important' section.\n\nQ. I drag-and dropped the key file but its not working? Kaspersky says my application is not activated?\nA. Many reasons, but the main is that you've to delete the previously blacklisted keys from the software before you can install the new keys. You can at max have 2 keys in your software.\nSo first delete the previously blacklisted key before trying to install the new key. If you don't know how to delete the keys, then see this screenshot in above answer. Other reasons-\n\nReason#1: You've incompatible key file\nThe key file in your harddisk is of different version. Example, you've Kaspersky internet security(KIS) software but you're trying to activate it with Kaspersky Antivirus Software(KAV).\nOr perhaps the keyfile is already blacklisted or of older version software.\nSolution: Goto following web-page and download the latest key file for free  &lt;a href=&quot;\nhttp://thepiratebay.se/user/ChattChitto/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/ChattChitto/&lt;/a&gt;\n\nReason#2: You don't have the administrative rights (You are using the computer via guest account etc) that's why program is not installing the keys.\nSolution: Log in to the different user account with Administrative rights and try again.\n\nQ. How to know if it worked or not? or How do I know if keys were installed or not?\nA. Well just double click on the Kaspersky icon in the traybar and you'll see the Kaspersky window. If on the right side bottom it says 'xyz days remaining' that means it worked. \n\nGeeky stuff Explained: How this Macro file works? or the principle behind this software (Source Code )\nThere is a 'avp.com' file in the Kaspersky installation folder, which allows you to install key files via command prompt.\nI've created a GUI-interface for that avp file, via Autohotkey script. And if you apply your brain, you can create a desktop shortcut for drag and drop and you won't even need my exe file.\ni.e.assuming that installation folder is default, the you can create a shortcut on desktop, with target path like\n\nC:\\Program Files\\Kaspersky Lab\\Kaspersky Anti Virus 2011\\avp.com&quot; addkey \n\nNow drag and drop keys on it and they'll be installed! \n\nHere is the geek forum thread where I originally posted the script code &lt;a href=&quot;\nhttp://www.autohotkey.com/forum/topic61456.html&amp;sid=a6b686605dc56b8f7a601bfbd540179e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.autohotkey.com/forum/topic61456.html&amp;sid=a6b686605dc56b8f7a601bfbd540179e&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:e8179d7790e9a4a8d9fc35916b41278b5dfea202","amp;dn":"Kaspersky_Key_changer_%28No_Trojan-Drag-n-Drop%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8179d7790e9a4a8d9fc35916b41278b5dfea202","infoHashBuffer":{"type":"Buffer","data":[232,23,157,119,144,233,164,168,217,252,53,145,107,65,39,139,93,254,162,2]},"announce":[],"urlList":[]}}