{"title":"ThePirateApp v1.0.0.5","uid":5929687,"size":930921,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e830a0e482edc7f099eec3dde9a71a3fd541a579&amp;dn=ThePirateApp+v1.0.0.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"scene4all","files":-1,"time":1288728004,"description":"\nThePirateApp is an open-source project which allows you to download media through russian servicedirectly. This piece of software comes malware-free and everyone is invited to contribute towards future releases and the improvement of this software itself.\n\nIMPORTANT: This project including the binaries and sources is only for educational and information purpose and proof-of-concept. This should not be used to any illegal actions. If you cannot accept the following, please close the application now.\n\nPirate is a graphical user interface for downloading files from vkontakte.ru developed in VB.NET. The application provides the user with an easy-to-use interface using the open source (with a bit of customization) XPTable component. The binary and source is available from Google Code under the name &quot;pirateapp&quot; at the URL: http://code.google.com/p/pirateapp/\n\nThe application is developed by Mik released under the MIT license:\n\n---------------------------\n\nCopyright (c) 2010 Mik\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the &quot;Software&quot;), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED &quot;AS IS&quot;, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n\nJoin us at: http://www.scene4all.net\n\nEnjoy!!!","torrent":{"xt":"urn:btih:e830a0e482edc7f099eec3dde9a71a3fd541a579","amp;dn":"ThePirateApp+v1.0.0.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e830a0e482edc7f099eec3dde9a71a3fd541a579","infoHashBuffer":{"type":"Buffer","data":[232,48,160,228,130,237,199,240,153,238,195,221,233,167,26,63,213,65,165,121]},"announce":[],"urlList":[]}}