{"title":"Tift Merritt - Broken  (2nafish)","uid":5728457,"size":145102852,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e87e3948e4ce99bd2d2536919f3a09b5c98ab08e&amp;dn=Tift+Merritt+-+Broken++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280552353,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos.\n\n\nAnother Country is a studio album by singer-songwriter Tift Merritt. It was recorded in the summer of 2007, produced in L.A. by George Drakoulias, and released on February 26, 2008 by Fantasy Records.\n\nFor her third album, Tift Merritt took hiatus with a piano in Paris and came home with her most personal and powerful songs to date. Merritt has described the writing as a plainspoken look at the distance we all attempt to cross: between two people, between one heart and the rest of the world.\n\nIn its first week of release, the album's first single &quot;Broken&quot; reached #1 on the Americana Radio Chart compiled by the Americana Music Association.\n\nTift Merritt (born January 8, 1975) is an American singer-songwriter. She has released two studio albums for Lost Highway Records and one for Fantasy Records. Her 2004 album Tambourine earned her Grammy Award and Americana Music Association nominations. The first single from her latest album Another Country  also received AMA Award nominations and held the #1 slot on the Americana airplay chart for several weeks. Her live albums so far are Home Is Loud released in 2005 and Buckingham Solo released in 2009.\n\nTift Merritt signed a new record contract with Fantasy Records on June 25, 2007 and recorded her third full-length studio album, Another Country, in Los Angeles with George Drakoulias producing. Recorded during the summer of 2007, Another Country was released in Australia February 22, Norway February 25, and on February 26, 2008 in the United States and Canada.\n\nMerritt recorded the follow-up to 2008's Another Country at Overdub Lane in Durham with producer Tucker Martine. The album, See You On The Moon, was released June 1, 2010 through Fantasy Records. My Morning Jacket frontman Jim James is featured on the track &quot;Feel of the World.&quot;\n\nMerritt is also a photographer; her first gallery exhibition, Other Countries, ran at the Mahler Gallery in Raleigh, North Carolina in May 2009. She also hosts an artist-to-artist interview radio show called The Spark with Tift Merritt which is produced by KRTS in Marfa, Texas.\n\nMerritt has married Zeke Hutchins, her band's drummer.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e87e3948e4ce99bd2d2536919f3a09b5c98ab08e","amp;dn":"Tift+Merritt+-+Broken++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e87e3948e4ce99bd2d2536919f3a09b5c98ab08e","infoHashBuffer":{"type":"Buffer","data":[232,126,57,72,228,206,153,189,45,37,54,145,159,58,9,181,201,138,176,142]},"announce":[],"urlList":[]}}