{"title":"Coast To Coast Am - 1997-2008-Steven Gibbs - Time Travel With HD","uid":5707071,"size":73478052,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e931c8d1d25ea39f1a3bd2c609fa4f19d0c31a70&amp;dn=Coast+To+Coast+Am+-+1997-2008-Steven+Gibbs+-+Time+Travel+With+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":9,"time":1279734682,"description":"I'm user Of HDR many years and i decide to share with you some of the shows of Steven Gibbs,i use this device usually for OBE (Out-of-body experience),\nand i can tell you it's work Fine.\nLyrian!!\n\nThe Hyper Dimensional Resonator is a device\n invented by Steven L. Gibbs in 1985.\nAt that time Steven Gibbs was living on a farm in Nebraska. He basically improved on an earlier device called the Sonic Resonator which he built in 1981.  The Sonic Resonator is the prior prototype of the new Hyper Dimensional Resonator or HDR and the Sonic Resonator did not generate a magnetic field as powerful as the HDR.\n\n\n\nIn fact, Steven Gibbs says that the old sonic resonator required a barium oxide bar magnet to be use in conjunction with the electromagnet. The new radionics machine was much improved, for one thing is now contains a caduceus coil.\n\nSteven Gibbs calls this new device the Hyper Dimensional Resonator.\n\nNot content with the performance of the HDR Steven Gibbs continued to change it. He worked on finding ways to boost the power of the electromagnet and increase the diameter of the active magnetic field.\n\nThe original Hyper Dimensional Resonator or HDR used a 10K resistor instead of a 15K resistor, and instead of the Radio Shack 1K blue capacitor we now have, it was a green .47 capacitor. There were only two rectifier diodes instead of six like now. The HDR electromagnet was not T-shaped like now. It was just a long cylindrical tube without the handles.\n\nAlso the old electromagnet of the HDR used Radio Shack speaker wire back then, whereas now it uses 21 gauge copper magnet wire. \n\nWell, according to the inventor Steven Gibbs these improvements make the new Hyper Dimensional Resonator much more powerful.","torrent":{"xt":"urn:btih:e931c8d1d25ea39f1a3bd2c609fa4f19d0c31a70","amp;dn":"Coast+To+Coast+Am+-+1997-2008-Steven+Gibbs+-+Time+Travel+With+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e931c8d1d25ea39f1a3bd2c609fa4f19d0c31a70","infoHashBuffer":{"type":"Buffer","data":[233,49,200,209,210,94,163,159,26,59,210,198,9,250,79,25,208,195,26,112]},"announce":[],"urlList":[]}}