{"title":"CDRoller 8.81.80","uid":5840354,"size":7174891,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e93adfdfc5282e2cdedc13005aacf7e02277bc52&amp;dn=CDRoller+8.81.80&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nikita200","files":1,"time":1284927873,"description":"CDRoller is a powerful, easy-to-use and low-cost toolset for CD/DVD data recovery. CDRoller \n\nsupports industry-standard ISO 9660 file system, including Microsoft's extensions for long \n\nfile names support, so-called Joliet extensions. CDRoller also supports the discs formatted \n\nin UDF file system, including versions 1.02, 1.50, 2.0, 2.01 and also so-called UDF Bridge \n\nformat. Support of wide set of CD, CD-R, CD-RW and DVD formats such as: CD-DA, CD-ROM, \n\nCD-WO, CD-ROM XA and Mixed-Mode CD, Stamped multisession CD, CD-MRW (&quot;Mt. Rainier&quot; CD-RW), \n\nDVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+RW, DVD-RAM.\n\nKey Features:\nEffectively retrieves the lost data from the discs created by &quot;drag and drop&quot; CD/DVD/BD \n\nwriting software, such as well-known Sonic (Roxio, Adaptec) and Ahead Nero software \n\npackages, CeQuadrat's PacketCD, DLA, B's CLiP and others.\nReads unfinalized (&quot;open&quot;, &quot;left as-is&quot;) CDs and DVDs, including the discs with Microsoft's \n\nLive File system.\nRecovers DVD movies and photos, created by a wide set of standalone devices that record \n\ndirectly onto disks: Hitachi, Canon, Panasonic, Samsung and Sony DVD camcorders as well as \n\nstandalone video recorders.\nSplits the recovered VOB or VRO video files into a several clips (scenes), automatically \n\nconverting a &quot;raw&quot; DVD-video into generic MPEG files without loss of quality. Specially \n\ntested on the discs, recorded by Hitachi DVD camcorders.\nBurns a new DVD with recovered video that can be played back in the most DVD players.\nRecovers CD data written by Sony Mavica CD digital cameras.\nIncludes a fault-tolerant UDF Reader. Provides direct access to UDF discs, including CDs and \n\nDVDs written by old versions of Roxio (Adaptec) DirectCD and Drag-To-Disk. Finds and \n\nretrieves accidently deleted files, files located in the corrupted folders, files on \n\nincorrectly closed disks, etc.\n&quot;On-the-fly&quot; unpacks the files initially compressed by Roxio (Adaptec) DirectCD.\nRetrieves back up files from the discs recorded in several stages (multisession discs).\nIncludes a built-in CD/DVD/BD data burner. There is no need to run third-party CD/DVD/BD \n\nmastering software if you wish to burn a new DVD-video disc or backup your files and folders \n\nimmediately after recovery. The &quot;Burn&quot; option is integrated into a common shell. Just write \n\na new disc with recovered data shortly, without leaving CDRoller!\nErases CD, DVD and BD re-writable media. Supports quick and full erase methods.\nExamines disc sectors at low level. Displays the sector content in text, binary, hexadecimal \n\nor unicode mode. It also scans all sectors of a disc (selected track or file) for particular \n\ndata. Recommended for engineering purposes and also for law enforcement and forensic \n\ninvestigators.\nIdentifies the lost files on ISO/Joliet discs with the damaged file system (volume \n\ndescriptors, path tables and directories), using the raw data only.\nRescues the data from scratched, damaged or defective discs.\nProvides direct access to hardware, bypassing the Windows File System. Looks for the lost \n\ntracks (sessions) every time when you insert a new disc into the drive. Supports SCSI Pass \n\nThrough Direct (SPTD) layer as alternative method under Windows 2000/XP/2003/Vista.\nDigitally extracts audio tracks into a wide set of wave formats.\nTests disc readability.\nExtracts ISO Image file. Burns ISO Image file to a new disc.\nCatalogs files and folders into CD/DVD library.\nAll features are integrated into a common and easy-to-use intuitive shell.\n\nSupport of wide set of CD, DVD, BD and HD-DVD formats such as:\nCD formats (CD-DA, CD-ROM, CD-WO, CD-ROM XA and Mixed-Mode)\nCD format CD-MRW (&quot;Mt. Rainier&quot; CD-RW),\nDVD formats (DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+R DL, DVD+RW, DVD-R DL, DVD-RAM).\nBlu-ray disc (BD) formats (BD-ROM, BD-R, BD-RE, BD-R DL, BD-RE DL).\nHigh Definition DVD (HD-DVD) formats (HD-ROM, HD DVD-R, HD DVD-RAM).\n\nSupported File Systems:\nISO 9660 file system, including Microsoft's extensions for long file names support, \n\nso-called Joliet extensions.\nUniversal Disk Format (UDF), including versions 1.02, 1.50, 2.0, 2.01, 2.50, 2.60 and \n\nso-called UDF Bridge format.\nFAT32 (for DVD-RAM and BD-RE discs).\n\nSystem Requirements\nTo run CDRoller, you need at least:\nMicrosoft Windows 95/98/ME/2000/XP/2003/Vista operating system,\nIntel Pentium or compatible CPU,\n256 MB of RAM,\n12 MB free hard disk space for program installation and some additional space for CD/DVD \n\nimages,\nCD/DVD/Blu-ray drive(s). The devices with IDE or SCSI interfaces are highly recommended \n\nunder Windows 95/98/ME\n\nNews:\n &lt;a href=&quot;\nhttp://www.cdroller.com/htm/history.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cdroller.com/htm/history.html&lt;/a&gt;\n\nSite: www.cdroller.com\nOS: Windows 98/ME/NT/2000/2003/XP/Vista/7\nLanguage: English","torrent":{"xt":"urn:btih:e93adfdfc5282e2cdedc13005aacf7e02277bc52","amp;dn":"CDRoller+8.81.80","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e93adfdfc5282e2cdedc13005aacf7e02277bc52","infoHashBuffer":{"type":"Buffer","data":[233,58,223,223,197,40,46,44,222,220,19,0,90,172,247,224,34,119,188,82]},"announce":[],"urlList":[]}}