{"title":"BBC The World at War","uid":5735928,"size":11249887279,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e9646e0e3a7443c8debfe9be998812fe93694e0d&amp;dn=BBC+The+World+at+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lars-1","files":38,"time":1280817291,"description":"(From Wikipedia)- The World at War is a 26-episode British television documentary series on World War II and the events immediately before and after it. It was produced by Jeremy Isaacs, narrated by Laurence Olivier, and has a score composed by Carl Davis. A book, The World at War, was written by Mark Arnold-Forster to accompany it.\n\nThe series, which made use of rare colour film footage, was commissioned by Thames Television during 1969. Such was the extent of its research, it took four years to produce at a cost of Ã‚Â£900,000 (2009 equivalent: Ã‚Â£11.4 million[1]). At the time, this was a record for a British television series. It was first shown during 1973, on ITV.\n\nThe series interviewed major members of the Allied and Axis campaigns, including eyewitness accounts by civilians, enlisted men, officers and politicians, amongst them Albert Speer, Karl DÃƒÂ¶nitz, Walter Warlimont, Jimmy Stewart, Bill Mauldin, W. Averell Harriman, Curtis LeMay, Lord Mountbatten of Burma, Alger Hiss, Toshikazu Kase, Mitsuo Fuchida, Minoru Genda, J.B. Priestley, Brian Horrocks, John J. McCloy, Lawrence Durrell, Arthur Harris, Charles Sweeney, Paul Tibbets, Anthony Eden, Traudl Junge, Mark Clark, Adolf Galland, Hasso von Manteuffel and historian Stephen Ambrose.\n\nIn the programme The Making of &quot;The World at War&quot;, included in the DVD set, Jeremy Isaacs explains that priority was given to interviews with surviving aides and assistants rather than recognised figures. The most difficult person to locate and persuade to be interviewed was Heinrich Himmler's adjutant, Karl Wolff. During the interview, he admitted to witnessing a large-scale execution in Himmler's presence.\n\nIn a list of the 100 Greatest British Television Programmes compiled by the British Film Institute during 2000, voted for by industry professionals, The World at War ranked 19th.","torrent":{"xt":"urn:btih:e9646e0e3a7443c8debfe9be998812fe93694e0d","amp;dn":"BBC+The+World+at+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9646e0e3a7443c8debfe9be998812fe93694e0d","infoHashBuffer":{"type":"Buffer","data":[233,100,110,14,58,116,67,200,222,191,233,190,153,136,18,254,147,105,78,13]},"announce":[],"urlList":[]}}