{"title":"Bryan Adams and Tina Turner - It's Only Love (2nafish)","uid":5851289,"size":180256772,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e9b06f33bbd4d62d98005d2681864fe146392389&amp;dn=Bryan+Adams+and+Tina+Turner+-+It%5C%27s+Only+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1285398735,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;It's Only Love&quot; is a hit rock duet recorded by Grammy Award winning singers Bryan Adams and Tina Turner. It was included on Bryan Adams' album Reckless and Tina Turner's live album Tina Live in Europe, as well as being added to both artists' greatest hits compilations: Adams' Anthology and Turner's All the Best. It reached number 15 on the Billboard Hot 100 in the U.S. and number 29 in the UK. The 12&quot; single included the 1985 live version that would later appear on the 1988 album Tina Live in Europe.\n\nAdams told Songfacts that this was his most memorable collaboration of all the ones he's done. He explained: &quot;Working with Tina Turner was amazing. I used to go to see her in the clubs when I was in my late teens/early 20s before she hit the big time. It was incredible to watch her.&quot; He added: &quot;It was such a privilege to have sung with her, especially since I was only 24 at the time.&quot; \n\nReckless is the fourth studio album by the Canadian rock artist Bryan Adams. Co-produced by Adams and Bob Clearmountain, it was one of Adams' most successful albums. Released on October 29, 1984 through A&amp;M Records, the album was a huge international hit, selling over 5 million units in the United States alone. It was the first Canadian album to sell more than one million units within Canada. The album peaked at number 1 on the Billboard 200 and reached high positions in charts worldwide.\n\nSix singles were released from the album: &quot;Run to You,&quot; &quot;Somebody,&quot; &quot;Heaven,&quot; &quot;Summer of '69,&quot; &quot;One Night Love Affair,&quot; and &quot;It's Only Love.&quot; All six singles made the top 15 on the US Billboard Hot 100, a feat that at the time had been accomplished previously only by Michael Jackson's Thriller.\n\nThe album was ranked #49 on Kerrang!'s &quot;100 Greatest Heavy Metal Albums Of All Time&quot;. It was recorded at Little Mountain Sound Studios, Vancouver, Canada.\n\nOn December 12, 2009 the syndicated radio program In the Studio celebrated the 25th Anniversary of the album.\n\nAll The Best is a greatest hits album by Tina Turner, released in November 2004. In the U.S. an abridged single disc version titled All The Best: The Hits was released in October 2005.\n\nThe track list concentrates on Turner's solo hits, but also features a few highlights from her partnership with Ike Turner. It also contains three new recordings (&quot;Open Arms&quot;, &quot;Complicated Disaster&quot; and &quot;Something Special&quot;) and some rarer tracks including duets and her song from the Brother Bear soundtrack, &quot;Great Spirits&quot;.\n\nThe album peaked at #6 in the UK Albums Chart, selling nearly 45,000 copies in its first week and at #2 on the Billboard 200 albums chart, selling 121,000 copies in its first week, making All the Best Tina Turner's highest debut in the United States. The album went platinum in the U.S. 3 months after its release. In March 2007, the album re-entered the UK Charts and peaked at #18. It has since been certified platinum in Germany, France, and the Europe Charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e9b06f33bbd4d62d98005d2681864fe146392389","amp;dn":"Bryan+Adams+and+Tina+Turner+-+It%5C%27s+Only+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b06f33bbd4d62d98005d2681864fe146392389","infoHashBuffer":{"type":"Buffer","data":[233,176,111,51,187,212,214,45,152,0,93,38,129,134,79,225,70,57,35,137]},"announce":[],"urlList":[]}}