{"title":"Coast to Coast AM - 07-26-10 - Secrecy, Sightings, &amp; Exopolitics","uid":5722881,"size":56091631,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e9b69c0c7ee814f46828f451b388d046cbcbb4a1&amp;dn=Coast+to+Coast+AM+-+07-26-10+-+Secrecy%2C+Sightings%2C+%26+Exopolitics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DarkDaze1187","files":5,"time":1280346466,"description":"Date:\n 07-26-10\n \nHost:\n George Noory\n \nGuests:\n Michael E. Salla, Clif High \n \n\n\nPioneer in the development of 'Exopolitics', Michael Salla discussed disclosure, secrecy, and changes in the way science and religion views ET contacts. He also shared details on the recent China UFO sightings. Major Chinese newspapers such as China Daily, Peoples Daily, and Xinhau News announced the UFO sighting near Hangzhou's airport, which was reported to close down for a period after the sighting. After the story was picked up by international media, unrelated UFO photos and videos got mixed in, and analysis labeled the incident as a hoax, he detailed. A research team from Shanghai concluded that the UFO was a misidentified airplane, but Salla suggested there was no way air traffic controllers would have confused a plane with a UFO. \n\nHe talked about the Washington Post's recent series of articles on US government secrecy, and suggested that classified UFO technology is being handed over to corporations, taking it out of citizen oversight. He commented that Stephen Hawking's recent pronouncement that we should be wary of making contact with aliens was a positive development in that it turned the subject into a legitimate scientific debate. Salla believes the next window for govt. disclosure will be after the 2010 elections, and it may take the initial form of something far from Earth, such as related to exoplanets or a SETI signal, rather than a direct admission of ET visitations to our planet. \n\nSalla reported on the video testimony of Henry McElroy, a former New Hampshire legislator, who claimed he was shown a briefing document that President Eisenhower was told about benevolent ET life, and a newly released interview with the late Col. Philip Corso in which he states he personally briefed Atty Gen. Robert Kennedy in 1962 about the UFO phenomenon. Salla also spoke about the revelation from the Governor of the Russian Republic of Kalmykia, Kirsan Ilyumzhinov, who said he was taken aboard a UFO and met with ETs in 1997. \n\nWeb Bot Predictions\nIn the first hour, Clif High shared a recap of some his 'web bot' hits, as well as presented some dire predictions for the future. He foresees a strong earthquake possibly hitting the West Coast in the next few days. He predicted economic collapse over the summer orchestrated by &quot;the powers that be,&quot; and increased censorship of the Internet. During this same time frame, &quot;sun disease,&quot; or solar flare-ups will impact life on Earth, he said. High also issued a warning over the dates November 8th through the 11th, 2010 in which he said an Israeli attack on Iran/nuclear war could occur that will have 9/11-like consequences. \n\n\nWebsite(s):\n-exopolitics.org\n-earthtransformation.com\n-halfpasthuman.com\nBook(s):\n-Exposing U.S. Government Policies on Extraterrestrial Life\n-Exopolitics: Political Implications Of The Extraterrestrial Presence","torrent":{"xt":"urn:btih:e9b69c0c7ee814f46828f451b388d046cbcbb4a1","amp;dn":"Coast+to+Coast+AM+-+07-26-10+-+Secrecy%2C+Sightings%2C+%26+Exopolitics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b69c0c7ee814f46828f451b388d046cbcbb4a1","infoHashBuffer":{"type":"Buffer","data":[233,182,156,12,126,232,20,244,104,40,244,81,179,136,208,70,203,203,180,161]},"announce":[],"urlList":[]}}