{"title":"Greece: the country and the civilization (English &amp; Greek)","uid":5839656,"size":334785969,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ea12337bc3354cf6996a02c3a24ca829f6e1fde1&amp;dn=Greece%3A+the+country+and+the+civilization+%28English+%26+Greek%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"taxar","files":-1,"time":1284890333,"description":"INTERACTIVE CD-ROM (GREEK AND ENGLISH)\nCreator: Tassos Anthoulias\n\nAre you interested in learning all there is to know about Greece: its present, its past, its history? Do you want to find out all about the cradle of civilization and its development up till the present day? This disk can help you. It uses more than 300 Mb (1300 screens) to provide you with a wealth of information about every part of the country with historic, archaeological, cultural, folklore or touristic importance.\nThe programme is not limited to the main, well-known archaeological and touristic sites, but goes beyond to describe every part of the country which has played a part in the development of Greek cultural heritage. From the Poliochne (the Greek Troy of Lemnos) to the Assembly Room of the members of the Cooperative of Ambelakia; from the Monastery of the Philosopher (the Hidden School) and the gunpowder mills of Demetsana to the Cave of Polyphemos in Maroneia, Thrace; from the Ships of Kastoria to the Virgin Mary (the ruler of the sea) of Galaxidi; and from the first Neolithic settlements in Sesklo and Dimeni to the open-air baptismal font of St. Lydia in Philippi.\nThe programme is designed so that you the user can search for information in many different ways. You can ask for information clicking on any point in each one of the maps of the ten regions in which Greece is divided. You can ask for information by choosing a town or an archaeological site from the menus covering each region. You can also use the index of a region and choose one of the place names which are presented in alphabetical order. There you can see, for example, that the Agii Apostoli are situated at ancient Pella and that Grivvana was the ancient name given to the town of Grevena.\nAnd, of course, you can admire the most significant works of Greek art from prehistoric times up till today.\n\nFor full documentation in Greek look at:\n &lt;a href=&quot;\nhttp://www.helidoni.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.helidoni.info&lt;/a&gt; \n\nFor other torrents look at:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/taxar&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/taxar&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:ea12337bc3354cf6996a02c3a24ca829f6e1fde1","amp;dn":"Greece%3A+the+country+and+the+civilization+%28English+%26+Greek%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea12337bc3354cf6996a02c3a24ca829f6e1fde1","infoHashBuffer":{"type":"Buffer","data":[234,18,51,123,195,53,76,246,153,106,2,195,162,76,168,41,246,225,253,225]},"announce":[],"urlList":[]}}