{"title":"Star.Trek.Conquest.USA.Wii-MARVEL","uid":5838182,"size":4699987862,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:ea18a835d3904c879166c20a7c80c97d670d67b6&amp;dn=Star.Trek.Conquest.USA.Wii-MARVEL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"avalonbss","files":-1,"time":1284769550,"description":"Star Trek: Conquest\n\nGenre: Strategy, Space action simulator\nYear: 2007\nDevelopment: Bethesda Softworks\nPlatform: Wii\nMinimum system req.: Wii\n\n\n.: Plot :.\nSTAR TREK: CONQUEST is a single-player game of galactic conquest featuring a blend of strategy and action set in The Next Generation era. Players take control of Federation, Klingon, Romulan, Cardassian, Dominion, and Breen forces and lead them in a campaign to control the galaxy, one planet at a time. Players must build and manage their growing empires in turn-based strategy, and then engage in all out starship combat in real-time action.\n\nStrategically, players must effectively manage their limited resources to expand their empire. Players can decide how to best achieve objectives by managing fleets, admirals, building support structures, researching technology and engaging enemies in combat. Once battle is initiated, the game switches to a ship level tactical view allowing players to take direct command of their ships and engage in real-time combat.\n\n   *  Strategy game set in The Next Generation era\n     Planets held by Next Generation era races are set in a large galactic map, where turn-based strategy allows you to build and expand your empire.\n   \n   * Real-time Starship combat\n     Take direct control of any ship and experience intense action as you engage in real-time combat.\n   \n   * Resource Management\n     Wise spending on starbases, factories, research facilities, and starships determines success.\n   \n   * Six Playable Races\n     Choose to command the Federation, Klingon, Romulan, Cardassian, Dominion, or Breen race, each with their own unique set of strengths and weaknesses. \n\n\n\n\n\n","torrent":{"xt":"urn:btih:ea18a835d3904c879166c20a7c80c97d670d67b6","amp;dn":"Star.Trek.Conquest.USA.Wii-MARVEL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea18a835d3904c879166c20a7c80c97d670d67b6","infoHashBuffer":{"type":"Buffer","data":[234,24,168,53,211,144,76,135,145,102,194,10,124,128,201,125,103,13,103,182]},"announce":[],"urlList":[]}}