{"title":"(Tkillaahh) The fly 1 &amp; 2 - 720P NLsubs - DVD - 2lions team","uid":5708753,"size":3718275306,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ead8e2cc851b3dc595c89f47774005d9001e9e4b&amp;dn=%28Tkillaahh%29+The+fly+1+%26+2+-+720P+NLsubs+-+DVD+-+2lions+team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":28,"time":1279760146,"description":"The fly 1 / 2  - Tkillaahh - 2lionsteam\nPlot\n\nSeth Brundle (Jeff Goldblum) is een wetenschapper die op het punt staat een revolutionaire \nmachine te bouwen, de 'telepod'. Dit is een cel waarin objecten of mensen op een fractie van \neen seconde geteleporteerd kunnen worden naar een tweede telepod, ongeacht waar of op welke \nafstand die zich ook bevindt. De uitvinding werkt echter nog niet helemaal zoals het zou moeten, \nnog meer tijd en onderzoek zijn nodig. Hij kan zijn enthousiasme over deze uitvinding moeilijk \nblijven geheimhouden en beslist om een journaliste, Veronica Quaife (Geena Davis), te betrekken \nbij zijn werk. Zij mag echter nog niets publiceren over zijn uitvinding maar moet hem nauwgezet \nvolgen bij zijn verdere onderzoek met de bedoeling een boek te schrijven over de \nontstaansgeschiedenis van de telepod. De samenwerking tussen de twee loopt al snel uit op een \nliefdesrelatie.\n\nWanneer Seth op een avond wat te veel gedronken heeft, beslist hij impulsief om zichzelf als \nproefpersoon te teleporteren in zijn telepods. Wanneer hij plaats neemt in de eerste telepod \nbemerkt hij echter niet dat een huisvlieg ook in de telepod aanwezig is. De teleportatie lijkt \nsuccesvol te zijn, doch de computer die geprogrammeerd werd om ÃƒÂ©ÃƒÂ©n object tegelijk te \nteleporteren heeft een fout gemaakt doordat twee objecten, namelijk Seth en de vlieg, \nin de telepod aanwezig waren. De computer heeft de biologische samenstelling van Seth gemengd met \nde biologische samenstelling van de vlieg. Dit zal tot gevolg hebben dat Seth langzaamaan zal \nveranderen in een vlieg, een reuzenvlieg, een Brundle-vlieg zoals hij het later zelf in de film \nzegt.\n\nZijn 'ziekte' doorloopt verschillende stadia. Van een lichte vorm van acne tot een afzichtelijk \nmonster dat zich uiteindelijk tegen het eind van de film ontpopt tot een vlieg. Ook Seths \npersoonlijkheid verandert geleidelijk aan mee. Van de gevoelige, briljante man tot de psychologie \nvan een vreselijk insect zonder enige emotie of hint van moraal. De film eindigt met \nde voltooiing van Seths metamorfose in De Vlieg. Veronica wordt bijna slachtoffer van \nDe Vlieg maar wordt op het laatste nippertje gered. De Vlieg wordt vernietigd alsook de telepods, \ndoch het blijft een open einde: Veronica is zwanger van Seth en is niet volkomen zeker of de\n bevruchting plaatsvond vÃƒÂ³ÃƒÂ³r of na zijn besmetting...\n\nmeer info zie :  &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/The_Fly_%281986%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/The_Fly_%281986%29&lt;/a&gt;\n\n\nCategorie : Beeld \nFormaat : 720P Tkillaaahhdvdzz\nOndertitels : Nederlands (instelbaar)\nGenre : Horror\nCover\nThanks : Tkillaahh / 2lionsteam \n\n\n\n******************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n  &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt;\n\n\n******************************************","torrent":{"xt":"urn:btih:ead8e2cc851b3dc595c89f47774005d9001e9e4b","amp;dn":"%28Tkillaahh%29+The+fly+1+%26+2+-+720P+NLsubs+-+DVD+-+2lions+team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ead8e2cc851b3dc595c89f47774005d9001e9e4b","infoHashBuffer":{"type":"Buffer","data":[234,216,226,204,133,27,61,197,149,200,159,71,119,64,5,217,0,30,158,75]},"announce":[],"urlList":[]}}