{"title":"Coast To Coast Am - 08-08-10 - Near Death Experiences","uid":5752730,"size":57277970,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:eb892b98f672f51bef74817e3163ad2b15958a09&amp;dn=Coast+To+Coast+Am+-+08-08-10+-+Near+Death+Experiences&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1281458495,"description":"Date:\n\t\n\n08-08-10\n\nHost:\n\t\n\nIan Punnett\n\nGuests:\n\t\n\nPim van Lommel\n\nIan Punnett welcomed cardiologist Dr. Pim van Lommel, who talked about how his research into near-death experiences concludes that these are authentic events that cannot be attributed to imagination. Van Lommel explained that cardiac arrest survivors are ideal candidates for NDE studies because it is thought to be medically impossible for them to experience consciousness when their circulation and breathing have ceased. Additionally, unlike previous NDE studies which relied on testimony submitted by those who had near-death experiences, his research actively sought out potential candidates from cardiac arrest survivors. This prospective method was surprisingly simple, in that he merely asked the out-treatment patients if they &quot;had memories of the period of unconsciousness. That was the only question.&quot;\n\nOne particularly strong piece of evidence that Van Lommel discussed was NDEs where the experiencers received previously unknown information. To that end, he shared the tale of a man who had a cardiac arrest and then an NDE. During his near-death experience, the man saw an older gentleman who &quot;looked at him lovingly, but whom he did not know.&quot; Over ten years later, as his mother was dying, she revealed to him that he was conceived via an extramarital affair. The mother then showed her son the picture of his biological father and it was the man he saw in the afterlife. Similarly, Van Lommel told the story of a little girl who had an NDE via drowning and, upon her recovery, said that &quot;my brother was with me.&quot; However, the girl's brother died before she was born and her parents had been waiting until she was older to tell her about him.\n\nVan Lommel also broke down some of the trends and statistics gleaned from his study of NDEs and their aftermath. For instance, he reported that 15% of those who had near-death experiences first went to a &quot;frightening, dark space,&quot; but then saw the classic &quot;tunnel of light.&quot; Chillingly, Van Lommel said that one to two percent of the experiencers stay in that dark place or travel &quot;down, really down&quot; to a Hell-like environment which is frightening and marked by feelings of guilt. He noted that experiencers of these 'dark NDEs' have a very difficult time sharing their story and are haunted by it for a longtime afterward. Nonetheless, regardless of the content of the NDE, Van Lommel said that ultimately the outcome is seen as positive and transformative for the patients. He observed that &quot;an experience of two minutes changes the whole life.&quot;\nWebsite(s):\n# pimvanlommel.nl\nBook(s):\n# Consciousness Beyond Life\n","torrent":{"xt":"urn:btih:eb892b98f672f51bef74817e3163ad2b15958a09","amp;dn":"Coast+To+Coast+Am+-+08-08-10+-+Near+Death+Experiences","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb892b98f672f51bef74817e3163ad2b15958a09","infoHashBuffer":{"type":"Buffer","data":[235,137,43,152,246,114,245,27,239,116,129,126,49,99,173,43,21,149,138,9]},"announce":[],"urlList":[]}}