{"title":"100 Best Ballet (2009)","uid":5840133,"size":1062800228,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb9ad06f2f1438b6758d7b858a8209ad1b5dec8c&amp;dn=100+Best+Ballet+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"johnefp","files":101,"time":1284916016,"description":"\nArtist: VA\nTitle Of Album: 100 Best Ballet\nYear Of Release: 30. November 2008\nGenre: Classical /Instrumental\nQuality: Mp3\nBitrate: 320 kbps / 44,1kHz / Joint-Stereo\nTotal Time: 07:21:56 Min\nTotal Size: 980 MB\n\nCD 1:\n01. Tchaikovsky - Swan Lake Op.20: No.10: Scene (Moderato)\n02. Tchaikovsky - Swan Lake Op. 20, Act I: 2. Waltz (Tempo Di Valse)\n03. Tchaikovsky - Swan Lake Op. 20, Act Ii, 13. Dances of The Swans: Iv. Dance of The Cygnets (Allegro Moderato)\n04. Tchaikovsky - Swan Lake Op. 20, Act Ii, 13. Dances of The Swans: V. Andante - Andante Non Troppo - Allegro (Christopher Warren-Green, Violin; Robert Truman, Cello)\n05. Tchaikovsky - Swan Lake Op. 20, Act Iii: 20. Hungarian Dance: Csardas (Moderato Assai - Allegro Moderato - Vivace)\n06. Tchaikovsky - Swan Lake Op. 20, Act Iii: 21. Spanish Dance (Allegro Non Troppo: Tempo Di Bolero)\n07. Tchaikovsky - Swan Lake Op. 20, Act Iii: 22. Neapolitan Dance (Allegro Moderato - Andantino Quasi Moderato)\n08. Tchaikovsky - Swan Lake Op. 20, Act Iii: 23. Mazurka\n09. Tchaikovsky - Sleeping Beauty Op. 66: Introduction (Allegro Vivo - Andantino)\n10. Tchaikovsky - Sleeping Beauty Op. 66, Act I: 'the Spell', 8. Pas D'action:: Rose Adagio (Andante - Adagio Maestoso)\n11. Tchaikovsky - Sleeping Beauty Op. 66, Act Ii, Scene 1: 'the Vision': 17. Panorama (Andantino)\n12. Tchaikovsky - Sleeping Beauty Op. 66, Act I: 'the Spell': 6. Waltz (Allegro: Tempo Di Valse)\n13. Tchaikovsky - The Nutcracker Op. 71, Act 1: Overture.\n14. Tchaikovsky - The Nutcracker Op. 71, Scene 1: March\n15. Tchaikovsky - The Nutcracker Op. 71, Divertissement: Variation 2: Dance of The Sugar-Plum Fairy - Coda [To Pas De Deux]\n16. Tchaikovsky - The Nutcracker Op. 71, Divertissement: Trepak (Russian Dance)\n17. Tchaikovsky - The Nutcracker Op. 71, Divertissement: Chocolate (Spanish Dance)\n18. Tchaikovsky - The Nutcracker Op. 71, Divertissement: Coffee (Arab Dance)\n19. Tchaikovsky - The Nutcracker Op. 71, Divertissement: Tea (Chinese Dance)\n20. Tchaikovsky - The Nutcracker Op. 71, Divertissement: Dance of The Reed Flutes\n21. Tchaikovsky - The Nutcracker Op. 71, Divertissement: Waltz of The Flowers\n\nCD 2:\n01. Tchaikovsky - Eugene Onegin: Polonaise\n02. Minkus - Don Quixote: Pas De Deux (Act III) (Minkus Arr. Irving)\n03. Minkus - La Bayadere: The Kingdom Of The Shades (Act.IV Conclusion) (Arr. Lanchbery)\n04. Andre Previn - Romeo E Giulietta: Dance Of The Knights (Act I)\n05. Sergei Prokofiev - Romeo E Giulietta: Balcony Scene (Act I)\n06. Andre Previn: London Symphony Orchestra - Prokofiev: Cinderella, Op. 87 - Act 1: Pas De Chale\n07. Sergei Prokofiev - Cinderella: Fairies: Spring, Summer, Autumn, Winter (Act I)\n08. Andre Previn: London Symphony Orchestra - Prokofiev: Cinderella, Op. 87 - Act 2: Pas De Deux: The Prince &amp; Cinderella\n09. Aram Khachaturian: London Symphony Orchestra - Khachaturian: Spartacus Suite #2 - Adagio Of Spartacus &amp; Phrygia\n10. Dmitri Shostakovich - The Age Of Gold: Polka\n11. Yuri Temirkanov: Royal Philharmonic Orchestra - Khachaturian: Gayaneh - Sabre Dance\n12. Aram Khachaturian - Gayaneh: Dance Of The Rose Maidens (Act III)\n13. Aram Khachaturian - Gayaneh: Lezhginka (Act I)\n\nCD 3:\n01. Barry Wordsworth - La Fille Mal Gardee - Introduction - Dance of the Cock and Hens (Act I)\n02. Barry Wordsworth - La Fille Mal Gardee - Widow Simone - Clog Dance (Act II)\n03. Barry Wordsworth - La Fille Mal Gardee - Pas de deux (Act II)\n04. Barry Wordsworth - La FIlle Mal Gardee - Finale (Act II)\n05. Robert Irving - Giselle - Valse (Act 1)\n06. Robert Irving - Giselle - Pas de deux (Act II)\n07. Terence Kern - Le Corsaire - Pas de deux (interpolated into Minkus's original score in 1899)\n08. Charles Mackerras - Faust (Ballet Music) - Les Nubiennes - Variation du miroir - Danse de Phyne\n09. Charles Mackerras - Coppelia - Prelude &amp; Mazurka (Act I)\n10. Leo Delibes - Delibes: Coppelia - Waltz\n11. Charles Mackerras - Coppelia - Czardas (Act I)\n12. Manuel Rosenthal - Gaite Parisienne - Overture\n13. Charles Mackerras - Sylvia - Les Chasseresses (Act I)\n14. Charles Mackerras - Sylvia - Intermezzo &amp; Valse lente (Act I)\n15. Charles Mackerras - Sylvia - Pizzicati (Act III)\n16. John Lanchbery - Les Deux Pigeons - Pas de deux pigeons\n17. John Lanchbery - Les Deux Pigeons - Dance of the Gypsies\n18. John Lanchbery - Les Deux Pigeons - Hungarian Dance\n19. Andre Previn: London Symphony Orchestra - Ravel: Bolero - Finale\n\nCD 4:\n01. Petrushka - Scenes Burlesques En Quatre Tableaux, Premiere Tableau: Le Tour De Passe-Passe - Danse Russe\n02. Les Sylphides: Prelude In A, Op.28, No.7\n03. Les Sylphides: Grande Valse Brillante In E Flat, Op.18\n04. La Boutique Fantasque: Cancan\n05. Les Biches (1981 Digital Remaster): Rondeau\n06. Les Biches (1981 Digital Remaster): Adagietto\n07. Les Biches (1981 Digital Remaster): Rag-Mazurka\n08. Prelude A L'apres-Midi D'un Faune\n09. The Rite of Spring, 'le Sacre Du Printemps' (1947 Revised Version)\n10. El Sombrero De Tres Picos: Danza Del Corregidor\n11. Apollo - Ballet En Deux Tableaux (1947 Revised Version), Premier Tableau (Prologue): Naissance D'apollon\n12. Daphnis Et Chloe (Complete Ballet), Part Iii: 4. Danse Generale - Bacchanale\n13. Scheherazade Op. 35: Ii. The Story of The Kalendar Prince\n14. Parade - Ballet Realiste Sur Un Theme De Jean Cocteau (2005 Digital Remaster): Final - Suite Au 'prelude Du Rideau Rouge'\n15. The Firebird (1910 Version)\n\nCD 5:\n01. Robert Irving - Birthday Offering: Overture - Entree - Grand Adagio And Coda (Arr. Irving)\n02. Jean-Philippe Collard - Symphonic Variation: Final Section\n03. Malcom Sargent - Facade: Swiss Yodelling Song\n04. Malcom Sargent - Facade: Polka\n05. Malcom Sargent - Facade: Waltz\n06. Malcom Sargent - Facade: Popular Song\n07. Malcom Sargent - Facade: Tango Pasodoble\n08. Malcom Sargent - Facade: Tarantella Sevillana\n09. Philip Gammon - A Month In The Country: No.8 Alla Polacca (Arr. Lanchbery)\n10. John Lanchbery - Gnossienne No.1\n11. Adrian Boult - Enigma Variations: Nimrod\n12. Adrian Boult - Enigma Variations: Finale\n13. John Lanchbery - Tales Of Beatrix Potter: Mrs Tiggy-Winkle's Laundry\n14. John Lanchbery - Tales Of Beatrix Potter: The Tale Of Jemima Puddleduck\n15. John Lanchbery - Tales Of Beatrix Potter: The Mouse Waltz\n16. Charles Mackerras - Les Patineurs: Allegro Moderato E Pesante - Andante Espressivo - Allegro Con Spirito\n17. Charles Mackerras - Pineapple Poll: Opening Dance (Arr. Mackerras)\n18. Charles Mackerras - The Lady And The Fool: Grand Adage\n\nCD 6:\n01. Richard Hickox - Serenade - String Serenade In C - Pezzo In Forma Di Sonatina (Extract)\n02. Richard Hickox - Serenade - String Serenade In C - Valse\n03. Richard Hickox - Symphony In C - FInale: Allegro vivace\n04. Michel Plasson - Jewels: Emeralds - Incidental Music To Shylock: Finale\n05. Riccardo Muti - Jewels: Diamonds - Symphony No.3 in D\n06. Mikhail Pletnev - Ballet Imperial - Piano Concerto No.2 - Finale: Allegro con fuoco\n07. Leonard Slatkin - Billy The Kid - Celebration\n08. Barbara Lieberman - Fancy Free - Opening Dance\n09. Leonard Slatkin - Rodeo - Buckaroo Holiday\n10. Leonard Slatkin - Rodeo - Hoe-Down\n11. Paavo Jarvi - West Side Story - Symphonic Dances - II. Somewhere\n12. Leonard Slatkin - Appalachian Spring - Variaions on a Shaker Hymn (Simple Gifs)\n13. Leonard Slatkin - On The Town - Times Square\n14. Lt. Col. G.A.C. Hoskins - Stars And Stripes - Finale: The Stars and Stripes Forever!\n","torrent":{"xt":"urn:btih:eb9ad06f2f1438b6758d7b858a8209ad1b5dec8c","amp;dn":"100+Best+Ballet+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb9ad06f2f1438b6758d7b858a8209ad1b5dec8c","infoHashBuffer":{"type":"Buffer","data":[235,154,208,111,47,20,56,182,117,141,123,133,138,130,9,173,27,93,236,140]},"announce":[],"urlList":[]}}