{"title":"Shadow (Ngao) 2010 VCD [Thai Movie]","uid":5918942,"size":857598088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ec024a3b38ba61c607a4368e510be74cf5e0c9d2&amp;dn=Shadow+%28Ngao%29+2010+VCD+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"poothaijaa","files":-1,"time":1288334328,"description":"Title: Shadow\nAKA: Ngao\nYear: 2010\nGenre: Thriller\nDirector: Theeratorn Chaowanayothin, Ekasit Sompetch, Assawin Tubkunlai\nRuntime:\nCountry: Thailand\nAudio: Thai\nSubtitle: none\nStarring: Boonwat Choomthong, Nantarat Chaowarat, Piyawat Kempetch\n &lt;a href=&quot;\nhttp://www.ethaicd.com/show.php?pid=56594&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ethaicd.com/show.php?pid=56594&lt;/a&gt;\n\nSource: 2 VCDs\nFile Format: DAT\n\nPlot:\nAn anthology horror film which tells four stories of sins and the consequences of what will happen if you make a sin.\n\nHun Suan (Partners) by Atsawin Thepkanlai is about a group of motorbike-riding youths who throw rocks at windshields and steal loot from the still-bleeding corpses in the resulting wrecked cars. Fear and betrayal begin to dog the friends and soon they are riding down a dark, foggy road of terrors. The set-up is similar to the Novice segment of last year's Phobia 2 horror anthology from GTH, which also had motorbike punks smashing windshields with rocks. But the result here is much less slick and more gritty, with lo-fi lighting that causes a cool graininess that makes the film look almost rotoscoped at times.\n\nTaeng (Abortion) by Theeratorn Chaowanayothin, is about young man looking to set the world on fire as a photographer whose world comes crashing down when his girlfriend tells him she's pregnant. Three years later, both the woman and the man have either been fired or lost their jobs and creepy little girl is shadowing their every move. Guess they made the wrong decision three years before.\n\nDai Daeng (Red Yarn) by Eakasit Sompetch looks into the folly of disbelieving superstitions. He's the director who two years ago did the fun, low-budget back-yard martial-arts short Mai Fah the Sabulakui featured at the 12th Thai Short Film &amp; Video Festival. Here, it's a story of friends who attend a funeral and according to tradition have pieces of red yarn tied around their wrists, and are supposed to keep it tied on until they get home, to keep the spirit from following them. But it doesn't work out that way.\n\nKong Mae (Mother's Belonging), directed by Chanachai. It's a nonsensical horror-comedy with a serious title. A story of prison escapees hiding out in a short-time motel, this segment is marred by a stereotype of Thai comedy, namely a flamboyant transvestite gay sex fiend who tricks the escapees into having sex with him, with the help of a female college student and a hole in the bed. But what the story is realy about is a young woman's ghost looking for her earring. The usual artless running-and-screaming ensues.\n","torrent":{"xt":"urn:btih:ec024a3b38ba61c607a4368e510be74cf5e0c9d2","amp;dn":"Shadow+%28Ngao%29+2010+VCD+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec024a3b38ba61c607a4368e510be74cf5e0c9d2","infoHashBuffer":{"type":"Buffer","data":[236,2,74,59,56,186,97,198,7,164,54,142,81,11,231,76,245,224,201,210]},"announce":[],"urlList":[]}}