{"title":"Aldo Nova - Medicine Man (Xvid-2nafish)","uid":5930269,"size":103215780,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ec2fe553f4c0e984ee8103fa8c2f471dc1f83e30&amp;dn=Aldo+Nova+-+Medicine+Man+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1288751501,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:58\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2640 Kbps\nQuality Factor : 0.39 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\nBlood on the Bricks is the fourth studio album by Canadian singer, songwriter and multi-instrumentalist Aldo Nova, for which he signed to Jon Bon Jovi's Jambco Records. It was his first album in 6 years. The album featured fewer outside writers than his previous record, Twitch. The songs were mostly written by Nova and Jon Bon Jovi, with help from Jim Vallance and Richard Hughes of Canadian metal band Sword.\n\nBret Adams of allmusic called the album &quot;generally overproduced and noisy&quot;, saying that &quot;most of the choruses are shout-along affairs.&quot; He ended his review by saying &quot;Blood on the Bricks should have been better.&quot; Author Martin Popoff called the album &quot;kickin'&quot;, and characterized it as a comeback of sorts after a 6 year absence, stating Blood on the Bricks &quot;proves you're never really washed-up for good unless you're six feet under, especially if you've got Jon Bon Jovi as a buddy.&quot;\n\nAldo Nova (born Aldo Caporuscio on November 13, 1956, in Montreal, Quebec) is a Canadian guitarist, keyboardist, vocalist and producer, Nova gained fame with his self-titled debut album Aldo Nova in 1981, and its accompanying single &quot;Fantasy&quot;, which climbed to #23 on the Billboard Hot 100.\n\nSigning with Portrait Records, Nova released a self-produced album, Aldo Nova, in 1981. It had two singles: &quot;Fantasy&quot; and &quot;Foolin' Yourself&quot;. &quot;Fantasy&quot; made him what some would call a one hit wonder. His next album, Subject...Aldo Nova had a minor hit with &quot;Monkey on Your Back,&quot; but his solo career flagged and he became a player and songwriter for other bands. He worked with Jon Bon Jovi in both the early and late 1980s and produced some early CÃƒÂ©line Dion albums. Nova co-wrote the hit song &quot;A New Day Has Come&quot; (among others) for Dion and has been featured playing guitar, synthesizer, and percussion on her records. He helped write and produce parts of Chantal Condor's 1989 album, Chantal. In 1991, Nova sought the help of Bon Jovi to revive his solo career on his release Blood on the Bricks, but it still only managed to chart at number 124.\n\nAs a songwriter, Nova's recent hits include Clay Aiken's &quot;This is the Night&quot; (co-written with Chris Braide and Gary Burr), which in the US was a number one hit and the best selling single of 2003. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ec2fe553f4c0e984ee8103fa8c2f471dc1f83e30","amp;dn":"Aldo+Nova+-+Medicine+Man+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec2fe553f4c0e984ee8103fa8c2f471dc1f83e30","infoHashBuffer":{"type":"Buffer","data":[236,47,229,83,244,192,233,132,238,129,3,250,140,47,71,29,193,248,62,48]},"announce":[],"urlList":[]}}