{"title":"CHINAMERICA: Why the Future of Amerca is China","uid":5846561,"size":2915751,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee0834ac106d5aac011634e7106169ab713b652c&amp;dn=CHINAMERICA%3A+Why+the+Future+of+Amerca+is+China&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1285210968,"description":"\nPublisher: McGraw-Hill \nNumber Of Pages: 304 \nPublication Date: 2010-06-17 \n\nConventional wisdom pits China against the United States in a war for economic supremacy. However, in ChinAmerica, Handel Jones, one of the leading experts on China's industrial and economic emergence, demonstrates that the wave of the future is cooperation between the two titans, not conflict-and how America will benefit from increased economic engagement and competition with China.\n\nTo some, conflict between China and the United States appears to be both imminent and unavoidable (indeed, in some eyes, the battle has already begun). But this perspective badly overlooks one vital fact: both nations have no choice other than to act in their mutual interest. Focusing on several key areas of conflict and mutual interest, Jones gives a thorough and eye-opening portrait of the policies, history, and habits that have led to the intersecting fortunes of the two superpowers. Jones also outlines actions the United States must take to hold on to its leadership role by forging equilibrium with China that's based on mutual respect and dependence.\n\nAs Jones makes clear, the contrast between the two powers couldn't be more startling: while China is amassing through trade nearly one-fourth of the world's foreign exchange reserves (nearly three-fourths of that amount in USD), the United States excels mostly as a consumer of finished goods, with Americans unconcerned about debt and other consequences of living beyond their means. China subsidizes development of more efficient manufacturing techniques, and in response America threatens protectionist barriers. Developments such as these, however, don't necessarily put the nations on a collision course. To Jones, these facts point to a very real opportunity for Chinese and American governments and businesses to work together rather than be separated by economic tensions.\n\nFilled with cogent analysis and expert advice, ChinAmerica is the most comprehensive look yet at the interdependency of the world's two leading powers. This is a book that will change minds about Sino-American relations.\n","torrent":{"xt":"urn:btih:ee0834ac106d5aac011634e7106169ab713b652c","amp;dn":"CHINAMERICA%3A+Why+the+Future+of+Amerca+is+China","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee0834ac106d5aac011634e7106169ab713b652c","infoHashBuffer":{"type":"Buffer","data":[238,8,52,172,16,109,90,172,1,22,52,231,16,97,105,171,113,59,101,44]},"announce":[],"urlList":[]}}