{"title":"Medal.Of.Honor.CrackOnly-TRiViUM","uid":5883917,"size":42331274,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ee5483a2df84189ce47e5a0d5e23964df964b707&amp;dn=Medal.Of.Honor.CrackOnly-TRiViUM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HeroMaster","files":-1,"time":1286996844,"description":"Medal of Honor (2010) - TRiViUM CrackOnly \nCrack Only | 16.6 MB | Publisher: Electronic Arts | Oct 13, 2010 \nGenre: Action / Shooter / 1st Person / FPS\n\n\nMedal of Honor is a first-person shooter from the makers of Battlefield Bad Company 2 that redefines the genre. For shooter fans and modern military enthusiasts, Medal of Honor is a way to experience today's authentic warfare, because unlike anywhere else in the world of video games, Medal of Honor can deliver intense modern warfare gameplay inspired by the actions of the elite Tier 1 Operators currently active in the military. Features include access to Tier 1 Ops and Army Ranger storylines, realistic weaponry and large-scale online multiplayer. \n\nLimited Edition Extras \n\nOffered at the same price as the standard game, in addition to the game disc, the Medal of Honor Limited Edition also contains several extras. These include: \n\n- Early access to the Battlefield 3 beta. \n- The MP7 - Available exclusively via the Limited Edition, the MP7 is a weapon utilized by Tier 1 Operators in the field. With its light weight, high rate of fire as well as its ability to penetrate body armor, the MP7 handle slike a pistol yet allows targets to be engaged like a rifle. \n- Instant access to the TOZ194 and 870MCS, two devastating shotguns designed for close quarters combat. \n- Exclusive Special Ops Skin - Change your look on the battlefield to prepare for any engagement that comes your way. \n\nMultiplayer \n\nDeveloped by the world-class team at DICE (makers of Battlefield Bad Company 2) the fast-paced multiplayer combat packed into Medal of Honor delivers the perfect mix of tactical warfare and all-out action. 2-24 players are supported in online modes. \n\nFeatures: \n\n- Fight Today's War - Elite Special Forces in a gritty combat campaign using the surgical tactics of Tier 1 Operators combined with the sledgehammer force of Army Rangers \n- Unparalleled Authenticity - Intense story with incredible pacing and variety set in the rugged Afghanistan landscape, creating a shooter experience only available from the storied Medal of Honor franchise \n- Balanced Gameplay - Developed by the world-class team at DICE (makers of Battlefield Bad Company 2) the game's fast paced combat delivers the perfect mix of tactical warfare and all-out action \n- Online Multiplayer Redefined - The game supports up to 24 players in online multiplayer modes \n- A Deep Single Player Campaign - In addition to multiplayer the game features a deep single player campaign in which players guide the storyline of multiple Tier 1 operators, as well as an Army Ranger \n\niNSTALL NOTES \n\n- Unpack \n- Use our keygen to generate key \n- Install the game \n- Copy the cracked content from the TRiViUM folder \n- Enjoy","torrent":{"xt":"urn:btih:ee5483a2df84189ce47e5a0d5e23964df964b707","amp;dn":"Medal.Of.Honor.CrackOnly-TRiViUM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee5483a2df84189ce47e5a0d5e23964df964b707","infoHashBuffer":{"type":"Buffer","data":[238,84,131,162,223,132,24,156,228,126,90,13,94,35,150,77,249,100,183,7]},"announce":[],"urlList":[]}}