{"title":"The Real L Word - S01E04","uid":5693219,"size":576769322,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ee61e4ecd945ddeec03b858ac74a7940a95357dd&amp;dn=The+Real+L+Word+-+S01E04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1279163051,"description":"Mikey hits the road to Las Vegas for a fashion tradeshow and checks into a pimped out penthouse suite. When Raquel calls to say she's catching the next flight to Sin City, Mikey gives her assistants an unexpected new task - booking a wedding chapel. Now, if only Raquel can make her flight...\n\nStung by Alyssa's reprimands, Whitney comes clean to Tor about her romantic entanglements. Tor is hurt but tags along with Whitney on a night out at the bar - only to face Whitney's girl drama head on when both Romi and Whitney's trainer crush, Miranda, show up at the club too.\n\nNikki and Jill love the sketches their wedding dress designers present, but aren't so thrilled by the price tag on the custom-made gowns. Overwhelmed by the ballooning budget, Jill goes against Nikki's wishes and tries to bargain with their wedding planner to cut costs.\n\nNatalie's job search leads her to Rose, who offers her an assistant gig. The idea of working together might give her pause, but Rose is drowning in office work and pressures Natalie to help.\n\nTracy ponders a career change after a modeling agent scouts her at Stamie's comedy show. Indeed, her job as a Hollywood studio exec is exhausting and Tracy confesses to Stamie that she's at a crossroads - maybe a new gig in front of the camera is just what she needs.","torrent":{"xt":"urn:btih:ee61e4ecd945ddeec03b858ac74a7940a95357dd","amp;dn":"The+Real+L+Word+-+S01E04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee61e4ecd945ddeec03b858ac74a7940a95357dd","infoHashBuffer":{"type":"Buffer","data":[238,97,228,236,217,69,221,238,192,59,133,138,199,74,121,64,169,83,87,221]},"announce":[],"urlList":[]}}