{"title":"Graham Robertson - Able Edwards (2004)","uid":5843110,"size":983396352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef3704b31a79c21fdb4b8035c2415e4aa1cad9e8&amp;dn=Graham+Robertson+-+Able+Edwards+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1285050057,"description":"Graham Robertson - Able Edwards (2004)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0395932&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0395932&lt;/a&gt;\n\nLanguage\tEnglish dual audio with commentary\n\nA conversation with Graham Robertson, writer-director of Able Edwards, conducted on the viewing deck of Turin's Mole Antonelliana during the 2004 Torino Film Festival.\n\nNY: There are several cinematic points of reference in Able Edwards - most obviously Citizen Kane. But the one that made the biggest impact for me was the last shot, which is a bit like Tarkovsky's Solaris in reverse...\nGR : That's exactly what it's about, yeah. I love Solaris, I thought it was a great film - I like 'em both, the Tarkovsky one and Soderbergh's remake. They had a reissue of the original before the Soderbergh one came out, and so I'd seen the original a week before, and then I saw the Soderbergh one and I thought that Soderbergh... nailed it. He captured it - he finally had this budget, he told the same story, I thought he was very true to it... .and told it in half the time. I love 'the sad sci fi' - I think it's very cool.\n\nYou've said you wanted to make a 'fun' film - but audiences may well be in tears at the last shot.\nIn a sense he's finally going to see what it's all for - this is the real version of himself. This is his father, or him, or whatever. Imagine hearing about this person, this personality, your entire life, and who you're supposed to live up to - and finally, in a sense, he comes to face-to-face with himself: how absurd, or maybe shocking it would be, to see this giant statue on this planet that you've never been to. And there you are - there's your face, and your personality...\n\nThe statue doesn't look much like the Able Edwards we've seen - he's got a big grin.\nThe big smile, yeah... That was a 3-D scan - we went and put the actor in a box and this machine would scan him. I have footage of him smiling - I can make action figures of that actor..!\n\nAnd the whole thing was done on greenscreen via the computer?\nAbsolutely - not a lick of it was ever a set. The only 'realistic' aspect is when he comes to Earth, and he's finally out of the space-station where everything's synthetic and virtual, like himself, I used live footage of the cliffs and the ocean. The real rain and trees - so he's finally hit the 'real world'. That was the only bit of 'live action' that I shot. I was actually on vacation, I went to a wedding in Korea, and I had my video camera, and I was like &quot;Hey, I still need that cliff&quot; so I set up my camera...\n\nDo you know the song by the English band The Fall, 'Disney's Dream Debased' - it would fit this movie quite well. We see the 'dark side of Disney'...\nWalt Disney was a ballbuster - he was there to shake things up... You always hear the negative aspects of Walt Disney and I was pretty careful to steer clear of that.\n\nBecause of potential lawsuits?\nExactly, yeah. So I showed the positive stuff that he'd done... I guess the most negative thing would be pretending that the urban myth about Disney being cryogenically frozen was true. I thought it would be great to put him inside Cinderella's castle, or the Wax Museum...\n\nThere's also a Howard Hughes element...\nAbsolutely - he was the other innovative guy at the time -\n\nEdwards looks more like Hughes than Disney.\nHe does, he does. A little more handsome, I would say. The dream casting of Able Edwards, if I was to do it as a big budget movie... when you see George Clooney in O Brother Where Art Thou - that's him!\n\nSo it's Hughes and Disney, via Citizen Kane, which is a film most people would never imagine could be remade - or rather 'cloned'.\nIt's a frightening thought. But it's like, I don't care.\n\nAre you a particular fan of the film?\nI like Citizen Kane but... I can't watch it every day. It's not that kind of a film. It's fascinating to follow his story... I understand the whole thing about it, but it has aged, it's dated. And it is always listed as the number one film of all time... That's to do with the innovative things he was doing - new things, new ideas. The story is all about William Randolph Hearts, although of course to some degree it was foretelling Welles's own future.\n\nAre you worried that in the future this film might be prophetic about you: doomed visionary, etc...?\nNot really... I just want people to see the film right now.\n\nSteven Soderbergh was one of the producers on Able Edwards - was he very hands-on?\nHe was very cool. Basically we had the final thing and we flew out to New York, and screened it for him. He liked it, he gave me 'notes' and suggestions, and what to change. And that's basically the version you saw - based on his notes. He was awesome. It was basically all story advice - I cut out certain aspects, and those were his suggestions - and I agreed with them. He was correct in his choices and suggestions, I'd say.\n\nThe opening titles are striking - at what point did you make those?\nThat was the very first thing I made - because I could do that without actors. I focussed on the collecting photos and all of that before I got the cast. The panda is a stuffed animal - we sat it there, dressed the thing, it took about three or four hours of time-lapse to shoot. We had a heat-gun that kept melting it. We'd do a pass - record - a pass - record. There's this stuff called Fuller's Earth which is a kind of fake dust, so we'd sprinkle that on... It supposed to be his office, the things rotting away...\n\nAnd it starts very quietly, as if the sound has gone off.\nThe tinkly music-box comes in very faint. The idea was to put the audience off-balance. I want a lot of questions to appear... Basically the bear represents the state of the Earth as it falls apart.\n\nAnd the decaying themepark was all done with miniatures?\nI went through books and found all these photographs of old wind-up toys - if you look closely at the rocketship you can see the key in the side. They're all old toys - and an old lamp with a grinning face. With some photographs of Angkor Wat, with 'Rest Room' and 'Exit' superimposed over the doors... A photograph of 'Hollywoodland' - before the 'land' fell off. Timothy Dalton knocked it off in that movie The Rocketeer: another movie that didn't do very well!\n\nMany of your reference-points are conspicuous box-office flops!\nYes: another one was The Hudsucker Proxy - all that stuff in the boardroom. They're all great movies... It's the movies that bomb that everybody talks about, decades on.\nlow on ice : Scott Kelly Galbreath chills out in 'Able Edwards'\nGetting back to the opening titles and the apocalyptic set-up - you don't linger much on the Hauser Virus.\nIt's in the background - a couple of times where reporters yell about it.\n\nWhy 'Hauser'?\nHauser is the name of the guy who was the first person to contract it (laughs). His name was Charles Hauser. He came down with it, so they named the virus after him.\n\nIs it a real virus?\nNo. That's the backstory - you don't need to worry about those things. It's for the comic-book, if there's a comic of it.\n\nLike how George Lucas names even the tiniest characters in his films.\nFor the action-figure! It's like the stormtroopers in the new Star Wars film, they don't look like stormtroopers - is that to sell more action figures? Smart marketing!\n\nWhich recent science fiction films have impressed you?\nI'm drawing a blank. The last great science fiction? I don't know. It would have to be something dark and low budget - we just came out of a summer of blockbusters, as usual. And they're OK, everything's OK, but...\n\nWhat's your view of Lucas?\nAll those guys you're talking about were young, and often as people get older they get more conservative, not as daring. They think differently. Perhaps that's why you have these innovative directors like Spielberg and Lucas who, they did these films 'back in the day', and now as adults they're much older, they want to go back and 'fix them'... Their points of view are maybe a little different, like in E.T. getting rid of the guns. Lucas has gone back and redone all of 'em, everything he's made. At least with Spielberg's E.T. he made both versions available. But you can't get the original Star Wars anymore - you can probably get the laserdisc and burn it onto DVD or something.\n\nAnd will your next project also be science-fiction?\nThe next thing I'm working on is edgy, dark... I guess I'm rebelling against the black-and-white forties stuff.\n\nNo green-screen this time?\nNo - I'd like some &quot;heightened reality&quot; in it, but it's basically just 'dark'. I'd put it in the Trainspotting bracket, more earthbound. The closest thing to older movies is Sunset Blvd where it has a narrator and he's dead, and he's telling the story of how he got to be where he is.\n\nThis film has a very forties-style narrative structure, full of flashbacks and significant moments around which everything pivots.\nYou have to have those big moments - the idea &quot;to bring back Able Edwards!&quot;, with lightning flashes, etc. Quirky lines. One thing that a lot of people don't get is the scene where they're walking in the hallway - they're walking in place! What that is, if you watch the old movies, 40s and 50s films, you always have the rear projections - and everybody knows it's not real - that's what it was all about. It was intentional, but people criticise it - I have to tell them it's supposed to look weird, that was the point of it.\n\nWhat other questions have been asked by audiences?\nIt's always technical things, like the camera, and why Walt Disney? Why Citizen Kane?\n\nDid you ever consider doing it in old-style colour, as in an early-fifties sci-fi?\nNo - there's a film I love, Gattaca - that was definitely in the back of my mind. Lars Von Trier's Zentropa, which also uses back-projection a lot, people walking in place. I like the idea in Gattaca that when they board their spaceships, they're not in spacesuits, they're in their suits and ties like they're going to the office...\n\nOr in Soderbergh's Solaris, you don't see Clooney in a spaceship flying through space...\nYou see the space station. I love the planet... he did a great job. It was really interesting to see the two of them a week apart and be able to make comparisons. Like in the original the computer looks like a refrigerator box.\n\nDid Soderbergh speak to you much about his Solaris?\nHe was really excited to do it, and it didn't do so well, but he hopes that in the long run people will revisit it. Everybody I talk to about it all love it - I don't know why it didn't make money. Maybe the marketing - selling it as a love story... Any flaws of the original I felt he fixed.\n\nThough neither Tarkovsky nor Soderbergh have really actually filmed Stanislaw Lem's book...\nIt's like The Thing - the remake of The Thing, by John Carpenter. Which is fantastic, one of my favourites! I remember as a kid looking at the poster and my dad was like &quot;Why do they have to take these classic stories and turn em into gory graphic horror films...&quot; I liked it, it was good - and then I read the story Who Goes There? and Carpenter's version is more accurate. The original one he's like a plant-vegetable man, James Arness, because of their budget.\n\nWere there any other directors who made an impact on you when you were younger?\nHmm... Sydney Pollack stuff - he was really big in the eighties when I was I kid. I loved Jeremiah Johnson - fantastic film, not a lot of dialogue. I tend to enjoy films like that - they can be slow. I can take a movie where nobody says a word for 45 minutes. That's what happens here - it's about this guy who goes 'out west' and learns to be a mountain-man. I saw Cold Mountain and it reminded me a lot of Jeremiah Johnson, then I saw at the end that it was produced by Sydney Pollack.\n\nHave you met any of these people thanks to Able Edwards?\nNo. But I get some interesting requests for screeners. There's an article about the film on the Apple website, about the technical aspects...\n\nYour film isn't just of technical interest - the script is solid...\nWell, you get some cartoons, and the animations that they spend years putting together, and it just sucks - I just can't believe that you would dedicate this much time and money, and not have a really good script. And that's why Pixar has done really well with these amazing stories that are really engaging.\n\nYou sometimes see the end credits for bad films, with thousands and thousands of names...\nAll this work on a bad script. Maybe it's because they keep re-editing it as they go, or they keep changing it and get lost, I have no idea.\n\nWhat was the budget for Able Edwards, and how long did it take to shoot?\nWe shot it for $30,000 over 15 days. We shot it on the weekends, because we had day jobs. So it took two months altogether over the summer. I was working on James Foley's Confidence - our set-dressing warehouse had the 'green wall' so we used that, kind-of 'undercover'...\n\nYour 'day job' is as a set-dresser - on which films have you worked?\nSwordfish, Punch-Drunk Love - on that one I mainly worked on the recording-studio set, which you barely see. I prefer Magnolia to be honest. Punch-Drunk Love is not my favourite 'PTA'... I heard that Emily Watson is supposed to be an alien - that's the whole point. And those trucks at the start are the aliens coming to town - keep that in mind (laughs). The decorator of that is one of the investors on Able Edwards.\n\nAnd more recently?\nBasically after finishing the film I needed a job. So I worked on two films - I caught the very end of this movie called In Her Shoes with Cameron Diaz and Toni Collette. Then after that I did Serenity, this big sci-fi, a $60m picture by Joss Whedon.\n\n$60m isn't that much these days.\nIt's from a TV show - they moved quickly, in a TV way. So all summer long I was building spaceships. All summer long I was out in the desert outside Los Angeles full of jumbo jets, like a junkyard - they get stripped for parts. You might see it in Con Air... I spent several weeks going out there, picking up parts, jet engines, loading trucks. It's not cardboard - it's real metal, we had to bolt it all together and make it look real.\n\nThe restrictions of a low budget can also be liberating, of course...\nYou find ways to work around it.\n\nSo if you got offered a big-budget movie, would you do it, or would you rather do six smaller films on the same money?\nIt's not like they give you that kind of choice (laughs). I would gladly use it.\n\nBut you'd want final control?\nThat's the sacrifice for 'whoring yourself out'. You want to get out there, you want to make movies. This is my first film - you do what it takes to get yourself established... You can still continue to make low-budget art films if you want...\n\nAs Soderbergh does?\nExactly - he can still do that.\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard01-20.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard01-20.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard02-19.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard02-19.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard04-17.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard04-17.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard05-14.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard05-14.png&lt;/a&gt;\n\n-----my rip------\n\nFile Size (in bytes):...........................983,396,352\n\n\n\n--- Video Information ---\n\nVideo Codec Name:...............................XviD ISO MPEG-4\n\nDuration (hh:mm:ss):............................1:21:31\n\nFrame Count:....................................117245\n\nFrame Width (pixels):...........................640\n\nFrame Height (pixels):..........................352\n\nAspect Ratio:...................................1.818\n\nFrames Per Second:..............................23.976\n\nVideo Bitrate (kbps):...........................1274\n\n......MPEG-4......B-VOP........................\n\nQuality Factor (bits/pixel)/frame:..............0.236&quot;\n\n\n\n--- Audio Information ---\n\nAudio Codec:....................................0x2000 (Dolby AC3) AC3\n\nAudio Sample Rate (Hz):.........................48000\n\nAudio Bitrate(kbps):............................192\n\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR\n\nAudio Channel Count:............................2 \n\n*****************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n     &lt;a href=&quot;\nhttps://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://board.freakyflicks.org/index.php&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\t\t\n\n","torrent":{"xt":"urn:btih:ef3704b31a79c21fdb4b8035c2415e4aa1cad9e8","amp;dn":"Graham+Robertson+-+Able+Edwards+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef3704b31a79c21fdb4b8035c2415e4aa1cad9e8","infoHashBuffer":{"type":"Buffer","data":[239,55,4,179,26,121,194,31,219,75,128,53,194,65,94,74,161,202,217,232]},"announce":[],"urlList":[]}}