{"title":"Sto dney do prikaza [1990] Hussein Erkenov","uid":5898910,"size":1257423652,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0a6076881f20e0a85972a0465540a04644a5a47&amp;dn=Sto+dney+do+prikaza+%5B1990%5D+Hussein+Erkenov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ThorntonWilde","files":-1,"time":1287604719,"description":" &lt;a href=&quot;http://bayimg.com/CaPLEAaCP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/CaPLEAaCP&lt;/a&gt;\n\nSto dney do prikaza (1990) \n\nMarketed as: 100 Days Before the Command \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0100694/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0100694/&lt;/a&gt;\n\nIN RUSSIAN NO SUBTITLES\n\n100 Days Before the Command (Sto dney do prikaza) is a 1990 drama film by Hussein Erkenov.\n\nMade in the final months of the Soviet Union, the film follows three young Red Army recruits, Zyrin, Belikov and Elin. The film has no narrative structure and rather than telling a story uses vignettes to show the conditions in which Soviet army recruits lived. The film is often homoerotic, the soldiers are shown to have very little privacy and are forced into such intimate acts as washing each other.\n\nThe film features Armen Dzigarkhanyan, one of the most popular Soviet, Russian and Armenian actors, as the Brigade Commander.\n\nThough technically poor and dramatically erratic, this metaphoric, slightly surrealistic look at life in the Russian military packs a punch. The film should raise some interest in arthouse circles and, because of its borderline homoeroticism, among gay and lesbian festivals. \n\nTo get Gorki Studios to invest, plus permission to use military locations, director Hussein Erkenov and writers Yuri Polyakov and Vladimir Golodov produced two fake scripts in addition to the real one. Result came as a shock to both the studio and the military. The 1990 film has been screened in Russia, but its savagely anti-military tone meant it wasn't seen outside Russia until Erkenov formed his own sales company and toted the reels to the Berlin festival. Film is less a protest against military life than a metaphor for people doomed to be victims of life rather than its masters. Instead of a plot, The film presents an assemblage of episodes with little or no dialogue. Characters are barracks soldiers without names who, for unexplained reasons, are driven toward darkly repulsive fates like suicide and public humiliation. \n\nEpisodes have no motivation or background, nor standard endings: The next one starts just before we learn the end or repercussions of the last. Each serves not to portray real characters or offer insights, but to portray a feeling of impending doom. Result is a kind of existential poem or epitaph to those who seemed doomed from the beginning without knowing why. \n\nBecause the actors play types rather than real characters, specific performances do not stand out among the wooden-faced cast. Tech credits are mediocre to poor, especially the lukewarm colors and uninteresting locations. \n\nStill, as a director Erkenov succeeds in invoking a heady atmosphere and a meaty, homoerotic suggestiveness that lend a strange attraction to his characters' piteous roads to self-destruction.\n\nAt this moment in our history we need all the input about the multiple facets of the hideous War Machine that has an apparent strangle hold on every country on the planet. In this Russian meditation, 100 Days Before The Command, we are shown the behind-locked-doors view of youth preparing to become soldiers and leaders of soldiers. On the surface the director's eye seems to be telling us that 'boot camp' for these VERY young appearing boys is no more than a summer camp experience. But then he gradually shows the darker, terrifying side of what preparing these innocents for war produces - suffering, self-doubt, death, alienating behaviour, dreams and nightmares. There is an incredible sense of innocence in the eyes of these youth, and a groping for comradery that lightly brushes on eroticism. The multiple nude scenes seem to be offending more people than the Russian censors, but they are some of the more tender and tangible scenes in this meandering film about questioning our place and mindsets in the propagation of war leaders. Of note, in this very Russian film, the music used in the background is all Bach - excerpts form the Passions, cantatas - instead of works by Russian composers. This adds another dimension to this apparent 'paean' for world peace.\n\n\n\n","torrent":{"xt":"urn:btih:f0a6076881f20e0a85972a0465540a04644a5a47","amp;dn":"Sto+dney+do+prikaza+%5B1990%5D+Hussein+Erkenov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0a6076881f20e0a85972a0465540a04644a5a47","infoHashBuffer":{"type":"Buffer","data":[240,166,7,104,129,242,14,10,133,151,42,4,101,84,10,4,100,74,90,71]},"announce":[],"urlList":[]}}