{"title":"The Doobie Brothers - China Grove (Beat Club)(2nafish)","uid":5847300,"size":118618116,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f156e9abc872142edce2544e85f4e114b0a2a604&amp;dn=The+Doobie+Brothers+-+China+Grove+%28Beat+Club%29%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1285239990,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;China Grove&quot; is a song from The Doobie Brothers' 1973 album The Captain and Me. It was written by original lead singer Tom Johnston, before he fell ill in 1975 and was replaced by Michael McDonald. The song is based on a real town in Texas with the same name. The connection is obvious given its real-life proximity to San Antonio, which is referenced in the lyrics. However, the rest of the song is largely a fictional account portraying China Grove as Texas' version of Chinatown. Notable is the mention of samurai, who in fact are Japanese, not Chinese.\n\nThe track was originally titled &quot;Parliament&quot; after the band's tradition of naming demos after whatever brand of cigarette Tom Johnston was smoking at the time. According to producer Ted Templeman, &quot;Billy Payne played a keyboard thing on the bridge that sounded like an Oriental lick, so I told Tommy,'Write something that sounds oriental.' So he came up with 'China Grove'.&quot;\n\nThe Captain and Me is the third studio album by American rock band The Doobie Brothers, released in 1973. It features some of their most popular hits including &quot;Long Train Running&quot;, &quot;China Grove&quot; and &quot;Without You&quot;. The album is certified 2x Platinum by the RIAA.\n\nThis time around in recording, there was more pressure on the band to move quickly. What the band did to save time was to begin reworking old tunes. One of Tom Johnston's songs' titles &quot;Osborn&quot; had been an improvisational piece that the band always played live. After laying down the track, according to producer Ted Templeman. &quot;We still really didn't have it, and i said ,'Make it about a train, since you have this thing about &quot;Miss Lucy down along the track.&quot; So he came up with &quot;Long Train Runnin'.&quot;\n\nSeveral instruments unique to the Doobie Brothers such as synthesizers and strings were brought in to record The Captain and Me. Synth programmers Malcolm Cecil and Robert Margouleff were brought in to engineer the opening track, &quot;Natural Thing&quot;. Striving for a synthesized sound like that of The Beatles' &quot;Being for the Benefit of Mr. Kite!&quot; they would overdub singular notes to create chords for the song's bridge.\n\n&quot;Dark Eyed Cajun Woman&quot; was a very bluesy track (one of the band's earliest) and seen by Tom Johnston as a tribute to the blues and B.B. King. &quot;South City Midnight Lady&quot;, while being about San Jose, is not about any woman in particular. Jeff Baxter of Steely Dan played pedal steel guitar on the track. He would become an official Doobie Brother in 1974. Cecil and Magouleff also added the syhthesized effect of a woman whispering at the end.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f156e9abc872142edce2544e85f4e114b0a2a604","amp;dn":"The+Doobie+Brothers+-+China+Grove+%28Beat+Club%29%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f156e9abc872142edce2544e85f4e114b0a2a604","infoHashBuffer":{"type":"Buffer","data":[241,86,233,171,200,114,20,46,220,226,84,78,133,244,225,20,176,162,166,4]},"announce":[],"urlList":[]}}