{"title":"Dead Rising 2 CLONEDVD-IND","uid":5827694,"size":6765691157,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f22479cbc71a07fb16832bf0cbd181d3389ef4a8&amp;dn=Dead+Rising+2+CLONEDVD-IND&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MAFIAA.","files":-1,"time":1284389344,"description":"*  Capcom\n* Blue Castle Games\n* Horror Action Adventure\n* Release: Sep 28, 2010 Ã‚Â»\n* ESRB: Mature\n\n\nGet ready to blast the zombie hordes once more as Dead Rising returns.\n\nThe sequel to the million-plus selling Dead Rising, Dead Rising 2 takes the zombie survival horror to Fortune City, America\u0019s latest and greatest entertainment playground. Featuring a new story, two online multiplayer modes (2-player co-op campaign and a 4-player \u001cTV show\u001d themed Pay-Per-View event that pits humans against zombies), thousands of on-screen zombies and more, Dead Rising 2 takes zombie survival horror to a whole new level.\n\nAs Chuck Greene, you have 72 hours to save your infected daughter, clear your name and survive the hordes of hungry zombies before the military comes in and nukes the city. To ensure your survival, you can combine everyday objects to create numerous deadly combo weapons and slaughter the ravenous zombies. Dead Rising 2, it\u0019s where Creativity Kills.\n\nKey Features\nSequel to the critically acclaimed and 1 million+ selling Dead Rising: Dead Rising 2 is bigger and better in every way, adding new custom combo weapons, multiplayer and thousands of zombies on-screen at once!\nThousands of Zombies On Screen: The undead are everywhere creating a dynamic and challenging zombie-killing experience for the player as weapons will be created to kill massive amounts of zombies at one time!\nCombo Weapons: Players can combine two everyday items using duct tape to create the ultimate zombie killing creations such as the Portamower and Paddlesaw. Unlocking combo cards along the way will give players the advantage as the helpful cards will show you what items are best for combining.\nNew Storyline and Characters: A new protagonist, Chuck Greene, must save his infected daughter, clear his name, and survive 72 hours in Fortune City.\n2-Player Co-Op: Online co-op play is introduced to the Dead Rising universe for the first time as players can invite their friends to partner up with them at any time to take on the zombie massacre- tag-team style! Killing zombies with a friend is always more fun!\n4-Player Terror is Reality: 4 players compete in a gladiator type TV show named Terror Is Reality that pits zombies against a group of players in the ultimate Vs. multiplayer blood bath\n\nSystem Requirements\nOS: Windows VistaÃ‚Â®/XP, Windows 7\nProcessor: Intel Core 2 Duo 2.4 Ghz or better, AMD Athlon X2 2.2 Ghz or better\nMemory: 2 GB RAM\nGraphics: NVIDIAÃ‚Â® GeForceÃ‚Â® 8800GTS or better, ATI Radeon&quot; HD 3850 or better\nDirectXÃ‚Â®: DirectXÃ‚Â® 9.0c and DirectXÃ‚Â® 10 (Enhanced for: DirectX 10, 64-bit, multi-core)\nHard Drive: 8.5 GB free hard drive space\nSound: Standard audio device\n------------------------------------------------------------------------------------------------------\nGame not playable until 9/28/10.\n\nDead Rising 2\n\nDRM: Microsoft SSA and zdpp.\n\nThis image contains original Dead Rising 2 installation files.\n\n1.Mount or burn.\n2.Install, use of any serial (look nfo).\n3.Wait for street release date (Sep 28,2010) and a working crack.","torrent":{"xt":"urn:btih:f22479cbc71a07fb16832bf0cbd181d3389ef4a8","amp;dn":"Dead+Rising+2+CLONEDVD-IND","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f22479cbc71a07fb16832bf0cbd181d3389ef4a8","infoHashBuffer":{"type":"Buffer","data":[242,36,121,203,199,26,7,251,22,131,43,240,203,209,129,211,56,158,244,168]},"announce":[],"urlList":[]}}