{"title":"George-Carlin-The-Rich-People-Who-Own-America.mp4","uid":5728477,"size":11838931,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f227fb8cee3785a807d64b13cd704abed0ab3130&amp;dn=George-Carlin-The-Rich-People-Who-Own-America.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1280553635,"description":"There's a reason education sucks and it's the same reason it's never going to get better, just be happy with what you've got.\n\nBecause the owners of this country don't want that.\nI'm talking about the real owners, now, the real owners, the big wealthy business interests that control things, and make all the important decisions.\n\nForget the politicians.  The politicians are put there to give you the idea that you have freedom of choice.\nYou don't.\nYou have no choice.\nYou have owners.\nThey own you.\nThey own everything.\nThey own all the important  land.  They own and control the corporations.\nThey own and control the senate, the congress, the state houses, the city halls,\nthey've got the judges in their back pockets.\nThey own all the big media companies so they control just about all the\nnews and information you get to hear.\nThey've got you by the balls.\nThey spend billions of dollars every year lobbying to get what they want.\nWell, we know what they want; they want more for themselves and less for everybody else, but I'll tell you what they don't want.\nThey don't want a population of citizens capable of critical thinking.\nThey don't want well informed, well educated people capable of critical thinking.\n\nThey don't want people who can sit around a kitchen table and figure out how badly they're getting fucked by a system that threw them overboard thirty fuckin years ago.\n\nThey want obedient workers. \nObedient workers. \n\nPeople who are smart enough to run the machines and do the paperwork and just dumb enough to passively accept all these increasingly shittier jobs with the lower pay the longer hours the reduced benefits the end of overtime, and the vanishing pension that disappears the moment you go to collect it, and now they're coming for your Social Security money.  They want your fuckin retirement money; they want it back so they can give it to their criminal friends on Wall Street.\n\nAnd you know something?  They'll get it.  They'll get it all from you sooner or later because they own this fuckin place.  \n\nIt's a big club.  \nAnd you ain't in it.\nYou and I are not in the Big Club.\n\nBy the way it's the same Big Club they use to beat you over the head with all day long when they tell you what to believe.  All day long beating you over the head with their media, telling what to believe, what to think, what to buy.\n\nThe table is tilted folks.\nThe game is rigged, and nobody seems to notice.  Nobody seems to care.\nGood, honest, hard working people.  White collar, blue collar -- it doesn't matter what color shirt you have on -- good honest hardworking people, of modest means, continue to elect these rich cocksuckers who don't give a fuck about them.\n\nAnd nobody seems to care.\nThat's what the owners are counting on: the fact that Americans will probably remain willfully ignorant of the big Red White and Blue dick that's being jammed up their asshole every day.  Because the owners of this country know the truth - it's called &quot;The American Dream,&quot; because you have to be asleep to believe it.","torrent":{"xt":"urn:btih:f227fb8cee3785a807d64b13cd704abed0ab3130","amp;dn":"George-Carlin-The-Rich-People-Who-Own-America.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f227fb8cee3785a807d64b13cd704abed0ab3130","infoHashBuffer":{"type":"Buffer","data":[242,39,251,140,238,55,133,168,7,214,75,19,205,112,74,190,208,171,49,48]},"announce":[],"urlList":[]}}