{"title":"We All Had Doctors' Papers - Max Boyce","uid":5850247,"size":55847165,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f2db503eeb37baad8b4f478d122c3ec2c3ea8e56&amp;dn=We+All+Had+Doctors%5C%27+Papers+-+Max+Boyce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Pie_Man","files":2,"time":1285357879,"description":"\n\nWhen Max Boyce crossed the Rhigos Mountains from his home in Glynneath on November the 23rd 1973, to record an album 'Live at Treorchy Rugby Club', little did he know it would change his life. He had already recorded some of his earlier songs at the Valley Folk Club in Pontardawe and when EMI heard the album and subsequently saw Max perform live in concert, he was invited to sign a contract to record two live albums of his songs and stories.\n\n\nThe musicians for that evening were hastily gathered together that afternoon. Without almost any rehearsal, the songs and stories were recorded. The audience, apart from a few close friends were given the tickets after failing to sell them for fifty pence each. Max at the time was virtually unknown. He had, however, deliberately chosen to perform to an audience that was unfamiliar with his work to ensure the reaction was spontaneous and real.\n\n\nArmed with songs such as 'The Outside-Half Factory', 'Rhondda Grey' and 'Morgan Moon' he could hardly fail.\n\n\nThe reaction of the audience that night was integral to the evening's success. They were as important as the songs. The people that packed the little room were Max's instruments, without them he couldn't play. The people's reaction was genuine and all embracing.\n\nNo-one who was there will ever forget the heady mix of laughter and song.\n\nFollowing the success of the first album EMI were naturally eager to record a follow-up. However, not even they were prepared for the fact that the album - 'We all had Doctors' Papers'-would reach No.1 in the album charts. A feat which earned Max a place in the Guiness Book of Records as the only comedy album to achieve that coveted position.\n\n\nIt was about this time that the BBC offered Max his first T.V. series. This stayed with the trusted formula of live performance filming him at theatres all over Great Britain, which further enhanced his popularity and brought his talents to a much wider audience. The success of these programmes was reflected in the 'JICTAR' TV ratings. Filling the No.1 spot, it became the most watched programme in the country, returning astonishing viewing figures. ","torrent":{"xt":"urn:btih:f2db503eeb37baad8b4f478d122c3ec2c3ea8e56","amp;dn":"We+All+Had+Doctors%5C%27+Papers+-+Max+Boyce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2db503eeb37baad8b4f478d122c3ec2c3ea8e56","infoHashBuffer":{"type":"Buffer","data":[242,219,80,62,235,55,186,173,139,79,71,141,18,44,62,194,195,234,142,86]},"announce":[],"urlList":[]}}