{"title":"Bigger Than Life (1956) James Mason Eng","uid":5896739,"size":841986666,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f31347a77aaf587eb215207c03e0f707d3d69fcf&amp;dn=Bigger+Than+Life+%281956%29+James+Mason+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"johnefp","files":-1,"time":1287523131,"description":"Based on an article in the New Yorker, Nicholas Ray's Bigger Than Life stars James Mason (who also produced the film) as elementary school teacher Ed Avery, a thoughtful, gentle man, with a loving wife, Lou (Barbara Rush), and a young son, Richie (Christopher Olsen), who loves him. Avery is successful and well liked in his community, but he is over-extended in his pursuit of the American dream -- he secretly works a second job to earn extra money, and doesn't dare break stride, despite the increasingly painful physical spasms that he suffers. He collapses one day, and the doctors inform him that he suffers from an arterial disease that will probably give him less than a year to live. But they also offer him one hope, with treatment using cortisone, which was then a new, not-fully-tested drug. Avery makes a seemingly full recovery and returns to work, but it soon becomes clear that he's not the same -- he has a new, cavalier attitude toward money, and then Lou becomes alarmed over his expressions of rage over seemingly insignificant annoyances. He starts expressing himself in grand, exalted terms, first to Lou and then to his colleagues at school, including his closest friend, Wally Gibbs (Walter Matthau). And matters only get worse when Wally determines that it is the cortisone -- which Ed has been taking in far greater doses than prescribed -- that is making him act this way. And his obsession w ith forcing Richie to live up to his full potential soon turns into a much darker fixation. Director Ray  later offered regret over having used cortisone by name, as it was still not standard treatment and its benefits and drawbacks weren't known. But this did lend the movie a verisimilitude that was essential for what appeal it did hold for audiences. (Seven years later, screenwriter William Read Woodfield would incorporate Bigger Than Life's cortisone plot device into his script for the Voyage To The Bottom of the Sea episode \\\\&quot;Mutiny\\\\&quot;. Bigger Than Life's more immediate problem at the time lay in its broader plot -- with a story that brought drug addiction and fact-based psychological unhingement into a suburban American setting, it was a daring subject for its time, for which audiences were unprepared in 1956. It was also one of a group of offbeat pictures that Mason produced as well as starred in. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0049010/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0049010/&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-9604&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-9604&lt;/a&gt;\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:31:14\nMovie complete : Yes\n\n[Video]\nResolution : 608x256 2.38:1\nCodec : XviD MPEG-4 codec\nFPS : 25,00\nBitRate : 974 Kbps\nQuality Factor : 0,26 b/px\n\n[Audio]\nCodec : ATSC/A-52 Dolby AC3\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 256 Kbps\n\n\nPlease seed at least as much as you D/L.\n\nDon't hit and run.\n=======================================\nThanks \n\nJohn\n\n\n\n","torrent":{"xt":"urn:btih:f31347a77aaf587eb215207c03e0f707d3d69fcf","amp;dn":"Bigger+Than+Life+%281956%29+James+Mason+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f31347a77aaf587eb215207c03e0f707d3d69fcf","infoHashBuffer":{"type":"Buffer","data":[243,19,71,167,122,175,88,126,178,21,32,124,3,224,247,7,211,214,159,207]},"announce":[],"urlList":[]}}