{"title":"Autosport Magazine UK 28/10/2010","uid":5918316,"size":89736222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3e5e2de8730721613ab418aa90ba7f2ec41a2d1&amp;dn=Autosport+Magazine+UK+28%2F10%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1288316897,"description":"NEWS\n10 Red Bull: no team orders. Team claims its drivers are still free to race each other\n12 Race delay explained. Proximity of walls prevented spray from clearing quickly\n15 Maldonado's waiting. GP2 Series champion poised for Williams F1 opportunity\n20 BMW eyes Aussie V8s. Munich evaluates entry; Priaulx aims for DTM\n22 Petty team on the brink. NASCAR legend fights to keep his name in the series\n25 WRC Academy hailed. Michele Mouton praises entry level initiative's potential\n\nREPORTS\n26 Korean GP. Webber finds the wall, Vettel blows his engine, and Alonso waltzes home to victory\n40 Superleague Navarra. Dolby loses title to Rigon in dramatic season finale\n42 FIA World GT1 Navarra. Lambo torque is the key to runaway Zonta/Kechele wins\n44 Oz V8 Surfers Paradise. Whincup and Tander upstage their international guests\n46 Rally Spain. Pre-event favourite Sordo beaten by Loeb and Solberg\n55 World of Sport. NASCAR; Japanese GT; Brazilian V8; Italian F3\n\nFEATURES\n38 Korea's F1 debut. Promoter Yung Cho Chung's struggles to make the Korean GP finally happen\n58 BTCC: Plato to the fore. Nine years on from his first BTCC title, Plato found success once again \n64 BTCC: shape of 2011. Under the skin of the Next-Generation Touring Car\n66 World Series review. How Aleshin held off Red Bull protege Ricciardo\n\nSPORTS EXTRA\n85 Aces join Walter Hayes. Malvern and Vergers add to the FF1600 extravaganza's bumper entry list\n86 Historics at Pau. 'New' old-timer meeting to slot in ahead of Grand Prix\n90 Reports. Brands Hatch MSVR; Snetterton BRSCC; Mallory Masters; Lydden SEMSEC\n\nREGULARS\n101 Photo finish. Champ Car wreck, Surfers Paradise, 2002\n102 Race of my life. Ralf Schumacher, 1999 French Grand Prix\n\nOCRd by PDF Converter Professional 7. Cover has links to main stories.","torrent":{"xt":"urn:btih:f3e5e2de8730721613ab418aa90ba7f2ec41a2d1","amp;dn":"Autosport+Magazine+UK+28%2F10%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3e5e2de8730721613ab418aa90ba7f2ec41a2d1","infoHashBuffer":{"type":"Buffer","data":[243,229,226,222,135,48,114,22,19,171,65,138,169,11,167,242,236,65,162,209]},"announce":[],"urlList":[]}}