{"title":"Highway 101 - Who's Lonely Now (2nafish)","uid":5899873,"size":124045316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f408f4fe946df9be627947d3321314d29b342fc1&amp;dn=Highway+101+-+Who%5C%27s+Lonely+Now+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1287645255,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Who's Lonely Now&quot; is a 1989 single by Highway 101. &quot;Who's Lonely Now&quot; was Highway 101's ninth country hit and the last of four number one country hits. The single went to number one for one week and spent a total of twenty-six weeks on the country singles charts.\n\nPaint the Town is the third album by the American country music band Highway 101. The last of their albums featuring Paulette Carlson as lead vocalist, it included the Billboard Country #1 &quot;Who's Lonely Now,&quot; the #4 &quot;Walkin', Talkin', Cryin', Barely Beatin' Broken Heart,&quot; and the #11 &quot;This Side of Goodbye.&quot; Other great tunes were &quot;If Love Had a Heart&quot; and &quot;I'll Paint the Town,&quot; and a cover version of James Taylor's &quot;Sweet Baby James&quot;. &quot;Rough and Tumble Heart&quot; was later recorded by Pam Tillis on her 1992 album Homeward Looking Angel.\n\nHighway 101 is an American country music band founded by Paulette Carlson (lead vocals), Jack Daniels (guitar), Curtis Stone (bass guitar, mandolin) and Scott &quot;Cactus&quot; Moser (drums). With Carlson as lead vocalist, the band recorded three albums for Warner Bros. Records Nashville and charted ten consecutive Top Ten hits on the Hot Country Songs charts, four of which went to Number One. After Carlson left in 1990, the band recorded a fourth album for Warner with Nikki Nelson on lead vocals before exiting the label. One album each followed on Liberty, Intersound and Free Falls Records. Moser, Stone, Nelson and Andy Gurley comprise the current lineup.\n\nBefore the band's foundation, Carlson recorded on RCA Records as a solo singer. She made three appearances on the Hot Country Songs charts in that timespan; her singles &quot;You Gotta Get to My Heart (Before You Lay a Hand on Me),&quot; &quot;I'd Say Yes&quot; and &quot;Can You Fool&quot; respectively reached #65, #67 and #72. Carlson founded Highway 101 in 1986 in Los Angeles, California, with guitarist Jack Daniels, bassist Curtis Stone (son of singer Cliffie Stone) and drummer Scott &quot;Cactus&quot; Moser, all three of whom were session musicians.\n\nIn 1987, the band signed with Warner Bros. Records Nashville, debuting that January with the single &quot;The Bed You Made for Me,&quot; which Carlson wrote. This song spent twenty-four weeks on the Hot Country Songs charts, reaching a peak of #4. Following it were &quot;Whiskey, If You Were a Woman&quot; at #2 and two consecutive Number Ones: &quot;Somewhere Tonight&quot; (written by Rodney Crowell and Harlan Howard) and &quot;Cry, Cry, Cry.&quot; After the chart success, Highway 101 was nominated and won the award for Vocal Group of the Year at the 1988 ACM and CMA Awards.\n\nHighway 101Ã‚Â² followed in 1988. Its first single, &quot;(Do You Love Me) Just Say Yes,&quot; became the band's third consecutive Number One single; following it were the Top Ten hits &quot;All the Reasons Why,&quot; &quot;Setting Me Up&quot; and &quot;Honky Tonk Heart,&quot; at #5, #7 and #6 respectively. The next year's Paint the Town accounted for the band's final Number One, &quot;Who's Lonely Now,&quot; followed by &quot;Walkin', Talkin', Cryin', Barely Beatin' Broken Heart&quot; (originally released by Johnnie Wright) and &quot;This Side of Goodbye.&quot; A Greatest Hits album in 1990, including the #14 single &quot;Someone Else's Trouble Now.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f408f4fe946df9be627947d3321314d29b342fc1","amp;dn":"Highway+101+-+Who%5C%27s+Lonely+Now+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f408f4fe946df9be627947d3321314d29b342fc1","infoHashBuffer":{"type":"Buffer","data":[244,8,244,254,148,109,249,190,98,121,71,211,50,19,20,210,155,52,47,193]},"announce":[],"urlList":[]}}