{"title":"Bob Dylan - Political World (2nafish)","uid":5736213,"size":135409668,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f4616214e57b024b39c7d70ef4a0e78007665e69&amp;dn=Bob+Dylan+-+Political+World+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1280826969,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nOh Mercy is singer-songwriter Bob Dylan's 26th studio album, released by Columbia Records in September 1989.\n\nProduced by Daniel Lanois, critics hailed the record as a triumph for Dylan, after a string of poorly-reviewed albums. Oh Mercy gave Dylan his best chart showing in years reaching #30 on the Billboard charts in the US and #6 in the UK.\n\nWhile recovering from a hand injury in December 1987, Dylan sat at his kitchen table late one evening and wrote &quot;Political World&quot;, his first new song in a long time. It was a surprising development as he no longer felt motivated to write songs, but according to his autobiography, &quot;Political World&quot; came to him spontaneously and was easy to write; though no melody was composed, he came up with 20 verses.\n\nDylan's sudden rush of inspiration did not stop there. Days later (during the first week of 1988), he wrote verses for a second song, &quot;What Good Am I?&quot;, over the course of one evening in a small art studio located on his property. The next day, he wrote another called &quot;Dignity&quot;. Unlike his previous two songs, &quot;Dignity&quot; was written with the rhythm, tempo, and melody all in Dylan's head. Completed over the course of the entire afternoon and evening, Dylan composed the song after hearing of Pete Maravich's death on the morning news. Dylan had seen the basketball legend play in an NBA game years before and was saddened by his passing.\n\nThe album opens with &quot;Political World&quot;, a song that's been described as a &quot;catalog of troubles...almost an update on 'With God On Our Side.'&quot; A cranky tirade against the modern world, it begins with the verse, &quot;We live in a political world/Love don't have any place/We live in a time where men commit crime/And crime don't have a face&quot;, to which critic Thomas Ward asked, &quot;Which age does this not apply to?&quot;\n\nAfter disappointing sales with Knocked Out Loaded and Down in the Groove, Oh Mercy was hailed as a comeback in a year when several long-time veterans were releasing their own 'comeback' albums, including Paul McCartney with Flowers In The Dirt, The Rolling Stones with Steel Wheels, Neil Young with Freedom, Bonnie Raitt with Nick of Time, and Lou Reed with New York. Consensus was strong enough to place Oh Mercy at #15 in The Village Voice's Pazz &amp; Jop Critics Poll for 1989. Also in 1989, Oh Mercy was ranked #44 on Rolling Stone magazine's list of the 100 greatest albums of the 1980s.\n\nOh Mercy's unique production was unlike anything ever released on a Dylan record, and it drew praise from a majority of critics. Robert Christgau of The Village Voice wrote, &quot;Daniel Lanois's understated care and easy beat suit [Dylan's] casual ways, and three or four songs might sound like something late at night on the radio, or after the great flood. All are modest and tuneful enough to make you forgive 'Disease of Conceit,' which is neither.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f4616214e57b024b39c7d70ef4a0e78007665e69","amp;dn":"Bob+Dylan+-+Political+World+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4616214e57b024b39c7d70ef4a0e78007665e69","infoHashBuffer":{"type":"Buffer","data":[244,97,98,20,229,123,2,75,57,199,215,14,244,160,231,128,7,102,94,105]},"announce":[],"urlList":[]}}