{"title":"The Jenny Hendrix Anal Experience [PORNO][ANAL]","uid":5906968,"size":1463564288,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f49dacb4dabe5368d8c00a8415d0f9b6524f5fd0&amp;dn=The+Jenny+Hendrix+Anal+Experience+%5BPORNO%5D%5BANAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zurera","files":-1,"time":1287908501,"description":"Category \tAll Sex, Anal, Big Butts, 2009 AVN Award Winner\nStarring \tJenny Hendrix, Aubrey Addams, Delilah Strong, Aurora Jolie, Manuel Ferrara, Steve Holmes, Michael Stefano, Ian Scott\n\nManuel Ferrara's recent releases have been praised for a little appreciated aspect of porn - a story. In Evilution, for example, Naomi plays a stuck up housewife transformed into a slut competing for her husband's cock against Annette Schwartz ...    Full Descriptionwhom she catches him fucking. In The Jenny Hendrix Anal Experience, Director and Performer Ferrara takes the tension in a new porn girl's unfucked asshole and makes it the center of the dramatic tension. Some titles will feature a &quot;first anal&quot; and this has even been a theme in Story of O by an anonymous French author in which a girlfriend proves her love by submitting to - among other things - a first anal fucking. Ferrara updates the theme in a title which also makes allusion to the experience of a certain, super-talented guitar player from the era of psychadelic Rock N' Roll in the 1960s. Reason #1 to buy this DVD: Psychology Lesson 1 and 2. Reason #2 to buy this DVD: Replacement for Couples Therapy. Call it a couples tape. Reason #3 to buy this DVD: How to &quot;make it yourself&quot; DVD of you fucking your girlfriend in the ass.","torrent":{"xt":"urn:btih:f49dacb4dabe5368d8c00a8415d0f9b6524f5fd0","amp;dn":"The+Jenny+Hendrix+Anal+Experience+%5BPORNO%5D%5BANAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f49dacb4dabe5368d8c00a8415d0f9b6524f5fd0","infoHashBuffer":{"type":"Buffer","data":[244,157,172,180,218,190,83,104,216,192,10,132,21,208,249,182,82,79,95,208]},"announce":[],"urlList":[]}}