{"title":"cUT-UP MOVIES","uid":5746019,"size":2082588484,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f4c1de23ee91067663cda03ee28037caaa65a222&amp;dn=cUT-UP+MOVIES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jkdornelles","files":-1,"time":1281215592,"description":"PUBLISHER\\'S DESCRIPTION:\nThe most innovative technique used by William S. Burroughs is that of cut-ups, that is the chaotic and casual way of cutting and pasting (just like in computers) pieces of text in search for new meanings. Burroughs worked on this proceeding with Brion Gysin, a strange experimental painter who was the real discoverer of this technique, and together they tried to apply it to arts in general and to all media. Not only did they apply it to paper or to canvas but also on tapes - working on tape recorders and tapes as a contemporary cyberpunk would do - and , naturally, they applied it to cinema as well. It is precisely on this technique that the short films representing Thee Films are based on (the screenplay was by Burroughs and Antony Balch was the director). Even if much time had elapsed between one film and the other, they can be interpreted in a unitary way as variations on the same subject; as a matter of fact the same images appear in the different films with an editing that is always different however fast, serial and dazing; the \nsound is equally obsessive. The recurring image of a stroboscopic cylinder (the Dream Machine) that creates optical effects, is the symbol of Balch\\'s and Burroughs\\' aptitude towards deconstructing and reconstructing reality until obtaining a spasm. Burroughs, Gysin and Somerville are among the interpreters of Thee Films.\n\n\n*********************************** FREAKYFLICKS************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\\'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\t\t\n\n","torrent":{"xt":"urn:btih:f4c1de23ee91067663cda03ee28037caaa65a222","amp;dn":"cUT-UP+MOVIES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4c1de23ee91067663cda03ee28037caaa65a222","infoHashBuffer":{"type":"Buffer","data":[244,193,222,35,238,145,6,118,99,205,160,62,226,128,55,202,170,101,162,34]},"announce":[],"urlList":[]}}