{"title":"Coast To Coast Am - 09-15-10 - Cosmology &amp; The Universe","uid":5836651,"size":55553200,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f5f97517e9396f517583ac75571ffc1045a54dce&amp;dn=Coast+To+Coast+Am+-+09-15-10+-+Cosmology+%26+The+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":5,"time":1284742545,"description":"Date: 09-15-10 \n\nHost: George Noory \n\nGuests: Leonard Mlodinow  \n\nCo-author with Stephen Hawking of the best-seller Brief History of Time, Caltech physicist Leonard Mlodinow discussed his current work with Hawking on the grand design of the universe and two central questions-- where does the universe come from, and why are the laws of nature what they are? Hawking's theories and the latest research in physics were used to answer those questions. While the conditions for life are just right on Earth, Mlodinow noted that we're looking backwards at the situation-- whatever conditions it took for us to get here, have already happened. \n\nThe notion of the multiverse (many universes each with their own physical laws) is a consequence of Hawking's theory of cosmology, said Mlodinow. These various universes arose from nothing, but we now understand from quantum theory that the state of nothingness is actually very unstable, and that &quot;things are always coming and going from nothingness,&quot; he explained. Hawking's picture of the universe incorporates three theories: \n\n-A &quot;no boundary&quot; condition in which time becomes a dimension that looks like space.\n-M theory-- an extension of string theory dealing with forces like gravity.\n-Top Down Cosmology-- a new quantum approach that suggests the cosmos has many different simultaneous histories.\nMlodinow also reviewed the Big Bang theory of the origin of the universe, and the search at the Large Hadron Collider for the theoretical Higgs boson particle. Interestingly, Hawking has predicted that the Higgs particle will not be found. \n\nC2C Insta-Poll\nIn tandem with tonight's show, we polled people on how they thought the universe was created. Vote and/or view the results here. \n\nWebsite(s): \n-its.caltech.edu/~len/\nBook(s): \n-The Grand Design\n-The Drunkard's Walk: How Randomness Rules Our Lives\n","torrent":{"xt":"urn:btih:f5f97517e9396f517583ac75571ffc1045a54dce","amp;dn":"Coast+To+Coast+Am+-+09-15-10+-+Cosmology+%26+The+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5f97517e9396f517583ac75571ffc1045a54dce","infoHashBuffer":{"type":"Buffer","data":[245,249,117,23,233,57,111,81,117,131,172,117,87,31,252,16,69,165,77,206]},"announce":[],"urlList":[]}}