{"title":"Kirk Knuffke - Amnesia Brown (2010)","uid":5903316,"size":310282262,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f700f0993ed50574bfe49c784d198535c9f8b94a&amp;dn=Kirk+Knuffke+-+Amnesia+Brown+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mariorg","files":-1,"time":1287754376,"description":"Homepage: &lt;a href=&quot;\nhttp://www.kirkknuffke.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kirkknuffke.com/&lt;/a&gt;\n\nReviews:\n\n* Kirk Knuffke - Trumpet\n* Kenny Wollesen - Drums\n* Doug Wieselman - Clarinet and Guitar\n\nCleanfeed Records 2010\nRecorded December 2, 2008 at Systems Two in Brooklyn, NY.\nAll compositions by Kirk Knuffke BMI\nRecorded by Jon Rosenberg at Systems Two in Broolkyn\nMixed and mastered by Jon Rosenberg\nProduced By Kirk Knuffke\nExcecutive Production by Pedro Costa/Trem Azul\n\nReview\n~~~~~~\nBy Stef\n\nI already showed my appreciation for trumpeter Kirk Knuffke before (here,\nhere,\nhere,\nand here,\nand he keeps improving. His new album brings him in the company of Doug\nWieselman on clarinet and guitar, and Kenny Wollesen on drums, both quite known\nfrom their work on Tzadik and other &quot;downtown&quot; bands. Knuffke's music is hard to\nname: it's composed, yet full of free improvisation. It is incredibly rhythmic,\nit is melodic, yet full of surprises and curious bends. It is sweet at moments,\nlike the last track &quot;Anne&quot;, which is full of sentiment and love, but abrasive at\nothers, like the last-but-one piece &quot;Please Help, Please Give&quot;. The switch\nbetween both extremes is often the result of which instrument Wieselman\nuses. His clarinet playing is full of lyricism, his guitar playing full of\nskronk. The alternation between both is a great idea, because it adds to the\nhuge variation you get on the album. Wollesen's drumming is brilliant : his\nrhythmic inventiveness is an absolute pleasure to hear, and by itself already\nworth the purchase of the album.\n\nKnuffke's tone is warm and subtle, full of emotional power, somewhat comparable\nto Dennis GonzÃƒÂ¡lez, and his technical skills are excellent. He takes the most\ndifficult parts with ease. The first track is a good example of that : &quot;How It\nGoes&quot;, starts with a great long unison theme, after which his improvisation on\nthe theme drives it higher with strong rhythmic pulse, wonderfully accompanied\nby Wollesen. The compositions are short, most clocking around three minutes,\nwhich forces the musicians to be compact and to-the-point in their\nimprovisations. The pieces are fun, clever and full of emotional power, yet also\nheadstrong and wayward, and with more ideas in one album than you sometimes get\nfrom other musicians' entire discography. Some of the themes, like the one for\nthe title track, or of &quot;Leadbelly&quot;, keep playing in your head long after you've\nstopped listening to the album, other pieces require repeated listens before you\nreally get into them.\n\nThe album's greatest quality is its incredible power to say a lot in a few\nnotes. It is very creative, and it swings from beginning to end. This is one of\nthose albums that you want to keep listening to. What a joy!\n\nSaturday, February 13, 2010\n\n\nSergio Piccirilli &lt;a href=&quot;\nhttp://www.elintruso.com/article.php?id=1833&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elintruso.com/article.php?id=1833&lt;/a&gt;\n\nLa imaginaciÃƒÂ³n es algo que, probablemente, Kirk Knuffke heredÃƒÂ³ de sus\nancestros. Al menos eso es lo que podemos colegir del irÃƒÂ³nico tÃƒÂ­tulo de su nuevo\nÃƒÂ¡lbum ya que Amnesia Brown es el apelativo otorgado a su bisabuelo quien, en un\nalarde de imaginaciÃƒÂ³n, abandonÃƒÂ³ a su progenie aduciendo amnesia para luego\nadoptar el apellido Brown y formar otra familia en una ciudad vecina. Algo asÃƒÂ­\ncomo una laguna mental pero de dimensiones oceÃƒÂ¡nicas.","torrent":{"xt":"urn:btih:f700f0993ed50574bfe49c784d198535c9f8b94a","amp;dn":"Kirk+Knuffke+-+Amnesia+Brown+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f700f0993ed50574bfe49c784d198535c9f8b94a","infoHashBuffer":{"type":"Buffer","data":[247,0,240,153,62,213,5,116,191,228,156,120,77,25,133,53,201,248,185,74]},"announce":[],"urlList":[]}}