{"title":"Max Keiser - Truth About Markets USA - 2010 Aug 07 SA [sebaygo1]","uid":5745753,"size":18950222,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f73defec184dc5ba44d23d7e21f1dbb7e8db5aa2&amp;dn=Max+Keiser+-+Truth+About+Markets+USA+-+2010+Aug+07+SA+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":3,"time":1281208802,"description":".\n\t\t\t\t\nThe Truth About Markets: USA\n- Max Keiser &amp; Stacy Herbert -\nSaturday, 07 August 2010\n\n\n[sebaygo1]\n\n\nThis is Max Keiser's show on the GCN radio network.\nIt airs Saturday mornings from 9:00 - 10:00 Central Time.\n\n\n================================================================\n\n\nRigged market capitalists and banking oligarchs are at war with the people. With the collusion of the politicians and the central bank they own, bankers have created a gulag casino state designed to annihilate competition and prosperity.\n\nFinancial war reporter, Max Keiser, a former Wall Street banker and options trader, knows how the markets are rigged to explode at the push of one deliberately fat finger. With co-host, Stacy Herbert, the Truth about Markets team warns you of market manipulation, fraud and scandal before it destroys your wealth and opportunity.\n\nMax Keiser presents financial investigations and entertainment for television networks around the world, including Aljazeera English, BBC Worldwide, PressTV and RT. He previously hosted a CBS/KLSX Los Angeles, a segment of Access Hollywood for NBC. He's the creator of the Hollywood Stock Exchange and inventor of the virtual specialist technology on which the exchange operates.\n\nIt's time to rise up against the financial tyranny of rigged market capitalism and banking occupation!\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_torrents_info_PLEASE-READ.txt\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume support or endorsement on my\n part of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:f73defec184dc5ba44d23d7e21f1dbb7e8db5aa2","amp;dn":"Max+Keiser+-+Truth+About+Markets+USA+-+2010+Aug+07+SA+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f73defec184dc5ba44d23d7e21f1dbb7e8db5aa2","infoHashBuffer":{"type":"Buffer","data":[247,61,239,236,24,77,197,186,68,210,61,126,33,241,219,183,232,219,90,162]},"announce":[],"urlList":[]}}