{"title":"Democracy Now - 21sep 2010","uid":5844076,"size":456969852,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f74402a43e44844a081f891f38f4b3878b8ebfd7&amp;dn=Democracy+Now+-+21sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1285087245,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 21, 2010\n\n- Crash Makes 2010 Deadliest Year for NATO in Afghanistan\n- Probe: FBI Improperly Spied on Activist Groups\n- NBER: Longest Recession Since WWII\n- Obama: Majority Thinks White House &quot;Too Soft&quot; on Wall St.\n- Leaders Gather for Poverty Talks at UN\n- Mexican Newspaper Urges End to Attacks on Journalists\n- Spill Fund Won't Subtract Workers' Wages from Claims\n- Reporter: CNN Refused to Air Footage of US War Crime in Iraq\n- Muslim Leaders Denounce Islamophobia\n- Senate to Take up DADT Repeal, DREAM Act\n\n\nSpecial reports\n\n- Holbrooke Says World Cannot Foot Entire Bill for Pakistan Flood Recovery as US Spends Billions on Wars in Iraq, Afghanistan &amp; Pakistan\n\nPakistan calls for support from the international community as it struggles to recover from the worst flooding in its history. US special envoy Richard Holbrooke says the world cannot foot the entire bill for recovery as Washington continues to spend billions on the wars in Iraq, Pakistan and Afghanistan. We speak with British Pakistani political commentator, writer and activist, Tariq Ali.\n\n\n- Tariq Ali on &quot;The Obama Syndrome: Surrender at Home, War Abroad&quot;\n\nWe speak with British Pakistani political commentator, writer, activist and editor of the New Left Review, Tariq Ali. He is the author of numerous books; his latest is The Obama Syndrome: Surrender at Home, War Abroad.\n\n\n- Tony Benn on Tony Blair: &quot;He Will Have to Live 'Til the Day He Dies with the Knowledge that He Is Guilty of a War Crime&quot;\n\nWe speak with former British cabinet minister and MP Tony Benn. He was the longest-serving MP in the history of the British Labour Party, having served for more than half a century. He is now president of the Stop the War Coalition.\n\n\n- Glenn Greenwald on Iran, Tea Party Candidates, Jon Stewart and Obama's Assassination Policy\n\nWe speak with Glenn Greenwald, a constitutional law attorney and the political and legal blogger for Salon.com. Greenwald discusses White House rhetoric toward Iran; Jon Stewart's and Stephen Colbert's planned rallies in Washington, DC; the Obama administration's assassination policy that includes targeting US citizens; tea party candidates in the November midterm elections; and much more.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f74402a43e44844a081f891f38f4b3878b8ebfd7","amp;dn":"Democracy+Now+-+21sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f74402a43e44844a081f891f38f4b3878b8ebfd7","infoHashBuffer":{"type":"Buffer","data":[247,68,2,164,62,68,132,74,8,31,137,31,56,244,179,135,139,142,191,215]},"announce":[],"urlList":[]}}