{"title":"The Godfather Trilogy (HD DivX) 720p - Michael Rizzo","uid":5891131,"size":5959588393,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f78ef709ccc503c33247bc50817b42e026ef2579&amp;dn=The+Godfather+Trilogy+%28HD+DivX%29+720p+-+Michael+Rizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1287255030,"description":"We are pleased to bring you the Godfather Trilogy in High Definition DivX (HD)\nand in much lower file size than bluray format sized video files (which instead\nrequire special bluray players to load etc). As such we offer a better solution\nfor most folks here. We have kept each movie file to just 2GB each (or just a bit \nunder).\n\nEach movie is 1280 X 720 and is the closest thing to being in a movie theater\nI can tell you. Since they aren't showing these movies at the theaters much anymore, enjoy!\n\nWe have long since paid for these movies, and not every family that deserves to see this piece of culture should have to fork over a hundred bucks for bluray (or whatever the price of the discs are now) or have to buy an expensive player to boot.\n\nWe see it as a tax of sorts, we also think we have collectively paid off these movies for everyone to enjoy this version we bring to you.\n\nfor those who have the dough to fork over, go ahead and make the studios richer-\nhowever the  aint doin anything worthwhile with our dough as I write this comment.\n\n\nMichael Rizzo Chessman\n\n\nGodfather I, II and III along with great songs from the movies \nin a separate folder\n\nWe have enough bandwidth to do a quick launch here so we can return to our\nseeding efforts on Th Upstairs downstairs series on which we are short of seeds\nas of yet. Please share - and we do have speed at this time. Grazie\n","torrent":{"xt":"urn:btih:f78ef709ccc503c33247bc50817b42e026ef2579","amp;dn":"The+Godfather+Trilogy+%28HD+DivX%29+720p+-+Michael+Rizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f78ef709ccc503c33247bc50817b42e026ef2579","infoHashBuffer":{"type":"Buffer","data":[247,142,247,9,204,197,3,195,50,71,188,80,129,123,66,224,38,239,37,121]},"announce":[],"urlList":[]}}