{"title":"Radio 2 Comedy Season - Carry On Forever! - Audio Comedy - MP3 -","uid":5707706,"size":108577108,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f7c779edbc7d5288debd064b7a6c81533fda9aec&amp;dn=Radio+2+Comedy+Season+-+Carry+On+Forever%21+-+Audio+Comedy+-+MP3+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":2,"time":1279761261,"description":"Carry On Forever! - Audio Comedy - BBC Radio 2 \n2 x 60 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nOver two laughter-packed programmes, Carry On star Leslie Phillips traces the development of the comedy series and considers its ongoing legacy. He hears from surviving cast members, plays classic clips, and listens back to Kenneth Williams, Sid James, Charles Hawtrey, Hattie Jacques and Joan Sims via the BBC's vast archive.\n\nThe genre is said to reflect the changing Britain of the 50s, 60s and 70s and Carry On experts are on hand to analyse what it all meant. They'll be looking at how the films would often send up British institutions like the NHS, Monarchy and Empire, while others would spoof Hollywood blockbusters with a Carry On take on espionage, the Wild West and horror.\n\nPart one looks at the origins of the first Carry On film (Carry On Sergeant) and examines how the sophomore outing (Carry On Nurse) was such a big hit in America. It also explores how the Carry On franchise worked and the team's approach to the schedule.\n\nHelping Leslie remember the good old days are fellow Carry On actors Anita Harris, Shirley Eaton, Valerie Leon, Liz Fraser, Kenneth Cope and Jacki Piper. The programme also hears from Carry On experts Robert Ross and Steve Gerard, as well as writer John Antrobus. And, via archive, from producer Peter Rogers and director Gerald Thomas.\n\nThere are also regular interruptions from 'Kenneth Williams' and 'Frankie Howerd', courtesy of Carry On fan and impersonator David Benson.\n\nIn part two, he examines their increasing loss of innocence as more relaxed rules on censorship made the series writers and producers ever bolder. The programme looks at the controversy over payments to the Carry On stars. It also examines the often overlooked Carry On TV series and the numerous stage shows the films spurned.\n\nLeslie discovers more about the films that were never made, before coming back to the series' last entry, 1992's Carry On Columbus. Julian Clary and others offer their thoughts on why, according to many, the last Carry On just didn't make the grade. There's also a look at why the franchise remains popular to this day - with stamps, cups, t-shirts and DVDs - as Leslie examines why Britain just seems to want to Carry On Forever.\n\nThere are further great clips of Sid, Kenny, Babs, Charlie and the gang as well as interviews from the archives with Jim Dale, Bernard Bresslaw and Jack Douglas. Remembering the 1970s Carry On era are Shirley Eaton, Liz Frazer, Kenneth Cope, Anita Harris, Valerie Leon, writer John Antrobus and Carry On experts Robert Ross and Steve Gerard, as well as producer Peter Rogers and Director Gerald Thomas via the BBC's archives.\n\nAnd 'Kenneth Williams' and 'Frankie Howerd' continue to interrupt as their voices are brought back to life via impersonator and actor David Benson.\n\n\n\nCarry On Forever! - 01 of 02\nCarry On Forever! - 02 of 02\n\n\n\nAudio Format    : MP3\nDuration        : 54mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits","torrent":{"xt":"urn:btih:f7c779edbc7d5288debd064b7a6c81533fda9aec","amp;dn":"Radio+2+Comedy+Season+-+Carry+On+Forever%21+-+Audio+Comedy+-+MP3+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c779edbc7d5288debd064b7a6c81533fda9aec","infoHashBuffer":{"type":"Buffer","data":[247,199,121,237,188,125,82,136,222,189,6,75,122,108,129,83,63,218,154,236]},"announce":[],"urlList":[]}}