{"title":"Democracy Now - 11 oct 2010","uid":5880895,"size":454691799,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f83129e3c3ddad48f0f5d883657f289b28a7b8fd&amp;dn=Democracy+Now+-+11+oct+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1286829108,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 11, 2010\n\n- White House Opposes National Moratorium on Foreclosures\n- 96,000 Jobs Lost in September\n- China Places Wife of Nobel Peace Prize Winner under House Arrest\n- NY GOP Candidate: Stop Brainwashing Children about Homosexuality\n- Photos Show GOP Candidate in Ohio Dressed as a Nazi\n- Israeli Cabinet Approves Loyalty Oath for New Citizens\n- Former GuantÃƒÂ¡namo Prisoner Sues US Citing &quot;Kafkaesque Nightmare&quot;\n- SOA Graduate Implicated in Attempted Coup in Ecuador\n- Gunman Cites Glenn Beck as Inspiration for Plot Against ACLU &amp; Tides\n- 10/10/10 Climate Work Party Events Held in 188 Nations\n\n\nSpecial reports\n\n- Exclusive: British Novelist John le Carre on the Iraq War, Corporate Power, the Exploitation of Africa and His New Novel, &quot;Our Kind of Traitor&quot;\n\nToday, we spend the hour, in a national broadcast exclusive, with world-renowned British novelist John le Carre, the pen name of David Cornwell. Le Carre's writing career spans half a century, during which he has established himself as a master spy writer. His latest novel, his twenty-second, is out this week, entitled Our Kind of Traitor. David Cornwell worked in the British Secret Services from the late 1950s until the early 1960s, at the height of the Cold War. His third novel, The Spy Who Came in from the Cold, became an international bestseller. As the Cold War ended, le Carre continued to write prolifically, shifting focus to the inequities of globalization, unchecked multinational corporate power, and the role national spy services play in protecting corporate interests. &quot;The things that are done in the name of the shareholder are, to me, as terrifying as the things that are done-dare I say it-in the name of God,&quot; le Carre tells Democracy Now! Perhaps best known among his many post-Cold War novels is The Constant Gardener, depicting a pharmaceutical company's exploitation of unwitting Kenyans for dangerous, sometimes fatal, drug tests. In this rare US interview, le Carre also discusses Tony Blair's role in the Iraq war, US policy toward Iran, and international money laundering.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f83129e3c3ddad48f0f5d883657f289b28a7b8fd","amp;dn":"Democracy+Now+-+11+oct+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f83129e3c3ddad48f0f5d883657f289b28a7b8fd","infoHashBuffer":{"type":"Buffer","data":[248,49,41,227,195,221,173,72,240,245,216,131,101,127,40,155,40,167,184,253]},"announce":[],"urlList":[]}}