{"title":"Dragonetti theruthlesscontractkiller(2010)PALDVD(multisubs)NLT-R","uid":5914870,"size":4620057035,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f8e518748b6de99a93a672f94b2bb19623452a34&amp;dn=Dragonetti+theruthlesscontractkiller%282010%29PALDVD%28multisubs%29NLT-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"beheerder","files":-1,"time":1288176664,"description":"Dragonetti theruthlesscontractkiller(2010)PALDVD(multisubs)NLT-Release\n\n\nRegie: Jonas Wolcher\nStudio: Sick Films\nSpeelduur: 105 min.\n\nClaudio Dragonetti is een Italiaanse huurmoordenaar een van de beste in de business. Hij is gecontracteerd door Ivan, een lokale maffiabaas in GÃƒÂ¶teborg die wilt dat Dragonetti twee rivalen vermoord. De baan is schijnbaar eenvoudig voor een ervaren moordenaar, maar deze keer gaat er iets vreselijk mis toen de verkeerde personen zijn gedood. Dragonetti vindt zichzelf nu het doelwit van zowel de maffia en de Zweedse overheid.\nMaar Claudio Dragonetti heeft een troefkaart in zijn mouw onbekend zijn vijanden. Hij heeft een deal met de duivel om hem vrij en vrijwel onkwetsbaar te maken. De enige kosten voor dit was zijn onsterfelijke ziel.\nFrequente FFF publiek zijn zeker vertrouwd met de Dragonetti karakter van de korte film en het festival favoriete Die ZombiejÃƒÂ¤ger uit 2005. In deze film, regisseur Jonas Wolcher neemt de sprong van kort tot feature length en hij doet dat zonder verlies van zijn gevoel van uitbuiting op de meest onderhoudende podium. Wolcher beschrijft zijn film als een mengsel van Hellraiser, Rambo en Ichi The Killer.\n****************************************\n\nRegie: Jonas Wolcher\nStudio: Sick FIlms\nRuntime: 105 min\n\nClaudio Dragonetti is an Italian assassin ? one of the best in the business. He is contracted by Ivan, a local mafia boss in Gothenburg who needs Dragonetti?s services to eliminate two rivals. The job is seemingly easy for an experienced assassin but this time something goes horribly wrong when the wrong targets are taken out. Dragonetti now finds himself the target of both the mafia and the Swedish government.\nBut Claudio Dragonetti has a trump card up his sleeve unknown to his enemies. He has made a deal with Satan to make him pretty much invulnerable. The only cost for this was his immortal soul.\nFrequent FFF audiences are surely familiar with the Dragonetti character from the short film and festival favourite Die ZombiejÃƒÂ¤ger from 2005. In this film, director Jonas Wolcher takes the leap from short to feature length and he does so without losing his sense of exploitation at its most entertaining stage. Wolcher describes his film as a mixture of Hellraiser, Rambo and Ichi The Killer.\n\nDvD Inf0:\nSource= Dragonetti The Ruthless Contract Killer 2010 STV SE PAL DVDR-TV2LAX9\nViDEO: Untouched (DVD5)\nAUDIO: English DD 2.0 \nSUBS: English &amp; Custom NL by Gollums-Team tnx PeepZZZ   \nSTRiPPED: Warning\nMENU: yes Untouched\nImdB Inf0: None\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail \nOndertitels : Nederlands (instelbaar)\nEngels (instelbaar) \nGenre : Actie Misdaad Horror Thriller\n \nWeblink : http://www.darkdisc.com/product.asp?product=11626 \n &lt;a href=&quot;\nhttp://www.youtube.com/watch?v=YHNrz529FPA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.youtube.com/watch?v=YHNrz529FPA&lt;/a&gt;\n\nEnjoy the movie\n\nXX-Men-nlt-release","torrent":{"xt":"urn:btih:f8e518748b6de99a93a672f94b2bb19623452a34","amp;dn":"Dragonetti+theruthlesscontractkiller%282010%29PALDVD%28multisubs%29NLT-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8e518748b6de99a93a672f94b2bb19623452a34","infoHashBuffer":{"type":"Buffer","data":[248,229,24,116,139,109,233,154,147,166,114,249,75,43,177,150,35,69,42,52]},"announce":[],"urlList":[]}}