{"title":"Kid Glove Killer (VHS) [1942] Van Heflin","uid":5875019,"size":741321098,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f963978e7c5febb4e1e2c031fd112182e191c9e1&amp;dn=Kid+Glove+Killer+%28VHS%29+%5B1942%5D+Van+Heflin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ThorntonWilde","files":5,"time":1286604163,"description":" &lt;a href=&quot;http://bayimg.com/JAPhdaACk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/JAPhdaACk&lt;/a&gt;\n\nKid Glove Killer (1942) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0034941/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0034941/&lt;/a&gt;\n\nKid Glove Killer is a 1942 crime film starring Van Heflin as a criminologist investigating the murder of a mayor. The B film was the feature-length directorial debut of Fred Zinnemann.\n\n  Van Heflin  ...  Gordon McKay  \n  Marsha Hunt  ...  Jane Mitchell  \n  Lee Bowman  ...  Gerald I. Ladimer  \n  Samuel S. Hinds  ...  Mayor Daniels  \n  Cliff Clark  ...  Captain Lynch  \n  Eddie Quillan  ...  Eddie Wright  \n  John Litel  ...  Matty  \n  Cathy Lewis  ...  Bessie Wright (as Catherine Lewis)  \n  Nella Walker  ...  Mrs. Daniels  \n\nKid Glove Killer isn't the kind of high-profile film that attracted huge audiences when it first appeared in 1942 but those who saw it recognized it as a first rate B-picture from a talented director. At the time Variety even said it was &quot;one of those moderately-budgeted programmers that appear at long intervals to rise far above the level intended.&quot; Today we know all about director Fred Zinnemann (He won Oscars for From Here to Eternity (1953) and A Man for All Seasons, 1966), here making his feature debut, and actor Van Heflin, in his first starring role. But it's really the suspenseful narrative and forensic detail that makes Kid Glove Killer so memorable.\n\nThe film isn't a straight mystery but is what's known as a procedural, where the emphasis isn't on who did the crime but how the culprit is caught. From the opening viewers know the identity of the mayor's murderer but it's up to criminologist Heflin and his assistant Marsha Hunt to track down the guilty party. Standing in the way are a slick lawyer and corrupt government officials.\n\nFred Zinnemann had been working in the MGM shorts division, directing numerous entries in the Crime Does Not Pay series (he even won an Oscar for one, That Mothers Might Live, 1938). When the time came for him to make the jump to feature films, Zinnemann brought along the concise technique and sense of focus he learned making shorts. You can see that reflected not only in the tight 72-minute running time of Kid Glove Killer but also from the fact that it took only a mere three weeks to film it - without incident. The director later recalled that Ava Gardner -- who appears briefly as a car hop -- thought she did such a bad job she was ready to give up acting. (A very young Robert Blake is also glimpsed briefly in a car.) Zinnemann later claimed that during the film's preview, Louis Mayer and other studio executives learned about Carole Lombard's death and left during the screening. However, he may have been mistaken about this since Lombard's death was in January 1942, several months before the film's release and this was during a time when films were rarely held from release.\n\nScreenwriter John C. Higgins had previously worked with Zinnemann on the Crime Does Not Pay series (in fact Kid Glove Killer is in some respects a remake of an earlier short called They're Always Caught). Higgins would later script some of Anthony Mann's early film noirs. \n\nMarsha Hunt, the female lead in Kid Glove Killer, had an interesting career. She was a model who started working for Paramount and Fox in the mid-30s before signing with MGM in 1939. She appeared in numerous films including Pride and Prejudice (1940) and Blossoms in the Dust (1941) but was blacklisted during the 1950s and turned increasingly to TV appearances (including episodes of The Twilight Zone, Murder She Wrote and Star Trek: The Next Generation) and charity work. Oddly enough, a child support suit against Mick Jagger by somebody else named Marsha Hunt caused some news reports to confuse the two. Hunt later appeared on TV reciting a poem pointing out that she had never been involved with Jagger.\n\n","torrent":{"xt":"urn:btih:f963978e7c5febb4e1e2c031fd112182e191c9e1","amp;dn":"Kid+Glove+Killer+%28VHS%29+%5B1942%5D+Van+Heflin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f963978e7c5febb4e1e2c031fd112182e191c9e1","infoHashBuffer":{"type":"Buffer","data":[249,99,151,142,124,95,235,180,225,226,192,49,253,17,33,130,225,145,201,225]},"announce":[],"urlList":[]}}