{"title":"Enemy at the Gates.DvdRip.Dutch sub.2001.Xvid |  X-Jaguar-X  |","uid":5791126,"size":1461120810,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fa6be1ea40e638f1758233cf0b2d3c95f3a00c81&amp;dn=Enemy+at+the+Gates.DvdRip.Dutch+sub.2001.Xvid+%7C++X-Jaguar-X++%7C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"X-Jaguar-X","files":3,"time":1282850898,"description":"Thanks For Downloading My Torrent.!\n\nPlease Leave a Comment. To let me know what you think about it. \n\n-------------------------------------------------------------------------------\n\nReviews: ( English And Dutch ) \n\n\n(WITH DUTCH SUBTITLE! If you don't Wanna use Dutch sub You can remove it easly. Its a .SRT file. | ENJOY THE MOVIE | )\n\n-------------------------------------------------------------------------------\n\nEnglish:\n\n&quot;Enemy At The Gates&quot; takes place in 1942 and details a cat and mouse chase between two snipers. The mouse is a young Russian named Vassili Zaitsev (Jude Law), who arrives on the shores of the Volga River to defend Stalingrad, an important city in which the German's are attempting to capture. Zaitsev soon finds himself befriending a political officer named Danilov (Joseph Fiennes), who is impressed by the soldiers quick skills and decides to glorify him through the local press. Zaitsev becomes a political icon for the locals, giving them encouragement and increasing their hope for victory.\n\nThe cat is an opposing sniper named Major Koenig (Ed Harris), a famous sharpshooter called upon to kill Zaitsev. Koulikov (Ron Perlman), another talented sniper, is assigned to help Zaitsev in killing Koenig before the Major takes a victory shot. To further complicate matters, Zaitsev falls in love with another soldier, Tania (Rachel Weisz), whose parents were killed by the enemies, and wants to redeem their honor.\n\n&quot;Enemy At The Gates&quot; certainly paints a vivid, graphic depiction of war. The atmosphere is unsettling and bleak, the characters are almost always dirty and sleepless, the fighting scenes consist of brief, short, instantaneous shots, but the sequences are fast-paced, genuine, and disturbing. The city looks battered and tormented. The dialogue goes hand and hand with the character's actions; the plot is challenging and the movie is focused, about something solid. In the sequences where Koenig and Zaitsev challenge one another, the tension is very effective. The movie tends to realize that, and concentrates a great deal of effort in making those scenes suspenseful and taut.\n\nJoseph Fiennes plays a meek, nervous character and does a good job at bringing him to life believably. Jude Law, whose last work in &quot;The Talented Mr. Ripley&quot; provides a tough act to follow, accomplishes great things with a determined and assiduous character. Ed Harris is the standout actor here, in a harrowing, steadfast, juicy performance. Rachel Weisz cannot do a whole lot with her character, however. She often feels strained and contrived.\n\n&quot;Enemy At The Gates&quot; tries hard to express the subject of the media's influence in our culture. If the film, co-written and directed by Jean-Jaques Annaud (&quot;Seven Years in Tibet&quot;), would have stayed on that concept, it would have been a whole lot better. The romance between Zaitsev and Tania is kind of unnecessary, and I am not sure if the sex scene is obligatory or advances their relationship. This love side story lacks passion; a lot of it feels mechanical and routine. &quot;Enemy At The Gates&quot; is still a consistently intriguing war film-rare because it does not involve Americans. While we are never really concerned about the outcome of the actual war, nor do we entirely care about several aspects of the main characters, there are many good scenes of suspense, and the overall mood of the movie is effective. &quot;Enemy at the Gates&quot; is worth seeing if it sounds interesting to you. \n\n-------------------------------------------------------------------------------\nDutch:\n\n\nEnemy at the gates vertelt het verhaal van de Russische soldaat Vasili Zajtsev bij de slag om Stalingrad (1942-1943). De politieke commissaris Danilov wordt zijn beste vriend en zorgt ervoor dat hij bij de sluipschutters komt. Vasili wordt een Rusissche held door veel Duitse officieren te doden. De Duitsers reageren hierop door een van de beste sluipschutters uit hun leger te sturen, een zekere Erwin KÃƒÂ¶nig.\n\nEr ontstaat een steeds terugkerende strijd tussen beide sluipschutters die telkens onbeslist eindigt. Ondertussen vindt Vasili in Tania zijn ware liefde, maar zonder dat hij het merkt raakt Danilov ook verliefd op haar. Vasili komt vaak bij een huis waar een jongetje (Sacha Filipov) en zijn moeder verblijven. Danilov zorgt ervoor dat het jongetje valse informatie aan de Duitse sluipschutter doorspeelt. Deze komt erachter dat hij door de jongen is bedrogen en hangt hem op. Uiteindelijk weet Danilov de positie van Erwin KÃƒÂ¶nig aan Vasili bloot te geven door zichzelf als levend doelwit op te offeren waarna Vasili de Duitse officier kan doden. Na afloop van de slag wordt Vasili in een ziekenhuis met de van haar wonden herstellende Tania herenigd.\n\n\n----------------------- \n x   x           x   x\n  x x             x x\n   x  - Jaguar -   x\n  x x             x x\n x   x           x   x\n-----------------------","torrent":{"xt":"urn:btih:fa6be1ea40e638f1758233cf0b2d3c95f3a00c81","amp;dn":"Enemy+at+the+Gates.DvdRip.Dutch+sub.2001.Xvid+%7C++X-Jaguar-X++%7C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa6be1ea40e638f1758233cf0b2d3c95f3a00c81","infoHashBuffer":{"type":"Buffer","data":[250,107,225,234,64,230,56,241,117,130,51,207,11,45,60,149,243,160,12,129]},"announce":[],"urlList":[]}}