{"title":"InuYasha_49","uid":5715512,"size":4523380736,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fa7311b1c718dd3db0ce6efbf852f98d80dfe151&amp;dn=InuYasha_49&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiagofavi2612","files":1,"time":1280076986,"description":"InuYasha ÃƒÂ© um hanyou (meio-youkai), por ser filho de um youkai e de uma humana. Desta forma, os youkais possuem poderes diferenciados. Kagome Higurashi ÃƒÂ© uma garota japonesa dos tempos atuais e ainda estudante colegial. Certa vez ela descobre uma passagem secreta em um poÃƒÂ§o de sua casa, que ÃƒÂ© um templo muito antigo, e volta no tempo, para o JapÃƒÂ£o feudal, onde encontrou InuYasha.\nKagome, ÃƒÂ© uma garota comum que mora no JapÃƒÂ£o, e ÃƒÂ© puxada por um poÃƒÂ§o misterioso, perseguida por um monstro, e vai parar no JapÃƒÂ£o na ÃƒÂ©poca Feudal (Sengoku Jidai), em um vilarejo. LÃƒÂ¡ encontra Kaede, e enquanto conversam, o mostro volta e tenta matar Kagome, e pegar a JÃƒÂ³ia das 4 Almas(Shikon no Tama em japonÃƒÂªs) que estÃƒÂ¡ em seu corpo, entÃƒÂ£o ela foge para a floresta. Durante a perseguiÃƒÂ§ÃƒÂ£o, ela encontra Inu Yasha (um meio Youkai cachorro) preso a uma ÃƒÂ¡rvore por uma flecha que foi lanÃƒÂ§ada por Kikyou (irmÃƒÂ£ mais velha de Kaede, namorada de Inu Yasha, mas ambos foram enganados, e Inu Yasha que queria se transformar em um humano completo para viver com Kikyou decidiu se tornar um demÃƒÂ´nio completo, entÃƒÂ£o brigaram). Ele acorda e pede a Kagome para soltÃƒÂ¡-lo para salvÃƒÂ¡-la do monstro que a perseguia. Ela o solta, e ele destrÃƒÂ³i o monstro. Logo tenta matar Kagome tambÃƒÂ©m, para pegar a JÃƒÂ³ia das 4 Almas, mas Kaede aparece e joga no pescoÃƒÂ§o de Inu Yasha um rosÃƒÂ¡rio, colar, pedindo para que Kagome fale uma palavra espiritual (qualquer palavra), que ela seria a chave para acalmar Inu Yasha. Ela fala &quot;Senta&quot; (osuwari em japonÃƒÂªs) inspirada nas orelhas do Youkai, e ele cai no chÃƒÂ£o. Eles passam a depender um do outro pois Kagome sente a presenÃƒÂ§a dos pedaÃƒÂ§os da jÃƒÂ³ia de quatro almas, e Inu Yasha a protege contra os monstros que aparecem no caminho. Inu Yasha quer a jÃƒÂ³ia para se transformar em um youkai completo e mais poderoso, e Kagome porque a despedaÃƒÂ§ou e tem essa obrigaÃƒÂ§ÃƒÂ£o. No comeÃƒÂ§o os dois se odeiam, mas depois comeÃƒÂ§am a se apaixonar.","torrent":{"xt":"urn:btih:fa7311b1c718dd3db0ce6efbf852f98d80dfe151","amp;dn":"InuYasha_49","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7311b1c718dd3db0ce6efbf852f98d80dfe151","infoHashBuffer":{"type":"Buffer","data":[250,115,17,177,199,24,221,61,176,206,110,251,248,82,249,141,128,223,225,81]},"announce":[],"urlList":[]}}