{"title":"Stargate SG-1 S08 D6 (retail) 2Lions-Team","uid":5722145,"size":4639737799,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fa7ab931db5366c270004c621b8f1be42c7f5470&amp;dn=Stargate+SG-1+S08+D6+%28retail%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wietseherman","files":45,"time":1280278457,"description":"Stargate SG-1 S08 D6 (retail) 2Lions-Team\n\nNL Info\nCitizen Joe  - Een kapper komt bij O'Neill met het verhaal dat hij in allerlei visioenen te zien heeft gekregen de avonturen van SG-1\n\nMoebius - deel 1&amp;2 - Dr. Langford is overleden en laat haar bezittingen na aan Daniel. Daniel ontdekt dat Ra in het bezit was van een ZPM. Daarom maakt SG-1 een reis terug in de tijd met een Puddlejumper  die een tijdmachine aan boord heeft. Helaas verandert de tijdlijn, en zijn ze gedwongen opnieuw terug in de tijd te reizen om de tijdlijn te herstellen.\n\nEN info\nCitizen Joe - An Indiana barber who carries the ATA Gene has his life ruined when, through an Ancient device, he begins to have visions of SG-1's missions.\n\nMoebius - Part 1&amp;2 - SG-1 uses an Ancient Puddle Jumper to time-travel back to ancient Egypt to recover a ZPM. However, they cause Ra to take the Stargate at Giza with him when he leaves Earth, altering the future so the SGC doesn't exist, An alternate-reality SG-1 must go back in time and fix the past to save the future. \n\nStargate SG-1 S08 D5 (retail) 2Lions-Team \n\nNL Info\nReckoning  - deel 1 &amp; 2 - De Replicarter valt aan en Baal vraagt de SG-1 om hulp. Teal'c en Bra'tac gaan proberen een Jaffa heiligdom te veroveren. Sam en Teal'C ontdekken dat de Jaffa tempel eigenlijk een wapen van Ouden is. In een race tegen de klok moeten ze opnemen tegen Baal, Anubis en Replicarter.\n\nThreads - DaniÃƒÂ«l wordt opnieuw gevraagd of hij wil opstijgen. Ondertussen probeert Anubis het Wapen van de Ouden op Dakara te veroveren.\n\nEN Info\n\nReckoning  - Part 1&amp;2 - Teal'c is preparing the Jaffa rebellion to capture the Holy planet Dakara, where the first larval Goa'uld implantation took place, Struggling with RepliCarter, Daniel halts the Replicators long enough for Samantha Carter, Jacob Carter, and Ba'al to use a combination of the device that dials every Stargate in the galaxy.\n\nThreads - Daniel Jackson must choose death or powerless Ascension whilst Anubis plans to end all life in the galaxy using the Dakara Superweapon.\n\nSource : retail\nFormat : DVD5\nVideo : Pal\nSound : DD 5.1\nLanguages : EN\nMenu : Yes\nExtra : No\nSubs : EN NL FR \nCover: Only front\n\nWeblink: http://www.imdb.com/title/tt0118480/\n\n\nBrought to you by\nB2B\n2Lions Team, Film Terminal\n\nmeer zien??\nKom dan eens kijken op een van onze site's\n  &lt;a href=&quot;\nhttp://www.2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl/index.php&lt;/a&gt; of http://www.film-terminal.org/forum/\n\n2Lions-Team and Film Terminal for all your Dutch MOVIES and more\n\n*****************************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.\n\n*****************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team and Film Terminal are not responsible for the fake posts on our name\n\nWij 2Lions-Team en Film Terminal zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nto the fakers , get a life !!!\n\n*****************************************************","torrent":{"xt":"urn:btih:fa7ab931db5366c270004c621b8f1be42c7f5470","amp;dn":"Stargate+SG-1+S08+D6+%28retail%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7ab931db5366c270004c621b8f1be42c7f5470","infoHashBuffer":{"type":"Buffer","data":[250,122,185,49,219,83,102,194,112,0,76,98,27,143,27,228,44,127,84,112]},"announce":[],"urlList":[]}}