{"title":"Grotesque.Tactics.Evil.Heroes-ViTALiTY","uid":5688055,"size":712972541,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fa8f3a87a58bb94db8155ffd2d68fb188ca56881&amp;dn=Grotesque.Tactics.Evil.Heroes-ViTALiTY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thenoobish","files":49,"time":1278975812,"description":"Grotesque Tactics Evil Heroes (c) Silent Dreams\n\nProtection ...: Online-Activation\n\nDate .........: July 2763  Number of Discs ...........: 1\n\nGAME NOTES\n\n\n\n\n\n\n\nGrotesque   Tactics:   Evil   Heroes   is   an   ironical,\nstory-intensive fantasy RPG with  tactical  elements.  The\ngame follows young recruit Drake, who has  failed  at  the\nmilitary academy exam. Humiliated and frustrated he  wants\nto end his life by  jumping  into  the  throat  of  brutal\nmushrooms. But then he learns that hes not the  only  one\ndisappointed and that there are others  who  cant  go  on\nwith their lives.  He  comes  across  the  last  depressed\nremains of the kingdoms army which return  badly  injured\nfrom an all or nothing battle. One of the survivors is the\nmost  popular  hero  of  all  mankind:  Holy  Avatar.  The\narrogant knight in shiny armor tells you  how  a  suddenly\nappearing sect crushed the whole kingdoms army. The  land\nGlory is overrun by  creatures  of  the  Dark  Church  and\nwhats even worse, HE, the mighty Holy Avatar, was  beaten\nthe first time in his life.\n\nNow it is on YOU, Drake, to recruit a force and fight  off\nthe Dark Church before the  population  learns  about  the\ndefeat and runs scared. However, all the lands heroic men\nare deadly injured or already dead. Only the most  dubious\nand criminal creatures are left, deeply hidden in the high\nsecurity dungeons. Well... and there still  are  the  most\nevil creatures of all: WOMEN! Yet they have no  choice  if\nthey want to  rescue  the  land  from  the  Dark  Churchs\nfanatic claws. Established are the Evil Heroes!\n\n\n\n\n\nINSTALL NOTES\n\n\n\nUnpack\nBurn or mount\nInstall\nCopy the content from the Crack folder","torrent":{"xt":"urn:btih:fa8f3a87a58bb94db8155ffd2d68fb188ca56881","amp;dn":"Grotesque.Tactics.Evil.Heroes-ViTALiTY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa8f3a87a58bb94db8155ffd2d68fb188ca56881","infoHashBuffer":{"type":"Buffer","data":[250,143,58,135,165,139,185,77,184,21,95,253,45,104,251,24,140,165,104,129]},"announce":[],"urlList":[]}}