{"title":"Democracy Now - 30 sep 2010","uid":5858386,"size":457228851,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fb2e1c8ea32c956e57710aed294fa7f13cd823a3&amp;dn=Democracy+Now+-+30+sep+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1285876502,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 30, 2010\n\n- Pakistan Blocks Afghan War Supply Route after NATO Strike\n- UN Human Rights Council Backs Gaza Probe\n- Federal Judge Rejects Gitmo Deaths Suit\n- Gitmo Prisoner Appeals Standards on Court Challenges\n- House Backs Tariffs on China\n- Lawmakers Authorize $7.4B for 9/11 Responders\n- Dems Abandon Net Neutrality Bill\n- US Imposes Sanctions on 8 Iranian Officials\n- JPMorgan Chase Suspends Foreclosures\n- Anti-Gay Bullying Leads to 4 Suicides Nationwide\n- 2010 Right Livelihood Award Winners Announced\n\n\nSpecial reports\n\n- Ann Jones on &quot;War Is Not Over When It's Over: Women and the Unseen Consequences of Conflict&quot;\n\nAnn Jones has spent much of the past nine years in Afghanistan working as a journalist, photographer and humanitarian aid worker. She has focused largely on the impact the war has had on the women of Afghanistan. Her new book is War Is Not Over When It's Over: Women and the Unseen Consequences of Conflict.\n\n\n- Henry Red Cloud of Oglala Lakota Tribe on Native American Anti-Nuclear Activism, Uranium Mining, and the Recession's Toll on Reservations\n\nThe Nuclear-Free Future Awards are being awarded tonight at New York's historic Cooper Union. The prize has been described as the most important anti-nuclear award in the world. We speak to one of this year's winners, Henry Red Cloud, the great-great grandson of Chief Red Cloud. Henry Red Cloud is a member of the Oglala Lakota tribe and founder of Lakota Solar Enterprises, one of the nation's first Native American-owned and-operated renewable energy companies.\n\n\n- Year of the Conservative Woman? As Republicans Tout Field of Women Candidates, a Debate with Betsy Reed of The Nation and Former GOP Candidate Princella Smith\n\nSharron Angle, Christine O'Donnell, Carly Fiorina, Meg Whitman, Linda McMahon-is 2010 the year of the conservative woman? With the midterm elections less than five weeks away, we host a debate between Princella Smith, who recently attempted to become the first black Republican woman elected to Congress, and Betsy Reed, executive editor of The Nation magazine.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fb2e1c8ea32c956e57710aed294fa7f13cd823a3","amp;dn":"Democracy+Now+-+30+sep+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb2e1c8ea32c956e57710aed294fa7f13cd823a3","infoHashBuffer":{"type":"Buffer","data":[251,46,28,142,163,44,149,110,87,113,10,237,41,79,167,241,60,216,35,163]},"announce":[],"urlList":[]}}