{"title":"Vengeance Valley [1951] Burt Lancaster","uid":5738501,"size":354090474,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fc5fe7fe6f55a2fd0aa8a26e0ec014f46899e330&amp;dn=Vengeance+Valley+%5B1951%5D+Burt+Lancaster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1280917490,"description":" &lt;a href=&quot;http://bayimg.com/PAoFlaaCb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/PAoFlaaCb&lt;/a&gt;\n\nVengeance Valley (1951) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0044186/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0044186/&lt;/a&gt;\n\nVengeance Valley (1951) is a Western film starring Burt Lancaster, based on the novel by Luke Short.\n\n\n Burt Lancaster ...  Owen Daybright \n Robert Walker ...  Lee Strobie \n Joanne Dru ...  Jen Strobie \n Sally Forrest ...  Lily Fasken \n John Ireland ...  Hub Fasken \n Carleton Carpenter ...  Hewie \n Ray Collins ...  Arch Strobie \n Ted de Corsia ...  Herb Backett \n Hugh O'Brian ...  Dick Fasken \n Will Wright ...  Mr. Willoughby \n Grayce Mills ...  Mrs. Burke (as Grace Mills) \n Jim Hayward ...  Sheriff Con Alvis (as James Hayward) \n James Harrison ...  Orv Esterly \n Stanley Andrews ...  Mead Calhoun \n\nNotable as Burt Lancaster's first Western, Vengeance Valley (1951) had a decidedly &quot;adult&quot; plot for its era, one involving illegitimate birth, sibling rivalry and dysfunctional families. At the center were Owen Daybright (Lancaster), an honest ranch foreman, and his half-brother Lee Strobie (Robert Walker), a troublemaker who is clearly the bad seed in the family. Both men are in love with cafe waitress Lily Fasken (Sally Forrest), a situation which becomes volatile when Lily gets pregnant and her two angry brothers come gunning for the responsible party.\n\nBurt Lancaster was still in the early phase of his film career when he took over the starring role in Vengeance Valley, a role described as &quot;a typical John Wayne part,&quot; one given over to uncomplicated good guy heroics. Lancaster's apparent ease in the saddle and his rough hewn, rawhide appearance demonstrated he was perfect for the Western genre. Still, he had a few critics; twenty years later veteran stuntman Gil Perkins commented on his horsemanship in Vengeance Valley: &quot;He can ride a horse pretty good now, but at first he was fairly weak at this.&quot; Obviously, the actor greatly improved his equestrian skills because a quarter of his career would eventually be devoted to the Western.\n\nVengeance Valley was shot on location just outside Canyon City, Colorado and Lancaster's co-star on the picture was Robert Walker, playing the part of his wayward foster brother, Lee. Walker walked onto the set with an already controversial reputation; he had been institutionalized for several nervous breakdowns, arrested on one occasion for being drunk and disorderly, and was recently divorced from a turbulent six weeks-long marriage to Barbara Ford, daughter of director John Ford. Because of his acrimonious split with Ford, there was considerable tension on the set of Vengeance Valley between Walker and co-star Joanne Dru, who was a close friend to Barbara Ford. As a result, Dru was not inclined to socialize with Walker after the cameras stopped rolling, nor was co-star John Ireland, who was married to Dru. But the on-screen chemistry between Walker and Lancaster was dynamic and the two became fast friends off camera. The New York Times even noted in its review of the film that &quot;Robert Walker plays the wastrel with almost as much authority as Lancaster does his protector.&quot; In some ways, Walker's performance as the rebellious, self-destructive Lee was a warm-up for his next role as the murderous Bruno in Strangers on a Train (1951), directed by Alfred Hitchcock. Unfortunately, except for the latter film and 1945's The Clock (opposite Judy Garland), Walker's potential was never truly tapped and he died at 32 after performing in only two more pictures.\n\nFilm buffs take note. Be on the lookout for the actor who plays Dick Fasken in Vengeance Valley; it's none other than Hugh O'Brian who became a household name four years later as the title character in the long-running Western TV series, The Life and Legend of Wyatt Earp (1955-1961).\n","torrent":{"xt":"urn:btih:fc5fe7fe6f55a2fd0aa8a26e0ec014f46899e330","amp;dn":"Vengeance+Valley+%5B1951%5D+Burt+Lancaster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc5fe7fe6f55a2fd0aa8a26e0ec014f46899e330","infoHashBuffer":{"type":"Buffer","data":[252,95,231,254,111,85,162,253,10,168,162,110,14,192,20,244,104,153,227,48]},"announce":[],"urlList":[]}}