{"title":"Geister(Riget) - Teile 1 und 2 VHS-Rip","uid":5913138,"size":5767256064,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fc7dd8b299010f1c5412c8cbfbf26efc46c2dac4&amp;dn=Geister%28Riget%29+-+Teile+1+und+2+VHS-Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mihait39","files":11,"time":1288124514,"description":"Hospital der Geister/Geister/Riget\n\nIm kÃƒÂ¶niglichen Reichskrankenhaus von Kopenhagen, dem grÃƒÂ¶ÃƒÅ¸ten Hospital DÃƒÂ¤nemarks, passieren merkwÃƒÂ¼rdige Dinge. Frau Drusse, eine lokale Miss Marple mit Hang zum Spirituellen, hat Kontakt mit dem Geist der kleinen Mary aufgenommen. Der neue Oberarzt Dr. Helmer aus Schweden muss eine verpfuschte Operation vertuschen, wÃƒÂ¤hrend seine verhassten dÃƒÂ¤nischen Kollegen ganz andere Sorgen plagen. Chefarzt Moesgaard hat schon mal Aufkleber fÃƒÂ¼r die Image-Kampagne &quot;Operation Morgensonne&quot; gedruckt, wÃƒÂ¤hrend sein noch studierender Sohn einen abgetrennten Kopf sucht, mit dem er eigentlich nur kurz seine Flamme beeindrucken wollte. Und im Keller des Hospitals, das auf einem alten Friedhof gebaut wurde, betreibt Stationsarzt Haken ein lukratives NebengeschÃƒÂ¤ft mit der Kokainherstellung aus alten Augentropfen.\n\n&quot;Geister&quot; ist eine spannende, schaurige und witzige Mischung aus Krankenhaus-Melodrama, Soap-Opera, Slapstick-KomÃƒÂ¶die, Krimi und Horrorfilm, wie sie nur von Lars von Trier kommen kann.\n\n\n\nIch habe sehr lange gebraucht um die deutsche Synchro dieses MeisterstÃƒÂ¼ckes zu finden und will es nun auch weiter teilen. Ich werde mich weiterhin bemÃƒÂ¼hen, es zu seeden, aber es wird schon eine Zeit lang dauern, da das Teil ja schon fast 6 Gigabyte an sich hat und weil meine Upload-Geschwindigkeit maximal bei etwa 60 Kilobyte liegt. Es ist ein VHS-Rip, die Quali wird also nicht ganz so toll sein, aber es lohnt sich denn es sind alle 11 Originalfolgen enthalten. Bitte nach dem Download seeden,auch wenn ihr eine schwÃƒÂ¤chere Leitung habt.","torrent":{"xt":"urn:btih:fc7dd8b299010f1c5412c8cbfbf26efc46c2dac4","amp;dn":"Geister%28Riget%29+-+Teile+1+und+2+VHS-Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc7dd8b299010f1c5412c8cbfbf26efc46c2dac4","infoHashBuffer":{"type":"Buffer","data":[252,125,216,178,153,1,15,28,84,18,200,203,251,242,110,252,70,194,218,196]},"announce":[],"urlList":[]}}