{"title":"Ke$ha - Take It Off (Xvid-2nafish)","uid":5740409,"size":115112600,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fe10244ea2dd630494b75fc588a9def4f0505e09&amp;dn=Ke%24ha+-+Take+It+Off+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1281013994,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:42\n\n[Video]\nResolution : 1280x720\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 3827 Kbps\nQuality Factor : 0.18 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Take It Off&quot; is a song by American recording artist and songwriter Kesha, from her debut album, Animal. The song was written by Lukasz Gottwald and Claude Kelly and it was produced by Dr. Luke  with vocal editing done by Emily Wright. It was released as the fourth official single from the album on July 13, 2010. &quot;Take It Off&quot; was initially written about when Kesha was attending a drag show, and how she became really turned on by transvestite men taking their clothing off. The song is an upbeat dancepop song that uses heavy amounts of auto tune and utilizes an electro infused beat.\n\nCritical reception of the song has been mixed. A complaint amongst critics was the demonstration of overly processed vocals with the use of auto-tune. Others felt the song was a strong, irresistible dance pop song strictly made for the dance floor with a great carefree message. Due to strong digital sales from the release of Animal, the song charted in the United States, the United Kingdom and Canada.\n\nThe music video for the single was released on August 3, 2010. The video features Kesha and her friends on another planet dancing around in a mosh pit while slowing turning into star dust as they &quot;Take It Off&quot;. Kesha explained in an interview that she didnt want the video to just be about &quot;Taking It Off&quot;, she said the main idea behind the video was about taking off your inhibitions and being &quot;raw and real.&quot;\n\nThe video premiered on Vevo on August 3, 2010. It was directed by Paul Hunter and Dori Oskowitz. While being interviewed Kesha explained the main idea behind the video, &quot;[The video is] about me and all my hot vampire babe friends breaking into a hotel on another planet, and at the end we all turn into this beautiful stardust. Once you take it all off, all your inhibitions, your clothes, we're all made up of the same thing.&quot; She explained that she did not want the video to just be about &quot;Taking it off&quot;, that there was an actual message behind the video explaining, &quot;[The] 'Take It Off' clip isn't just about taking off your clothes and rolling in glitter. It's also about taking off your inhibitions and being raw and real&quot;.\n\nThe video starts off with Kesha seen on a motorcycle. She proceeds to start walking as her friends follow behind her as they enter a motel area. As the chorus of the song starts Kesha and her friends start to run around the motel dancing and jumping off railings. The friends gather around an empty pool and start tearing at each others clothing; While this is happening it is revealed they that are on a different planet and Kesha is seen rolling around in the sand. Slowly as some of the friends start taking off their clothing, they begin to turn into star dust. The group starts to dance in the pool with some of the party goers exploding into dust. The remainder of the friends continue to dance in the dust that is now covering the bottom of the pool. As this is happening they all begin to loose different parts of their bodies as they explode into multicolored star dust. The video ends with everyone as dust with Kesha beginning to &quot;unzip&quot; herself as she turns into yellow dust.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fe10244ea2dd630494b75fc588a9def4f0505e09","amp;dn":"Ke%24ha+-+Take+It+Off+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe10244ea2dd630494b75fc588a9def4f0505e09","infoHashBuffer":{"type":"Buffer","data":[254,16,36,78,162,221,99,4,148,183,95,197,136,169,222,244,240,80,94,9]},"announce":[],"urlList":[]}}