{"title":"Jugend.im.Pornofieber.GERMAN.DOKU.WS.dTV.XViD-MiSFiTS","uid":5696159,"size":370675712,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ff1fe77aff22747547c928f50406e230c466c546&amp;dn=Jugend.im.Pornofieber.GERMAN.DOKU.WS.dTV.XViD-MiSFiTS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1279312415,"description":"&quot;Durch den nahezu ungehinderten Zugang zum Internet ist den Jugendlichen heute so gut wie nichts mehr fremd. So sind ihnen auch sÃƒÂ¤mtliche Spielarten von SexualitÃƒÂ¤t und Pornografie gelÃƒÂ¤ufig. In der Dokumentation berichten Teenager freizÃƒÂ¼gig von ihren Erfahrungen mit Pornos und sprechen ÃƒÂ¼ber ihr Sexualverhalten ohne ein Blatt vor den Mund zu nehmen.\nVor rund fÃƒÂ¼nf Jahren fing es mit der EinfÃƒÂ¼hrung des schnellen Internetzugangs und der Flatrates an. Sie machten den Zugriff auf fast alle Inhalte des World Wide Web in Sekundenschnelle mÃƒÂ¶glich. Die Teenager machten sich rasch mit den neuen Technologien vertraut. So hatten Heranwachsende zum ersten Mal in der Geschichte Zugang zur Pornografie, gratis und unbegrenzt.\nHeute nimmt man an, dass beinahe jeder dritte ElfjÃƒÂ¤hrige bereits einen Pornofilm gesehen hat. Die Dokumentation will die &quot;Generation Porno&quot; kennen lernen und ergrÃƒÂ¼ndet eine Welt, die Jugendliche oft geheim halten und die Erwachsenen hÃƒÂ¤ufig fremd ist.\nVon Gangbang ÃƒÂ¼ber Urophilie bis Gruppensex - den Teenies ist - zumindest in der Theorie - nichts fremd. Die Dokumentation zeichnet sehr persÃƒÂ¶nliche PortrÃƒÂ¤ts von Jugendlichen, die intime Einblicke in ihre Welt geben und erzÃƒÂ¤hlen, auf welchen Internetseiten sie surfen beziehungsweise wie sie es anstellen, dass ihre Eltern nichts merken. Dabei fallen auch emotionale HÃƒÂ¼llen.\nFest steht, dass fÃƒÂ¼r 14-JÃƒÂ¤hrige Pornografie mittlerweile schon zur BanalitÃƒÂ¤t geworden ist. Erregung und &quot;Hypersexualisierung&quot;, zuweilen aber auch Abscheu und Desillusionierung kommen zum Ausdruck, wenn Jugendliche ÃƒÂ¼ber Pornografie sprechen. AuÃƒ","torrent":{"xt":"urn:btih:ff1fe77aff22747547c928f50406e230c466c546","amp;dn":"Jugend.im.Pornofieber.GERMAN.DOKU.WS.dTV.XViD-MiSFiTS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff1fe77aff22747547c928f50406e230c466c546","infoHashBuffer":{"type":"Buffer","data":[255,31,231,122,255,34,116,117,71,201,40,245,4,6,226,48,196,102,197,70]},"announce":[],"urlList":[]}}