{"title":"Velvet Underground &amp; Nico + Vinyl RE-UPLOAD","uid":5887574,"size":4692975925,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ff2df349bba07464f022e82e8dc1668123244f19&amp;dn=Velvet+Underground+%26+Nico+%2B+Vinyl+RE-UPLOAD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"younggod","files":2,"time":1287111810,"description":"Due to the uploading problems with the other V.U. torrent, my next attempt is the original Flac file, I downloaded from Cinemageddon.net. Use an unzip installation such as Jzip(It's free!), if you need it. I was going to do a converted video file, because the VOB files I opened up myself would not upload all the way. It got up to 95% and then just dead stop. I also wanted to leave in the Italian dialogue clip, so you would get the whole thing , along with subtitle/audio options. So, Flac it is. HOPEFULLY.\n \nCompared to what you will usually find online of this film, for my money,this release of classic Warhol/Velvets footage is the one to get. The picture quality is nice and sharp with good audio quality. As good as an old Super 8 will get! Raro Video in Italy put this one out, along with a bunch of other Warhol films, so if you have any interest in old Warhol movies,or things V.U, give them a look!\n\nThings start off with the Warhol adaptation of a play based on A Clockwork Orange. There is a dialogue supplement where an Italian gentlemen elaborates on what it is all about. To be honest, I have only watched it once, and even then I was not paying much attention, and my interest in the Factory only goes so far with Andy, and more so The Velvets and Nico really. I always thought Mary Woronov was killer though.\nFollowing that is the MEAT of this DVD for me, The Velvet Underground &amp; Nico also known as A Symphony Of Sound.\nThis has the V.U. in a jam session at the Factory with Warhol helming the camera filming them for footage that will be used at the subsequent E.P.I. shows.The Velvets lay down some heave drone groove and even Officer Friendly likes it so much, he pops in to offer some sound tech help.\nLive footage of the Velvets is very few and far between and this will be the only filmed document of live Velvets in performance that we will ever get to see, save for those little here and there shots you see of them playing. For some reason with all the cameras around and not a complete show. Damn.\n\nThirdly, you get a couple of dialogue supplements with two gentlemen in the arts and entertainment industry and journalism there, in Italy. Who talk about Vinyl and the music of the Velvet Underground.This section is in Italian language, but, there are English subtitle files provided.If you use VLC or another player with a subtitles file opener, you can easily obtain the subtitles with those.\n\nTotal Running Time: 163:83 \n\nPal Format\nEnglish/Italian audio\nEnglish Subtitles\nAspect: 4:3\nFrame:720X576\nFrame Rate: 25.000\nVideo Codec: MPEG-2\nAudio Codec:AC3 \n\nScreenshots:\n  &lt;a href=&quot;\nhttp://s63.photobucket.com/albums/h129/velvet1966/Vinyl%20And%20The%20Velvet%20Underground/?start=20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s63.photobucket.com/albums/h129/velvet1966/Vinyl%20And%20The%20Velvet%20Underground/?start=20&lt;/a&gt;  ","torrent":{"xt":"urn:btih:ff2df349bba07464f022e82e8dc1668123244f19","amp;dn":"Velvet+Underground+%26+Nico+%2B+Vinyl+RE-UPLOAD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff2df349bba07464f022e82e8dc1668123244f19","infoHashBuffer":{"type":"Buffer","data":[255,45,243,73,187,160,116,100,240,34,232,46,141,193,102,129,35,36,79,25]},"announce":[],"urlList":[]}}